Repository: OpenPecha-Data/0fbd31ce377b49a79da3bbcf2402ad48
Catalog: *.po
Languages: bo

source: may we also play, enjoy, and amuse ourselves in the Palace of Victory, just like Śakra, lord of the gods.’
bo: བདག་ཅག་ ཀྱང་ ཇི་ལྟར་ ལྷ་ -འི་ དབང་པོ་ བརྒྱ་བྱིན་ འདི་ ཁང་ བཟངས་ རྣམ་པ་ -ར་ རྒྱལ་བྱེད་ ཀྱི་ ནང་ ན་ ལྷ་ -འི་ འདོད་པ་ -འི་ ཡོན་ཏན་ ལྔ་པོ་ དག་ གིས་ རྩེ་བ་ དང་ ། དགའ་བ་ དང་ ། དགའ་མགུ་ -ར་ སྤྱོད་པ་ -ར་ བྱེད་པ་ དེ་ལྟར་ གྱུར་ཅིག་ ཅེས་

source: “However, those beings would not understand that this would merely be a reflection in the wide earth of beryl, a reflection occurring due to the complete purity of the beryl, wherein the abode of the Thirty-Three, along with Śakra, lord of the gods, and his Palace of Victory, could be seen.
bo: ཀྱང་ ། སེམས་ཅན་ དེ་དག་ གིས་ ནི་ འདི་ལྟར་ བེེ་ དཱུཪྱ་ ཆེན་པོ་ -འི་ རང་བཞིན་ གྱིས་ གཞི་ ཆེན་པོ་ ལ་ སུམ་ཅུ་རྩ་གསུམ་པ་ -འི་ གནས་ དང་ ། ཁང་ བཟངས་ རྣམ་པ་ -ར་ རྒྱལ་བྱེད་ དང་ ། ལྷ་ -འི་ དབང་པོ་ བརྒྱ་བྱིན་ སྣང་བ་ འདི་ ནི་ བེེ་ དཱུཪྱ་ ཆེན་པོ་ -འི་ རང་བཞིན་ ཡོངས་སུ་ དག་པ་ -འི་ ཕྱིར་ ། གཟུགས་བརྙན་ ཀུན་ ཏུ་ སྣང་བ་ ཡིན་ ནོ་ ཞེས་ དེ་ལྟར་ ཡོངས་སུ་ མི་ ཤེས་ ཏེ་ །

source: Wishing for the state of Śakra, they would then offer gifts and make merits.
bo: དེ་དག་ བརྒྱ་བྱིན་ ཉིད་ འདོད་པ་ -ས་ སྦྱིན་པ་ དག་ ཀྱང་ སྦྱིན་ ། བསོད་ནམས་ དག་ ཀྱང་ བྱེད་

source: They would take up discipline and abide by that. They would then dedicate the roots of what is wholesome toward birth in that reflection of the abode of the Thirty-Three.
bo: ཚུལ་ཁྲིམས་ དག་ ཀྱང་ ཡང་དག་པ་ -ར་ བླངས་ ཏེ་ གནས་ ཤིང་ དགེ་བ་ -འི་ རྩ་བ་ དག་ ཀྱང་ སུམ་ཅུ་རྩ་གསུམ་པ་ -འི་ གནས་ སྣང་བ་ དེ་ -ར་ སྐྱེ་བ་ -ར་ བྱ་བ་ -འི་ ཕྱིར་ ཡོངས་སུ་ སྔོ་བ་ -ར་ བྱེད་ ན་ །

source: “Mañjuśrī, in that wide earth of beryl there would, of course, be no abode of the Thirty-Three, and neither would there be a Palace of Victory, or Śakra, lord of the gods.
bo: འཇམ་དཔལ་ ཇི་ལྟར་ བེེ་ དཱུཪྱ་ ཆེན་པོ་ རང་བཞིན་ གྱིས་ གཞི་ ཆེན་པོ་ དེ་ ལ་ སུམ་ཅུ་རྩ་གསུམ་པ་ -འི་ གནས་ ཀྱང་ མེད་ ། ཁང་ བཟངས་ རྣམ་པ་ -ར་ རྒྱལ་བྱེད་ ཀྱང་ མེད་ ། ལྷ་ -འི་ དབང་པོ་ བརྒྱ་བྱིན་ ཡང་ མེད་ མོད་ ཀྱི་ །

source: However, due to the purity of the great beryl,
bo: འོན་ཀྱང་ བེེ་ དཱུཪྱ་ ཆེན་པོ་ ཡོངས་སུ་ དག་པ་ -འི་ ཕྱིར་ །

source: the abode of the Thirty-Three along with the Palace of Victory and Śakra, lord of the gods would all be visible.
bo: དེ་ ལ་ སུམ་ཅུ་རྩ་གསུམ་པ་ -འི་ གནས་ དང་ ། ཁང་ བཟངས་ རྣམ་པ་ -ར་ རྒྱལ་བྱེད་ དང་ ། ལྷ་ -འི་ དབང་པོ་ བརྒྱ་བྱིན་ གྱི་ གཟུགས་བརྙན་ ཀུན་ ཏུ་ སྣང་ སྟེ་ །

source: Non-existent, non-arisen, and non-ceased, their reflections would be seen because of the purity of the great beryl.
bo: དེ་དག་ ཀྱང་ ཡོད་པ་ མ་ ཡིན་ ཞིང་ སྐྱེ་བ་ མེད་པ་ དང་ ། འགག་པ་ མེད་པ་ མ་ ཡིན་ བཞིན་ དུ་ བེེ་ དཱུཪྱ་ ཆེན་པོ་ ཡོངས་སུ་ དག་པ་ -འི་ ཕྱིར་ ། གཟུགས་བརྙན་ ཀྱང་ ཀུན་ ཏུ་ སྣང་བ་ དེ་བཞིན་ དུ་ །

source: “In the same way, Mañjuśrī, it is due to the complete purity of the mind, as well as due to proper cultivation, that sentient beings see the body of a tathāgata.
bo: འཇམ་དཔལ་ སེམས་ ཡོངས་སུ་ དག་པ་ དང་ བསྒོམ་པ་ ཤིན་ཏུ་ གོམས་པ་ -ར་ བྱས་པ་ -འི་ སེམས་ཅན་ ལ་ དེ་བཞིན་ གཤེགས་པ་ -འི་ སྐུ་ སྣང་བ་ -ར་ གྱུར་ །

source: Mañjuśrī, it is due to the power of the Tathāgata that sentient beings see him.
bo: འཇམ་དཔལ་ དེ་བཞིན་ གཤེགས་པ་ -འི་ མཐུ་ -ས་ སེམས་ཅན་ རྣམས་ ཀྱིས་ དེ་བཞིན་ གཤེགས་པ་ -འི་ སྐུ་ མཐོང་བ་

source: And still he remains non-existent, non-arisen, and non-ceased.
bo: དེ་ཡང་ མ་བྱུང་བ་ ། མ་ སྐྱེས་པ་ མ་ འགགས་པ་

source: He is neither existence nor non-existence,
bo: དངོས་པོ་ མ་ ཡིན་ ། དངོས་པོ་ མེད་པ་ མ་ ཡིན་ །

source: neither visible nor invisible,
bo: བལྟ་ -ར་ སྣང་བ་ མ་ ཡིན་ ། བལྟ་ -ར་ མི་སྣང་བ་ མ་ ཡིན་ །

source: neither worldly nor unworldly,
bo: འཇིག་རྟེན་ མ་ ཡིན་ ། འཇིག་རྟེན་ མེད་པ་ མ་ ཡིན་ །

source: neither an object of thinking nor not an object of thinking,
bo: བསམ་ དུ་ཡོད་པ་ མ་ ཡིན་ ། བསམ་ དུ་ མེད་པ་ མ་ ཡིན་ །

source: neither existent nor non-existent.
bo: ཡོད་པ་ མ་ ཡིན་ ། མེད་པ་ མ་ ཡིན་མོད་ ཀྱི་ །

source: “It is so, Mañjuśrī, that sentient beings focus on the reflection of the Tathāgata
bo: འཇམ་དཔལ་ འོན་ཀྱང་ སེམས་ཅན་ རྣམས་ ནི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ གཟུགས་བརྙན་ ལ་ དམིགས་ ནས་

source: and offer it flowers, perfumes, garments, and jewels while making this aspiration:
bo: མེ་ཏོག་ ཀྱང་ འཐོར་བ་ -ར་ བྱེད་ ། སྤོས་ དང་ ། ནམ་མཁའ་ དང་ ། རིན་པོ་ཆེ་ དག་ ཀྱང་ དབུལ་བ་ -ར་ བྱེད་ ཅིང་ ། ཚིག་ འདི་སྐད་ ཅེས་

source: ‘May we also become like the Tathāgata, the Arhat, the Perfect and Complete Buddha.’
bo: བདག་ཅག་ ཀྱང་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་པ་ -ར་ རྫོགས་པ་ -འི་ སངས་རྒྱས་ ཅི་འདྲ་བ་ དེ་ འདྲ་བ་ -ར་ གྱུར་ཅིག་ ཅེས་

source: Wishing for a buddha’s awareness,
bo: སངས་རྒྱས་ ཀྱི་ ཡེ་ཤེས་ འདོད་པ་

source: they offer gifts and make merit.
bo: དེ་དག་ བདག་ ཀྱང་ སྦྱིན་པ་ དག་ ཀྱང་ སྦྱིན་ བསོད་ནམས་ དག་ ཀྱང་ བྱེད་ །

source: They take up discipline and abide by it.
bo: ཚུལ་ཁྲིམས་ ཡང་དག་པ་ -ར་ བླངས་ ཏེ་ གནས་ ཤིང་

source: Then they dedicate that root of what is wholesome toward obtaining a tathāgata’s awareness.
bo: དེ་དག་ ཀྱང་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ཡེ་ཤེས་ ཐོབ་པ་ -ར་ བྱ་བ་ -འི་ ཕྱིར་ ། ཡོངས་སུ་ སྔོ་བ་ -ར་ བྱེད་ དོ་ ། །

source: “It is as follows: Mañjuśrī,
bo: འཇམ་དཔལ་ འདི་ལྟ་སྟེ་ དཔེར་ན་ །

source: the reflection of Śakra, ruler of the gods, on that wide earth made of beryl does not move.
bo: བེེ་ དཱུཪྱ་ ཆེན་པོ་ -འི་ རང་བཞིན་ གྱི་ ས་གཞི་ ཆེན་པོ་ དེ་ ལ་ ལྷ་ -འི་ དབང་པོ་ བརྒྱ་བྱིན་ གྱི་ གཟུགས་བརྙན་ སྣང་བ་ དེ་ གཡོ་ བར་མི་ བྱེད་ །

source: Nor does he think, elaborate, construct, or conceptualize.
bo: སེམས་པ་ -ར་ མི་ བྱེད་ ། སྤྲོ་བ་ -ར་ མི་ བྱེད་ ། རྟོག་པ་ -ར་ མི་ བྱེད་ ། རྣམ་པ་ -ར་ རྟོག་པ་ -ར་ མི་ བྱེད་ ཅིང་ །

source: It is not a construct, not a concept, inconceivable, and not a mental placement.
bo: རྟོག་པ་ མེད་པ་ ། རྣམ་པ་ -ར་ རྟོག་པ་ མེད་པ་ ། སེམས་པ་ མེད་པ་ ། ཡིད་ ལ་ བྱེད་པ་ མེད་པ་ །

source: He is peaceful and cool, non-arising and non-cessation,
bo: ཞི་བ་ བསིལ་བ་ -ར་ གྱུར་པ་ ། སྐྱེ་བ་ མེད་པ་ ། འགག་པ་ མེད་པ་ །

source: not seen, not heard, not smelt, not tasted, not touched,
bo: མཐོང་བ་ མེད་པ་ ། ཐོས་པ་ མེད་པ་ ། བསྣམས་པ་ མེད་པ་ ། མྱངས་པ་ མེད་པ་ ། རེག་པ་ མེད་པ་ །

source: not a sign, not a cognition, and not something that can be made known.
bo: མཚན་མ་ མེད་པ་ ། རྣམ་པ་ -ར་ རིག་པ་ མེད་པ་ ། རྣམ་པ་ -ར་ རིག་པ་ -ར་ བྱ་བ་ མ་ཡིན་པ་ །

source: “In the same way, Mañjuśrī, the Tathāgata, the Arhat, the Perfect and Complete Buddha does not move.
bo: དེ་བཞིན་ དུ་ འཇམ་དཔལ་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་པ་ -ར་ རྫོགས་པ་ -འི་ སངས་རྒྱས་ ཀྱང་ ། གཡོ་ བར་མི་ བྱེད་ །

source: He is not a construct, not a concept, inconceivable, not a mental placement.
bo: རྟོག་པ་ མེད་པ་ དང་ ། རྣམ་པ་ -ར་ རྟོག་པ་ མེད་པ་ དང་ ། སེམས་པ་ མེད་པ་ ། ཡིད་ ལ་ བྱེད་པ་ མེད་པ་ །

source: “Mañjuśrī, the Tathāgata is in the realm of non-arising.
bo: འཇམ་དཔལ་ དེ་བཞིན་ གཤེགས་པ་ ནི་ སྐྱེ་བ་ མེད་པ་ -འི་ གནས་ ཡིན་མོད་ ཀྱི་ །

source: On the other hand, he appears in the world as a reflected image.
bo: འོན་ཀྱང་ འཇིག་རྟེན་ ན་ གཟུགས་བརྙན་ བཞིན་ དུ་ སྣང་ ཞིང་

source: According to the beliefs of sentient beings he displays diverse appearances and diverse lifespans.
bo: སེམས་ཅན་ རྣམས་ ཀྱི་ མོས་པ་ ཇི་ལྟ་བ་ བཞིན་ དུ་ མཐོང་བ་ -འི་ བྱེ་བྲག་ གིས་ ཚེ་ -འི་ བྱེ་བྲག་ སྟོན་པ་ -ར་ ཡང་ བྱེད་ ལ་ །

source: He appears among sentient beings who have become fitting receptacles for awakening thanks to their maturation and belief.
bo: ཡོངས་སུ་ སྨིན་པ་ དང་ མོས་པ་ -འི་ སྟོབས་ བསྐྱེད་པ་ -ས་ ། བྱང་ཆུབ་ ཀྱི་ སྣོད་ དུ་ གྱུར་པ་ -འི་ སེམས་ཅན་ རྣམས་ ལ་ གཟུགས་བརྙན་ སྣང་བ་ -ར་ ཡང་ འགྱུར་ ཏེ་ །

source: These sentient beings then hear the Dharma according to their dispositions and beliefs.
bo: སེམས་ཅན་ རྣམས་ ཀྱི་ བསམ་པ་ དང་ མོས་པ་ ཇི་ལྟ་བ་ བཞིན་ དུ་ ཆོས་ ཐོས་པ་ -ར་ ཡང་ འགྱུར་ །

source: According to their dispositions they understand the three vehicles
bo: བསམ་པ་ ཇི་ལྟ་བ་ བཞིན་ དུ་ ཐེག་པ་ གསུམ་ དུ་ ཤེས་པ་ -ར་ ཡང་ འགྱུར་ ། །

source: “It is as follows: Mañjuśrī,
bo: འཇམ་དཔལ་ འདི་ལྟ་སྟེ་ དཔེར་ན་ །

source: a great Dharma drum for making sounds of Dharma, which come about through the force of merit of the gods of the Thirty-Three,
bo: སུམ་ཅུ་རྩ་གསུམ་པ་ -འི་ ལྷ་ རྣམས་ ཀྱི་ བསོད་ནམས་ ཀྱི་ སྟོབས་ ཀྱིས་ གྲུབ་པ་ -འི་ ཆོས་ ཀྱི་ རྔ་བོ་ ཆེ་ ཆོས་ ཀྱི་ སྒྲ་ ཞེས་ བྱ་བ་ ཞིག་

source: is placed in the atmosphere above the Vaijayanta Palace,
bo: ཁང་ བཟངས་ རྣམ་པ་ -ར་ རྒྱལ་བྱེད་ ཀྱི་ སྟེང་ གི་ བར་སྣང་ ལ་ འདུག་ ཅིང་ །

source: beyond visible range. The divine scions cannot see it or behold it.
bo: ལྷ་ -འི་ བུ་ ཐམས་ཅད་ ཀྱི་ མིག་ལམ་ ལས་ ཡང་དག་པ་ -ར་ འདས་ ཏེ་ ། བལྟ་ -ར་ མི་ སྣང་ ཞིང་ མི་ མཐོང་ མོད་ ཀྱི་

source: “However, Mañjuśrī, it is a great Dharma drum.
bo: འཇམ་དཔལ་ འོན་ཀྱང་ ཆོས་ ཀྱི་ རྔ་བོ་ ཆེ་ དེ་

source: Sometimes the gods in the heaven of the Thirty-Three become so intensely and continuously oblivious from playing with, enjoying, and delighting themselves with their divine pleasures
bo: གང་ གི་ ཚེ་ སུམ་ཅུ་རྩ་གསུམ་པ་ -འི་ རིས་ ཀྱི་ ལྷ་ རྣམས་ ལྷ་ -འི་ འདོད་པ་ -འི་ རྩེད་མོ་ དང་ ། དགའ་བ་ དང་ ། ལོངས་སྤྱོད་ དག་ གིས་ རྟག་པ་ -ར་ རྒྱུན་ དུ་ ཤས་ ཆེ་ -ར་ བག་མེད་པ་ -ར་ གྱུར་ ཅིང་ །

source: that they fail to enter the divine hall called Sudharma to jointly chant the Dharma.
bo: ཡང་ དང་ ཡང་ དུ་ ལྷ་ -འི་ འདུན་ས་ ཆོས་ བཟང་ གི་ ནང་ དུ་ ཞུགས་ ཏེ་ ། ཆོས་ ཡང་དག་པ་ -ར་ བགྲོ་བ་ -ར་ མི་ བྱེད་པ་

source: And, Mañjuśrī, Śakra, lord of the gods, becomes so intensely and continuously oblivious from playing with, enjoying, and delighting himself with his divine pleasures
bo: འཇམ་དཔལ་ གང་ གི་ ཚེ་ ལྷ་ -འི་ དབང་པོ་ བརྒྱ་བྱིན་ ཡང་ ལྷ་ -འི་ འདོད་པ་ -འི་ རྩེད་མོ་ དང་ ། དགའ་བ་ དང་ ། ལོངས་སྤྱོད་ དག་ གིས་ རྟག་པ་ -ར་ རྒྱུན་ དུ་ ཤས་ ཆེ་ -ར་ བག་མེད་པ་ -ར་ གྱུར་ ཅིང་ །

source: that he fails to sit on his Dharma seat to speak of the Dharma.
bo: ཆོས་ ཀྱི་ ཁྲི་སྟན་ ལ་ འདུག་ ནས་ ཆོས་ སྨྲ་བ་ -ར་ མི་ བྱེད་པ་ དེ་ -འི་ ཚེ་ །

source: “Mañjuśrī, at such times, that great Dharma drum,
bo: ཆོས་ ཀྱི་ རྔ་བོ་ ཆེ་བ་ -ར་ སྣང་ ལ་ འདུག་ ཅིང་ །

source: not to be seen or beheld, hanging in the atmosphere beyond visible range,
bo: མིག་ གི་ ལམ་ ལས་ ཡང་དག་པ་ -ར་ འདས་ ཏེ་ ། བལྟ་ -ར་ མི་ སྣང་ ཞིང་ མི་ མཐོང་བ་

source: plays a Dharma sound that addresses all the gods in the heaven of the Thirty-Three,
bo: དེ་ལས་ ཆོས་ ཀྱི་ སྒྲ་ འདི་ ལྟ་བུ་ འབྱུང་བ་ -ར་ འགྱུར་ ཏེ་ ། ཆོས་ ཀྱི་ སྒྲ་ དེ་ -ས་ སུམ་ཅུ་རྩ་གསུམ་པ་ -འི་ རིས་ ཀྱི་ ལྷ་ ཐམས་ཅད་ ལ་ འདི་སྐད་ དུ་ །

source: ‘Friends! Form, sound, smell, flavor, and touch are impermanent;
bo: གྲོགས་པོ་ དག་ གཟུགས་ དང་ ། སྒྲ་ དང་ ། དྲི་ དང་ ། རོ་ དང་ ། རེག་བྱ་ དག་ ནི་ མི་རྟག་པ་ ཡིན་ གྱིས་ །

source: do not be careless.
bo: བག་མེད་ པར་མ་ སྤྱོད་ ཅིག་ །

source: Do not quickly fall down from this abode!
bo: གནས་ འདི་ ནས་ མྱུར་ དུ་ ཤི་འཕོས་པ་ -ར་ གྱུར་ ཏ་ རེ་ །

source: Friends, all co-producing factors are suffering!
bo: གྲོགས་པོ་ དག་ འདུ་བྱེད་ ཐམས་ཅད་ ནི་ སྡུག་བསྔལ་བ་ ཡིན་ ནོ་ ། །

source: Friends, all co-producing factors are empty!
bo: གྲོགས་པོ་ དག་ འདུ་བྱེད་ ཐམས་ཅད་ ནི་ སྟོང་པ་ ཡིན་ ནོ་ ། །

source: Friends, all co-producing factors are without self!
bo: གྲོགས་པོ་ དག་ འདུ་བྱེད་ ཐམས་ཅད་ ནི་ བདག་མེད་པ་ ཡིན་ ནོ་ ། །

source: for those who die and fall from here, to take birth here once again is difficult.
bo: གྲོགས་པོ་ དག་ འདི་ ནས་ ཤི་འཕོས་པ་ རྣམས་ ནི་ ཡང་ འདི་ -ར་ སྐྱེ་བ་ -ར་ འགྱུར་བ་ དཀའ་བ་ ཡིན་ གྱིས་

source: Do not become careless:
bo: བག་མེད་ པར་མ་ བྱེད་པ་ -ར་

source: delight in the pleasant joy of Dharma.
bo: ཆོས་ ཀྱི་ ཀུན་དགའ་ ལ་ དགའ་བ་ -ས་ དགའ་བ་ -ར་ གྱིས་ ཤིག

source: being inclined toward the Dharma,
bo: ཆོས་ ལ་ གཞོལ་བ་ དང་ །

source: with Dharma pouring like rain, recollecting and placing the Dharma in the mind.
bo: ཆོས་རྗེ་ -ས་ སུ་ དྲན་པ་ ཡིད་ ལ་ བྱེད་པ་ ལ་ གནས་པ་ -ར་ གྱིས་ ཤིག་ །

source: You shall not then have to part from these divine enjoyments and delights in games of pleasure.’
bo: ལྷ་ -འི་ འདོད་པ་ -འི་ རྩེད་མོ་ དང་ དགའ་བ་ དང་ ། ལོངས་སྤྱོད་ འདི་དག་ དང་ ཡང་ མི་ འབྲལ་བ་ -ར་ གྱིས་ ཤིག་ །

source: “At that time, Mañjuśrī, due to the sound of that great Dharma drum—
bo: འཇམ་དཔལ་ དེ་ -འི་ ཚེ་ ན་ ཆོས་ ཀྱི་ རྔ་བོ་ ཆེ་ དེ་ བལྟ་ -ར་

source: invisible, formless, inconceivable, not a mental construct,
bo: མི་སྣང་བ་ ། གཟུགས་ མེད་པ་ ། རྟོག་པ་ མེད་པ་ ། རྣམ་པ་ -ར་ རྟོག་པ་ མེད་པ་ །

source: out of sight,
bo: མིག་ གི་ ལམ་ ལས་ ཡང་དག་པ་ -ར་ འདས་པ་ །

source: unborn, unceasing, beyond the way of words,
bo: མ་ སྐྱེས་པ་ ། མ་ འགགས་པ་ ། ཚིག་ གི་ ལམ་ ལས་ ཡང་དག་པ་ -ར་ འདས་པ་ །

source: and devoid of mind, mentality, and consciousness
bo: སེམས་ དང་ ། ཡིད་ དང་ ། རྣམ་པ་ -ར་ ཤེས་པ་ དང་ བྲལ་བ་

source: —all the gods in the heaven of the Thirty-Three are roused, scared, alarmed, and very distressed.
bo: དེ་ལྟ་ བུ་ དེ་ -འི་ སྒྲ་ དེ་ -ས་ སུམ་ཅུ་རྩ་གསུམ་པ་ -འི་ རིས་ ཀྱི་ ལྷ་ ཐམས་ཅད་ ལ་ ཡང་དག་པ་ -ར་ བསྐུལ་བ་ -ས་ དེ་དག་ འཇིགས་པ་ དང་ ། སྐྲག་པ་ དང་ ། སྐྱོ་བ་ དང་ ། ཡིད་ བྱུང་བ་ -ར་ གྱུར་ ནས་

source: They enter the divine hall called Sudharma
bo: ལྷ་ -འི་ འདུན་ས་ ཆོས་ བཟང་ གི་ ནང་ དུ་ ཞུགས་ ཏེ་ །

source: delighting in the pleasant joy of Dharma.
bo: ཆོས་ ཀྱི་ ཀུན་དགའ་ ལ་ དགའ་བ་ -ས་ དགའ་བ་ -ར་ གནས་ ཤིང་ །

source: They make the Dharma their essence,
bo: ཆོས་ གཅེས་པ་ -ར་ བྱ་བ་ དང་ །

source: they become inclined toward the Dharma,
bo: ཆོས་ ལ་ གཞོལ་བ་ -ར་ བྱ་བ་ དང་ །

source: recollecting and keeping the Dharma in mind.
bo: ཆོས་རྗེ་ -ས་ སུ་ དྲན་པ་ ཡིད་ ལ་ བྱེད་པ་ ལ་ གནས་པ་ -ར་ ཡང་ བྱེད་ དེ་ །

source: When they die and fall from that abode, they will again reach excellent places.
bo: དེ་དག་ དེ་ནས་ ཤི་འཕོས་ ནས་ ཁྱད་པར་ དུ་ འགྲོ་བ་ -ར་ ཡང་ ཤེས་ སོ་ ། །

source: Śakra, the king of the gods, then enters Sudharma, the divine hall,
bo: དེ་ -འི་ ཚེ་ ན་ ལྷ་ -འི་ དབང་པོ་ བརྒྱ་བྱིན་ ཡང་ ལྷ་ -འི་ འདུན་ས་ ཆོས་ བཟང་ གི་ ནང་ ན་ ཞུགས་ ཏེ་ །

source: takes a seat on the Dharma throne, and teaches the Dharma.
bo: ཆོས་ ཀྱི་ ཁྲི་སྟན་ ལ་ འདུག་ ནས་ ཆོས་སྟོན་པ་ -ར་ བྱེད་ དོ་ ། །

source: “Mañjuśrī, when the demigods battle against the gods,
bo: འཇམ་དཔལ་ གང་ གི་ ཚེ་ལྷ་མ་ ཡིན་ རྣམས་ ལྷ་ རྣམས་ དང་ ལྷན་ཅིག་ གཡུལ་སྤྲོད་པ་ -ར་ བྱེད་ ཅིང་ །

source: whenever the gods of the heaven of the Thirty-Three are being defeated,
bo: དེ་ -ར་ ཡང་ གང་ གི་ ཚེ་ སུམ་ཅུ་རྩ་གསུམ་པ་ -འི་ ལྷ་ རྣམས་ ཕམ་པ་ -ར་ གྱུར་པ་ དེ་ -འི་ ཚེ་ ན་ །

source: the Dharma drum emits a sound that makes the demigods so frightened, alarmed, agitated, and distressed that they flee.
bo: ཆོས་ ཀྱི་ རྔ་བོ་ ཆེ་ དེ་སྒྲ་ འདི་ ལྟ་བུ་ འབྱིན་པ་ -ར་ བྱེད་ དེ་ ། སྒྲ་ དེ་ -ས་ ལྷ་མ་ ཡིན་ རྣམས་ འཇིགས་པ་ དང་ ། སྐྲག་པ་ དང་ ། སྐྱོ་བ་ དང་ ། ཡིད་ བྱུང་བ་ -ར་ གྱུར་ ནས་ འབྲོས་པ་ -ར་ བྱེད་ དོ་ ། །

source: Nevertheless, Mañjuśrī, that great Dharma drum does not have a producer,
bo: འཇམ་དཔལ་ ཆོས་ ཀྱི་ རྔ་བོ་ ཆེ་ དེ་ ལ་ ནི་ སྒྲུབ་པ་ -ར་ བྱེད་པ་ དང་ །

source: nor does it have a body.
bo: ལུས་ གཟུགས་ ཅུང་ཟད་ ཀྱང་ མེད་ དེ་ །

source: Mañjuśrī, that Dharma drum is invisible,
bo: འཇམ་དཔལ་ ཆོས་ ཀྱི་ རྔ་བོ་ ཆེ་ དེ་ ནི་ བལྟ་ -ར་ མི་ མཐོང་བ་ །

source: not to be beheld, not true,
bo: མི་སྣང་བ་ ཡོད་པ་ མ་ཡིན་པ་ །

source: not real, with no mind, without intention,
bo: མ་བྱུང་བ་ ། བསམ་ དུ་ མེད་པ་ ། སེམས་པ་ མེད་པ་ །

source: sign-less,
bo: མཚན་མ་ མེད་པ་ །

source: voiceless,
bo: སྒྲ་མེད་པ་ །

source: immaterial,
bo: དངོས་པོ་ མེད་པ་ །

source: non-dual,
bo: གཉིས་ སུ་ མེད་པ་ སྟེ་ །

source: and out of sight.
bo: མིག་ གི་ ལམ་ ལས་ ཡང་དག་པ་ -ར་ འདས་པ་

source: “Nevertheless, Mañjuśrī, for those gods in the heaven of the Thirty-Three who have previously purified themselves,
bo: འཇམ་དཔལ་ འོན་ཀྱང་ སུམ་ཅུ་རྩ་གསུམ་ གྱི་ རིས་ ཀྱི་ ལྷ་ -འི་ བུ་ སྔོན་ ཡོངས་སུ་ སྦྱང་བ་ བྱས་པ་ རྣམས་ ལ་ །

source: a sound comes forth from the great Dharma drum.
bo: ཆོས་ ཀྱི་ རྔ་བོ་ ཆེ་ དེ་སྒྲ་ དེ་ལྟ་ བུ་ འབྱིན་ ཅིང་

source: It occurs to pacify all the misfortunes, troubles, and afflictions of the gods of the Thirty-Three.
bo: སུམ་ཅུ་རྩ་གསུམ་པ་ -འི་ རིས་ ཀྱི་ ལྷ་ -འི་ བུ་ རྣམས་ ཀྱི་ གནོད་པ་ དང་ ། འཁྲུག་པ་ དང་ ཉེ་བ་ -འི་ ཉོན་མོངས་པ་ ཐམས་ཅད་ ཉེ་བར་ ཞི་བ་ -ར་ བྱེད་ དོ་ ། །

source: “Mañjuśrī, in the same way that from that great Dharma drum,
bo: འཇམ་དཔལ་ ཇི་ལྟར་ ཆོས་ ཀྱི་ རྔ་བོ་ ཆེ་ དེ་ བལྟ་ -ར་

source: invisible,
bo: མི་སྣང་བ་ །

source: not to be beheld,
bo: མི་ མཐོང་བ་ །

source: not true, not real, with no mind, without intention,
bo: ཡོད་པ་ མ་ཡིན་པ་ ། མ་བྱུང་བ་ ། བསམ་ དུ་ མེད་པ་ ། སེམས་པ་ མེད་པ་ །

source: sign-less,
bo: མཚན་མ་ མེད་པ་ །

source: formless,
bo: གཟུགས་ཅན་ མ་ཡིན་པ་ །

source: voiceless, immaterial,
bo: སྒྲ་མེད་པ་ དངོས་པོ་ མེད་པ་ །

source: non-dual,
bo: གཉིས་ སུ་ མེད་པ་ སྟེ་ །

source: and out of sight
bo: མིག་ གི་ ལམ་ ལས་ ཡང་དག་པ་ -ར་ འདས་པ་

source: that sound of Dharma occurs to pacify all the misfortunes, troubles, and afflictions of the gods of the Thirty-Three,
bo: ཆོས་ ཀྱི་ སྒྲ་ དེ་ཡང་ སུམ་ཅུ་རྩ་གསུམ་པ་ -འི་ རིས་ ཀྱི་ ལྷ་ -འི་ བུ་ རྣམས་ ཀྱི་ གནོད་པ་ དང་ ། འཁྲུག་པ་ དང་ ཉེ་བ་ -འི་ ཉོན་མོངས་པ་ ཐམས་ཅད་ ཉེ་བར་ ཞི་བ་ -ར་ བྱེད་ དོ་ ། །

source: so, too, Mañjuśrī, although the Tathāgata, the Arhat, the Perfect and Complete Buddha is invisible,
bo: འཇམ་དཔལ་ དེ་བཞིན་ དུ་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་པ་ -ར་ རྫོགས་པ་ -འི་ སངས་རྒྱས་ ཀྱང་ བལྟ་ -ར་ མི་སྣང་བ་ །

source: not true, not real,
bo: ཡོད་པ་ མ་ཡིན་པ་ ། མ་བྱུང་བ་ །

source: with no mind, without intention,
bo: བསམ་ དུ་ མེད་པ་ ། སེམས་པ་ མེད་པ་ །

source: and out of sight, nevertheless,
bo: མིག་ གི་ ལམ་ ལས་ ཡང་དག་པ་ -ར་ འདས་པ་ ཡིན་མོད་ ཀྱི་ །

source: Mañjuśrī, sentient beings perceive the voice of Dharma due to the maturation of previous karma, according to their individual aspirations and interests.
bo: འཇམ་དཔལ་ འོན་ཀྱང་ སེམས་ཅན་ རྣམས་ སྔོན་ གྱི་ ལས་ ཀྱི་ རྣམ་པ་ -ར་ སྨིན་པ་ -ས་ བསམ་པ་ དང་ ། མོས་པ་ ཇི་ལྟ་བ་ བཞིན་ དུ་ ། ཆོས་ ཀྱི་ སྒྲ་ འབྱུང་བ་ -ར་ ཀུན་ ཏུ་ ཤེས་ ཤིང་ །

source: And that sound of Dharma occurs to pacify all misfortunes, troubles, and afflictions of all sentient beings.
bo: ཆོས་ ཀྱི་ སྒྲ་ དེ་ཡང་ སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ གནོད་པ་ དང་ ། འཁྲུག་པ་ དང་ ཉེ་བ་ -འི་ ཉོན་མོངས་པ་ ཐམས་ཅད་ ཉེ་བར་ ཞི་བ་ -ར་ བྱ་བ་ -འི་ ཕྱིར་ ། འཇུག་པ་ -ར་ འགྱུར་ ཏེ་ །

source: Being the voice of Dharma, it is regarded in the world as the voice of the Tathāgata.
bo: ཆོས་ ཀྱི་ སྒྲ་ སྐད་ ཀྱིས་ འཇིག་རྟེན་ ན་ དེ་བཞིན་ གཤེགས་པ་ -འི་ གསུང་ ཞེས་ བྱ་བ་ -འི་ གྲངས་ སུ་ འགྲོ་ -འོ་ །

source: “Mañjuśrī, there is no Tathāgata.
bo: འཇམ་དཔལ་ དེ་བཞིན་ གཤེགས་པ་ ནི་ ཡོད་པ་ མ་ ཡིན་མོད་ ཀྱི་ །

source: However, the designation ‘Tathāgata’ comes about in the world because of the voice of Dharma.
bo: འོན་ཀྱང་ འཇིག་རྟེན་ ནི་ ཆོས་ ཀྱི་ སྒྲ་ སྐད་ ཀྱིས་ དེ་བཞིན་ གཤེགས་པ་ ཞེས་ བྱ་བ་ -ར་ གདགས་པ་ འབྱུང་ སྟེ་ །

source: It is exclusively due to the maturation of sentient beings’ previous wholesome karma
bo: སེམས་ཅན་ རྣམས་ ཁོ་ན་ -འི་ སྔོན་ གྱི་ དགེ་བ་ -འི་ རྩ་བ་ -འི་ ལས་ ཀྱི་ རྣམ་པ་ -ར་ སྨིན་པ་ -ས་ སེམས་ཅན་ ཐམས་ཅད་ ཀྱིས་ །

source: that they perceive the voice of the Tathāgata.
bo: དེ་བཞིན་ གཤེགས་པ་ ལས་སྒྲ་ འབྱུང་བ་ -ར་ ཀུན་ ཏུ་ ཤེས་ སོ་ ། །

source: That voice emerges in order to produce happiness for all sentient beings and to prompt those who are careless.
bo: སྒྲ་ དེ་ཡང་ སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ བདེ་བ་ ཐམས་ཅད་ ཡང་དག་པ་ -ར་ བསྐྱེད་པ་ -ར་ བྱ་བ་ དང་ ། བག་མེད་པ་ རྣམས་ ལ་ ཡང་དག་པ་ -ར་ བསྐུལ་བ་ -ར་ བྱ་བ་ -འི་ ཕྱིར་ བྱུང་ སྟེ་ །

source: Mañjuśrī, as those sentient beings hear that sound,
bo: འཇམ་དཔལ་ སེམས་ཅན་ དེ་དག་ གིས་ སྒྲ་ དེ་ ཐོས་ ནས་ །

source: they form the concept of a tathāgata, thinking, ‘This is the Tathāgata’s body.’
bo: འདི་ ནི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ སྐུ་ ཡིན་ ནོ་ སྙམ་ དུ་ དེ་བཞིན་ གཤེགས་པ་ ལ་ རྟོག་པ་ -ར་ ཡང་ བྱེད་ དོ་ ། །

source: “The speech of the Tathāgata is heard so that beginner bodhisattvas and all immature, ordinary people may generate roots of what is wholesome by taking the Tathāgata as their reference point.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ ལས་ དང་པོ་པ་ རྣམས་ དང་ ། བྱིས་པ་ སོ་སོ་ -འི་ སྐྱེ་བོ་ ཐམས་ཅད་ དེ་བཞིན་ གཤེགས་པ་ ལ་ དམིགས་པ་ -འི་ དགེ་བ་ -འི་ རྩ་བ་ ཡང་དག་པ་ -ར་ བསྐྱེད་པ་ -ར་ བྱ་བ་ -འི་ ཕྱིར་ ། དེ་བཞིན་ གཤེགས་པ་ -འི་ གསུང་ ཡང་ ཐོས་ མོད་ ཀྱི་ །

source: However, Mañjuśrī, the Tathāgata should be known to be non-arisen and non-ceasing.
bo: འཇམ་དཔལ་ འོན་ཀྱང་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་པ་ -ར་ རྫོགས་པ་ -འི་ སངས་རྒྱས་ ནི་ སྐྱེ་བ་ མེད་པ་ དང་ ། འགག་པ་ མེད་པ་ ཡིན་པ་ -ར་ རིག་པ་ -ར་ བྱ་ -འོ་ ། །

source: “It is as follows: Mañjuśrī,
bo: འཇམ་དཔལ་ འདི་ལྟ་སྟེ་ དཔེར་ན་ །

source: at the end of summertime, during the first month of rains,
bo: སོས་ཀ་ -འི་ དུས་ ཀྱི་ མཐར་ཐུག་ ནས་ དབྱར་ཟླ་ ར་བ་ བྱུང་བ་ -ར་ གྱུར་པ་ ན་ །

source: due to the maturation of sentient beings’ previous karma,
bo: སེམས་ཅན་ རྣམས་ ཀྱི་ སྔོན་ གྱི་ ལས་ ཀྱི་ རྣམ་པ་ -ར་ སྨིན་པ་ -ས་

source: and to generate, out of the multitudes of seeds and elements, all the grass, thickets, medicinal herbs, and trees on earth,
bo: ས་ ལ་ གནས་པ་ -འི་ ས་བོན་ གྱི་ ཚོགས་ དང་ ། ལོ་ཏོག་ གི་ ཚོགས་ དང་ ། རྩྭ་ དང་ ། ཤིང་ གེལ་པ་ དང་ ། རྩི་ དང་ ། ནགས་ཚལ་ ཐམས་ཅད་ ཀུན་ ཏུ་ བསྐྱེད་པ་ -ར་ བྱ་བ་ -འི་ ཕྱིར་ །

source: winds begin to blow in the atmosphere and the sky above;
bo: སྟེང་ གི་ ནམ་མཁའ་ བར་སྣང་ གི་ གནས་ ལ་ འདི་འདྲ་བ་ -འི་ རླུང་ དག་ ལྡང་ སྟེ་ །

source: then water comes about due to that wind, and it falls on the great earth.
bo: དེ་ -ས་ ཆར་པ་ སྡུད་པ་ -ར་ བྱེད་ ཅིང་ བསྡུས་ ནས་ ཀྱང་ ས་གཞི་ ཆེན་པོ་ ལ་ འབབ་པ་ -ར་ བྱེད་ དོ་ །

source: Thus, the great earth is satisfied,
bo: དེ་ -ས་ ས་གཞི་ ཆེན་པོ་ ཐམས་ཅད་ ཀུན་ ཏུ་ ཚིམ་པ་ -ར་ བྱེད་ ཅིང་ །

source: and all sentient beings in Jambūdvīpa are joyful and happy.
bo: དེ་ -འི་ ཚེ་ ན་ འཛམ་བུ་གླིང་པ་ -འི་ མི་ ཐམས་ཅད་ ཀྱང་ རབ་ཏུ་ དགའ་བ་ དང་ ། ཡིད་ བདེ་བ་ སྐྱེ་བ་ -ར་ བྱེད་ དེ་ །

source: Referring to this, the notion of a ‘cloud’ comes about in the world.
bo: དེ་ ལ་ འཇིག་རྟེན་ ན་ སྤྲིན་ ཅེས་བྱ་བ་ -འི་ མིང་ དུ་ འགྱུར་ རོ་ ། །

source: “Mañjuśrī, whenever not much rain falls from the atmosphere and the sky above,
bo: འཇམ་དཔལ་ གང་ གི་ ཚེ་ སྟེང་ གི་ བར་སྣང་ ལས་ ཆར་པ་ -འི་ ཚོགས་ཆེན་པོ་ མི་ འབབ་པ་ དེ་ -འི་ ཚེ་ ན་

source: all the sentient beings in Jambūdvīpa think, ‘Here there is not a cloud.’
bo: འཛམ་བུ་གླིང་པ་ -འི་ མི་ ཐམས་ཅད་ འདི་སྐད་ ཅེས་ འདི་ -ར་ སྤྲིན་ མི་ འཁོར་ རོ་ ཞེས་ རྗོད་པ་ -ར་ བྱེད་ དོ་ ། །

source: But when, Mañjuśrī, a lot of rain falls on the great earth from the atmosphere and the sky above,
bo: འཇམ་དཔལ་ གང་ གི་ ཚེ་ སྟེང་ གི་ བར་སྣང་ ལས་ ཆར་པ་ -འི་ ཚོགས་ཆེན་པོ་ -ས་ གཞི་ ལ་ འབབ་པ་ དེ་ -འི་ ཚེ་ ན་ ནི་ །

source: they say: ‘Oh, a great cloud is pouring down water,
bo: ཨ་ལ་ ལ་ སྤྲིན་ཆེན་པོ་ ནི་ ཆ་ -ར་ གྱི་ རྒྱུན་ འབེབས་པ་ -ར་ བྱེད་ ཅིང་ །

source: satisfying the great earth.’
bo: ས་གཞི་ ཆེན་པོ་ ཡང་ ཀུན་ ཏུ་ ཚིམ་པ་ -ར་ བྱེད་ དོ་ ། །

source: “However, Mañjuśrī, when this happens there is neither a cloud, nor anything that can be designated as a cloud.
bo: འཇམ་དཔལ་ དེ་ ན་ ནི་ སྤྲིན་ ཡང་ མེད་ ལ་ སྤྲིན་ དུ་ གདགས་པ་ ཡང་ མེད་ དེ་ །

source: a large mass of water is generated by the wind, and then it falls from the atmosphere above.
bo: ཆར་པ་ -འི་ ཚོགས་ཆེན་པོ་ རླུང་ གིས་ ཀུན་ ནས་ བསྐྱོད་ ན་ ནི་ ། སྟེང་ གི་ བར་སྣང་ ལས་ འབབ་པ་ -ར་ ཡང་ འགྱུར་ །

source: disappears in the atmosphere itself,
bo: སྟེང་ གི་ བར་སྣང་ དེ་ཉིད་ དུ་ བག་ ལ་ ཞ་བ་ -ར་ ཡང་ འགྱུར་ རོ་ །

source: “Mañjuśrī, that cumulus of water above in the atmosphere, stirred by the wind and releasing water, is designated a cloud due to the maturation of sentient beings’ previous karma.
bo: འཇམ་དཔལ་ དེ་ལྟར་ སེམས་ཅན་ རྣམས་ ཀྱི་ སྔོན་ གྱི་ ལས་ ཀྱི་ རྣམ་པ་ -ར་ སྨིན་པ་ -ས་ སྟེང་ གི་ བར་སྣང་ ལ་ཆ་ -ར་པ་ -འི་ ཚོགས་ཆེན་པོ་ དེ་ ཀུན་ ནས་ འདུས་པ་ དང་ ། རླུང་ ཀུན་ ཏུ་ འཁྲུག་པ་ དག་ གི་ ཆར་པ་ -འི་ རྒྱུན་ ཀུན་ ཏུ་ འཛིན་པ་ -འམ་ ། འབེབས་པ་ -ར་ བྱེད་པ་ དེ་ ལ་ སྤྲིན་ ཅེས་ འདོགས་པ་ -ར་ འབྱུང་ མོད་ ཀྱི་ །

source: Mañjuśrī, no cloud can be found there,
bo: འཇམ་དཔལ་ དེ་ ལ་ ནི་ སྤྲིན་ ཡང་ མེད་ །

source: nor anything that could be designated a cloud.
bo: སྤྲིན་ དུ་ གདགས་པ་ ཡང་ མེད་ དོ་ ། །

source: Mañjuśrī, the cloud is non-arisen and non-ceasing;
bo: འཇམ་དཔལ་ སྤྲིན་ དེ་ ནི་ མ་ སྐྱེས་པ་ ། མ་ འགགས་པ་ །

source: it does not enter the way of mind, and it is free from coming and going.
bo: སེམས་ ཀྱི་ ཡུལ་ དུ་ མི་ འཇུག་པ་ ། འོང་བ་ དང་ འགྲོ་བ་ དང་ བྲལ་བ་ ཡིན་ ནོ་ ། །

source: “In the same way, Mañjuśrī, for bodhisattva great beings who have accumulated previous roots of what is wholesome;
bo: འཇམ་དཔལ་ དེ་བཞིན་ དུ་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ སྔོན་ དགེ་བ་ -འི་ རྩ་བ་ -འི་ ཚོགས་ བསགས་པ་ དག་ དང་ །

source: for other sentient beings who wish for the awareness of a hearer or a pratyekabuddha;
bo: སེམས་ཅན་ ཉན་ཐོས་ དང་ ། རང་ སངས་རྒྱས་ ཀྱི་ ཤེས་པ་ འདོད་པ་ གཞན་དག་ དང་ །

source: and for those sentient beings who have accumulated roots of what is wholesome and possess the causes to be shown the path to nirvāṇa,
bo: སེམས་ཅན་ དགེ་བ་ -འི་ རྩ་བ་ བསྐྱེད་པ་ ། མྱ་ངན་ ལས་ འདས་པ་ ཡང་དག་པ་ -ར་ བསྟན་པ་ -འི་ རྒྱུ་ཅན་ རྣམས་ ལ་ །
