Repository: OpenPecha-Data/0fbd31ce377b49a79da3bbcf2402ad48
Catalog: *.po
Languages: bo

source: freedom from elaboration is stainless;
bo: སྤྲོས་པ་ དང་ བྲལ་བ་ ནི་ དྲི་མ་ མེད་པ་ -འོ་ ། །

source: the pacification of elaborations is non-disturbance.
bo: སྤྲོས་པ་ ཉེ་བར་ ཞི་བ་ ནི་ ཉོན་མོངས་པ་ མེད་པ་ -འོ་ །

source: In this way, the Tathāgata has realized, through their very sameness, that all these dharmas are equal.
bo: དེ་བཞིན་ གཤེགས་པ་ -ས་ ནི་ ཆོས་ དེ་དག་ དེ་ལྟར་ མཉམ་པ་ཉིད་ ཀྱིས་ མཉམ་པ་ -ར་ མངོན་པར་ རྫོགས་པ་ -ར་ སངས་རྒྱས་ སོ་ །

source: When one does not see the mind and the point of reference, one then sees reality.
bo: དེ་ -ས་ གང་ གི་ ཚེ་ སེམས་ དང་ དམིགས་པ་ ཡང་དག་པ་ -ར་ རྗེས་སུ་ མི་ མཐོང་བ་ དེ་ -འི་ ཚེ་ ན་ ཡང་དག་པ་ -ར་ མཐོང་བ་ ཡིན་པ་ -ས་ ། །

source: the pacification of elaborations is non-disturbance.
bo: སྤྲོས་པ་ ཉེ་བར་ ཞི་བ་ ནི་ ཉོན་མོངས་པ་ མེད་པ་ -འོ་ ། །

source: The tathatā is purity;
bo: དེ་བཞིན་ཉིད་ ནི་ དག་པ་ -འོ་ ། །

source: the dharmadhātu is stainless;
bo: ཆོས་ ཀྱི་ དབྱིངས་ ནི་ དྲི་མ་ མེད་པ་ -འོ་ ། །

source: the pinnacle of reality is non-disturbance.
bo: ཡང་དག་པ་ -འི་ མཐའ་ ནི་ ཉོན་མོངས་པ་ མེད་པ་ -འོ་ །

source: Space is purity;
bo: ནམ་མཁའ་ ནི་ དག་པ་ -འོ་ ། །

source: the sky is stainless;
bo: ནམ་མཁའ་ ནི་ ཉོན་མོངས་པ་ མེད་པ་ -འོ་ ། །

source: the atmosphere is non-disturbance.
bo: བར་སྣང་ ནི་ དྲི་མ་ མེད་པ་ -འོ་ ། །

source: “To thoroughly cognize inside is purity;
bo: ནང་ ཡོངས་སུ་ ཤེས་པ་ ནི་ དག་པ་ -འོ་ ། །

source: not to move forth on the outside is stainless;
bo: ཕྱི་རོལ་ ཏུ་ རྒྱུ་བ་ མེད་པ་ ནི་ དྲི་མ་ མེད་པ་ -འོ་ ། །

source: non-perception inside and outside is non-disturbance.
bo: ཕྱི་ ནང་ དམིགས་ སུ་ མེད་པ་ ནི་ ཉོན་མོངས་པ་ མེད་པ་ -འོ་ ། །

source: To thoroughly cognize the aggregates is purity;
bo: ཕུང་པོ་ ཡོངས་སུ་ ཤེས་པ་ ནི་ དག་པ་ -འོ་ ། །

source: the essencelessness of the bases is stainless;
bo: ཁམས་ རང་བཞིན་ མེད་པ་ ནི་ དྲི་མ་ མེད་པ་ -འོ་ ། །

source: putting away the entrances is non-disturbance.
bo: སྐྱེ་མཆེད་ རྣམས་ སྤོང་བ་ ནི་ ཉོན་མོངས་པ་ མེད་པ་ -འོ་ ། །

source: To cognize past destruction is purity;
bo: འདས་པ་ ལ་ ཟད་པར་ ཤེས་པ་ ནི་ དག་པ་ -འོ་ ། །

source: to cognize future non-arising is stainless;
bo: མ་འོངས་པ་ ལ་ མི་ སྐྱེ་བ་ -ར་ ཤེས་པ་ ནི་ དྲི་མ་ མེད་པ་ -འོ་ ། །

source: to cognize the present abiding of the dharmadhātu is non-disturbance.
bo: ད་ལྟར་ བྱུང་བ་ ལ་ ཆོས་ གནས་པ་ -ར་ ཤེས་པ་ ནི་ ཉོན་མོངས་པ་ མེད་པ་ -འོ་ ། །

source: “In this way, Mañjuśrī, purity, the stainless, and non-disturbance are collected within a single basis:
bo: འཇམ་དཔལ་ དེ་ལྟར་ དག་པ་ དང་ དྲི་མ་ མེད་པ་ དང་ ། ཉོན་མོངས་པ་ མེད་པ་ ནི་ གནས་ གཅིག་ ཏུ་ ཡང་དག་པ་ -ར་ འདུ་ སྟེ་ །

source: the peaceful basis.
bo: ཞི་བ་ -འི་ གནས་ སུ་ -འོ་ ། །

source: That which is peaceful is very peaceful.
bo: ཞི་བ་ གང་ཡིན་པ་ དེ་ ནི་ རབ་ཏུ་ ཞི་བ་ ཡིན་ ནོ་ ། །

source: That which is very peaceful is utterly peaceful.
bo: རབ་ཏུ་ ཞི་བ་ གང་ཡིན་པ་ དེ་ ནི་ ཉེ་བར་ ཞི་བ་ ཡིན་ ནོ་ ། །

source: That which is utterly peaceful is utter pacification;
bo: ཉེ་བར་ ཞི་བ་ གང་ཡིན་པ་ དེ་ ནི་ ཉེ་བར་ ཞི་བ་ -ར་ གྱུར་པ་ ཡིན་ ནོ་ ། །

source: utter pacification is called the sage.
bo: ཉེ་བར་ ཞི་བ་ -ར་ གྱུར་ གང་ཡིན་པ་ དེ་ ནི་ ཐུབ་པ་ ཞེས་ བྱ་ -འོ་ ། །

source: Thus, Mañjuśrī, just like space, so is awakening.
bo: འཇམ་དཔལ་ དེ་ལྟར་ ན་ ནམ་མཁའ་ ཇི་ལྟ་ བར་ བྱང་ཆུབ་ ཀྱང་ དེ་བཞིན་ ནོ་ ། །

source: Just like awakening, so are the dharmas.
bo: བྱང་ཆུབ་ ཇི་ལྟ་ བར་ ཆོས་ རྣམས་ ཀྱང་ དེ་བཞིན་ ནོ་ ། །

source: Just like the dharmas, so are sentient beings.
bo: ཆོས་ རྣམས་ ཇི་ལྟ་ བར་ སེམས་ཅན་ རྣམས་ ཀྱང་ དེ་བཞིན་ ནོ་ ། །

source: Just like sentient beings, so are the fields.
bo: སེམས་ཅན་ རྣམས་ ཇི་ལྟ་ བར་ ཞིང་ རྣམས་ ཀྱང་ དེ་བཞིན་ ནོ་ ། །

source: Just like the fields, so is nirvāṇa.
bo: ཞིང་ རྣམས་ ཇི་ལྟ་ བར་ མྱ་ངན་ ལས་ འདས་པ་ ཡང་ དེ་བཞིན་ ནོ་ ། །

source: Therefore, Mañjuśrī, it is said that all dharmas are the same as nirvāṇa.
bo: འཇམ་དཔལ་ དེ་ -འི་ ཕྱིར་ ཆོས་ ཐམས་ཅད་ ནི་ མྱ་ངན་ ལས་ འདས་པ་ དང་ མཉམ་པ་ ཞེས་ བྱ་ སྟེ་ །

source: Since this is their ultimate mode, there is no counteragent.
bo: མཐར་ཐུག་པ་ -ར་ གྱུར་པ་ -འི་ ཕྱིར་ གཉེན་པོ་ མེད་པ་ ཡིན་ ལ་ །

source: Because there is no counteragent, they are primordially pure,
bo: གཉེན་པོ་ མེད་པ་ -འི་ ཕྱིར་ གཟོད་མ་ ནས་ དག་པ་ དང་ །

source: primordially stainless, and
bo: གཟོད་མ་ ནས་ དྲི་མ་ མེད་པ་ དང་ །

source: primordially without disturbances.
bo: གཟོད་མ་ ནས་ ཉོན་མོངས་པ་ མེད་པ་ ཡིན་ ནོ་ ། །

source: It is thus, Mañjuśrī, that the Tathāgata realized all dharmas to be; as he observes the sphere of sentient beings, a pure, great compassion that is free from disturbances, called play, comes about toward those sentient beings.
bo: འཇམ་དཔལ་ དེ་ ལ་ དེ་བཞིན་ གཤེགས་པ་ ཆོས་ ཐམས་ཅད་ དེ་ལྟར་ མངོན་པར་ རྫོགས་པ་ -ར་ སངས་རྒྱས་པ་ སེམས་ཅན་ རྣམས་ ཀྱི་ ཁམས་ ལ་ རྣམ་པ་ -ར་ གཟིགས་པ་ ནི་ སེམས་ཅན་ རྣམས་ ལ་ དག་པ་ དྲི་མ་ མེད་པ་ ཉོན་མོངས་པ་ མེད་པ་ -ས་ རྣམ་པ་ -ར་ རོལ་བ་ ཞེས་ བྱ་བ་ -འི་ ཐུགས་རྗེ་ ཆེན་པོ་ སྐྱེ་བ་ -ར་ འགྱུར་ རོ་ ། །

source: “Mañjuśrī, how does a bodhisattva practice within the conduct of a bodhisattva?
bo: འཇམ་དཔལ་ ཇི་ལྟར་ ན་ བྱང་ཆུབ་ སེམས་དཔའ་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ སྤྱད་པ་ སྤྱོད་པ་ ཡིན་ ཞེ་ན་ ། །

source: “Mañjuśrī, how does a bodhisattva practice within the conduct of a bodhisattva?
bo: འཇམ་དཔལ་ ཇི་ལྟར་ ན་ བྱང་ཆུབ་ སེམས་དཔའ་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ སྤྱད་པ་ སྤྱོད་པ་ ཡིན་ ཞེ་ན་ །

source: nor is he disturbed by utter non-arising.
bo: གཏན་ མི་ སྐྱེ་བ་ རྣམ་པ་ -ར་ འཁྲུགས་པ་ -ར་ ཡང་ མི་ བྱེད་པ་ དེ་ལྟར་ སྤྱོད་ ན་ །

source: Mañjuśrī, a bodhisattva does not think of destruction, arising, non-destruction, non-arising, and the utter destruction of destruction;
bo: འཇམ་དཔལ་ གང་ གི་ ཚེ་ བྱང་ཆུབ་ སེམས་དཔའ་ ཟད་པ་ -འི་ ཕྱིར་ རློམ་སེམས་ སུ་ མི་ བྱེད་ ཅིང་ མ་ཟད་པ་ -འི་ ཕྱིར་ཡང་ མ་ ཡིན་ ། སྐྱེ་བ་ -འི་ ཕྱིར་ཡང་ མ་ ཡིན་ ། མི་ སྐྱེ་བ་ -འི་ ཕྱིར་ཡང་ མ་ ཡིན་ ། གཏན་ ཟད་པ་ ཟད་པར་ བྱ་བ་ -འི་ ཕྱིར་ཡང་ མ་ ཡིན་ ། །

source: And why?
bo: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན་ ། །

source: “Mañjuśrī, a bodhisattva may practice thinking that ‘form is not empty’ and also ‘not non-empty.’
bo: འཇམ་དཔལ་ གལ་ཏེ་ བྱང་ཆུབ་ སེམས་དཔའ་ གཟུགས་ སྟོང་ ཞེས་ བྱ་བ་ -ར་ མི་ སྤྱོད་ ། མི་ སྟོང་ ཞེས་ བྱ་བ་ -ར་ མི་ སྤྱོད་པ་ དེ་ལྟར་ སྤྱོད་ ན་ །

source: ‘Form itself is empty of the essence of form.
bo: གཟུགས་ ནི་ གཟུགས་ ཀྱི་ ངོ་བོ་ ཉིད་ ཀྱིས་ སྟོང་པ་ -འི་ ཕྱིར་ རོ་ ། །

source: Furthermore, Mañjuśrī, a bodhisattva does not practice by thinking, ‘The past mind is destroyed;’
bo: འཇམ་དཔལ་ གཞན་ ཡང་ བྱང་ཆུབ་ སེམས་དཔའ་ འདས་པ་ -འི་ སེམས་ ལ་ ཟད་པ་ ཞེས་ བྱ་བ་ -ར་ མི་ སྤྱོད་ །

source: Mañjuśrī, a bodhisattva practices within the conduct of a bodhisattva.
bo: འཇམ་དཔལ་ བྱང་ཆུབ་ སེམས་དཔའ་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ སྤྱད་པ་ སྤྱོད་པ་ ཡིན་ ནོ་ ། །

source: “Mañjuśrī, giving, awakening, and sentient beings and, on the other hand, the Tathāgata: these are non-dual,
bo: འཇམ་དཔལ་ གཞན་ ཡང་ བྱང་ཆུབ་ སེམས་དཔའ་ སྦྱིན་པ་ དང་ ། བྱང་ཆུབ་ དང་ ། སེམས་ཅན་ རྣམས་ དང་ ། དེ་བཞིན་ གཤེགས་པ་ དེ་ ལ་ གཉིས་ སུ་ མེད་ དེ་ །

source: they are not divided into two. Practicing in this way, a bodhisattva practices within the conduct of a bodhisattva.
bo: གཉིས་ སུ་ བྱར་མེད་པ་ དེ་ལྟར་ སྤྱོད་ ན་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ སྤྱད་པ་ སྤྱོད་པ་ ཡིན་ ནོ་ །

source: Mañjuśrī, discipline, awakening, and sentient beings and, on the other hand, the Tathāgata: these are non-dual, they are not divided into two. Practicing in this way, a bodhisattva practices within the conduct of a bodhisattva.
bo: འཇམ་དཔལ་ དེ་བཞིན་ དུ་ བྱང་ཆུབ་ སེམས་དཔའ་ ཚུལ་ཁྲིམས་ དང་ ། བྱང་ཆུབ་ དང་ ། སེམས་ཅན་ རྣམས་ དང་ ། དེ་བཞིན་ གཤེགས་པ་ དེ་ ལ་ གཉིས་ སུ་ མེད་ དེ་ གཉིས་ སུ་ བྱར་མེད་པ་ དེ་ལྟར་ སྤྱོད་ ན་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ སྤྱད་པ་ སྤྱོད་པ་ ཡིན་ ནོ་ །

source: Practicing in this way, Mañjuśrī, that bodhisattva practices within the conduct of a bodhisattva.
bo: འཇམ་དཔལ་ བྱང་ཆུབ་ སེམས་དཔའ་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ སྤྱད་པ་ ལ་ སྤྱོད་པ་ ཡིན་ ནོ་ །

source: n the same way, feeling, notion, co-producing factors, and consciousness are empty.’ He practices thinking in this way and also thinking that ‘they are not non-empty.’
bo: དེ་བཞིན་ དུ་ གལ་ཏེ་ བྱང་ཆུབ་ སེམས་དཔའ་ ཚོར་བ་ དང་ ། འདུ་ཤེས་ དང་ ། འདུ་བྱེད་ རྣམས་ དང་ ། རྣམ་པ་ -ར་ ཤེས་པ་ སྟོང་ ཞེས་ བྱ་བ་ -ར་ མི་ སྤྱོད་ མི་ སྟོང་ ཞེས་ བྱ་བ་ -ར་ མི་ སྤྱོད་པ་ དེ་ལྟར་ སྤྱོད་ ན་ །

source: In the same way, feeling, notion, co-producing factors, and consciousness are empty.’ He practices thinking in this way and also thinking that ‘they are not non-empty.’
bo: དེ་བཞིན་ དུ་ གལ་ཏེ་ བྱང་ཆུབ་ སེམས་དཔའ་ ཚོར་བ་ དང་ ། འདུ་ཤེས་ དང་ ། འདུ་བྱེད་ རྣམས་ དང་ ། རྣམ་པ་ -ར་ ཤེས་པ་ སྟོང་ ཞེས་ བྱ་བ་ -ར་ མི་ སྤྱོད་ མི་ སྟོང་ ཞེས་ བྱ་བ་ -ར་ མི་ སྤྱོད་པ་ དེ་ལྟར་ སྤྱོད་ ན་ ། །

source: And why?
bo: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན་ །

source: Because mind, mentality, and consciousness are not perceived. “Mañjuśrī, there is no dharma whatsoever that could be thoroughly cognized, dispelled, cultivated, or directly realized.
bo: འཇམ་དཔལ་ སེམས་ དང་ ། ཡིད་ དང་ ། རྣམ་པ་ -ར་ ཤེས་པ་ དམིགས་ སུ་ མེད་པ་ -འི་ ཕྱིར་ གང་ ཡོངས་སུ་ ཤེས་པ་ -འམ་ ། སྤང་བ་ -འམ་ ། བསྒོམ་པ་ -འམ་ ། མངོན་སུམ་ དུ་ བྱ་བ་ -འི་ ཆོས་ དེ་དག་ གང་ཡོད་པ་ མ་ཡིན་པ་ -འི་ ཕྱིར་ རོ་ ། །

source: Mañjuśrī, that which is understood as destruction is simply the destruction of extremes.
bo: འཇམ་དཔལ་ ཟད་པ་ ཞེས་ བྱ་བ་ གང་ཡིན་པ་ དེ་ ནི་ གཏན་ ཟད་པ་ ཁོ་ན་ ཡིན་ ནོ་ ། །

source: As it is indestructible and not destroyed, it is without destruction.
bo: ཟད་པར་ བྱ་བ་ མ་ཡིན་པ་ -འི་ ཕྱིར་ མི་ཟད་པ་ ཡིན་ ནོ་ ། །

source: And that which is completely destroyed is not something one should cause to be destroyed.
bo: གཏན་ ཟད་པ་ གང་ཡིན་པ་ དེ་ ནི་ ཟད་པར་ བྱ་བ་ མ་ ཡིན་ ནོ་ །

source: It conforms to destruction;
bo: དེ་ ནི་ ཇི་ལྟ་བ་ བཞིན་ དུ་ ཟད་པ་ ཡིན་ ལ་ །

source: conforming to destruction is the destruction of nothing whatsoever.
bo: ཟད་པ་ གང་ཡིན་པ་ དེ་ ལ་ ནི་ ཟད་པ་ ཅུང་ཟད་ ཀྱང་ མེད་ ལ་ །

source: And that, wherein there is no destruction of anything whatsoever, is unproduced.
bo: གང་ ལ་ ཟད་པ་ ཅུང་ཟད་ ཀྱང་ མེད་པ་ དེ་ ནི་ འདུས་མ་བྱས་པ་ སྟེ་ །

source: With respect to the unproduced, there is no arising
bo: འདུས་མ་བྱས་པ་ གང་ཡིན་པ་ དེ་ ལ་ ནི་ སྐྱེ་བ་ ཡང་ མེད་ །

source: and no cessation.
bo: འགག་པ་ ཡང་ མེད་པ་ -འི་ ཕྱིར་ རོ་ ། །

source: “Therefore it is said, ‘Whether the tathāgatas arise or not,
bo: དེ་ -འི་ ཕྱིར་ དེ་བཞིན་ གཤེགས་པ་ རྣམས་ བྱུང་ ཡང་ རུང་ ། མ་ བྱུང་ ཡང་ རུང་ །

source: this dharmatā is invariable; it is the invariability of the dharmas, the dharmadhātu.’
bo: ཆོས་ཉིད་ དང་ ། ཆོས་ གནས་པ་ ཉིད་ དང་ ། ཆོས་ ཀྱི་ དབྱིངས་ འདི་ ནི་ གནས་པ་ ཁོ་ན་ ཞེས་ བྱ་ སྟེ་ །

source: Just like the invariability of the dharmadhātu, the Tathāgata’s awareness is neither occurring nor ceasing.
bo: ཇི་ལྟར་ ཆོས་ ཀྱི་ དབྱིངས་ ལ་ གནས་པ་ དེ་བཞིན་ དུ་ ཤེས་པ་ དེ་ཡང་ འཇུག་པ་ -ར་ མི་ བྱེད་ ལྡོག་པ་ -ར་ མི་ བྱེད་ དོ་ ། །

source: The destruction of the outflows, Mañjuśrī, is a conventional expression, speech, syllables, sign, and designation.
bo: འཇམ་དཔལ་ ཟག་པ་ ཟད་པ་ ཞེས་ བྱ་བ་ དེ་ ནི་ ཐ་སྙད་ དང་ ། སྒྲ་ དང་ ། ཡི་གེ་ དང་ ། བརྡ་ -ར་ གདགས་པ་ ཡིན་ ཏེ་ །

source: Here no dharma whatsoever arises or ceases.”
bo: འདི་ ལ་ ནི་ སྐྱེ་བ་ -འམ་ ། འགག་པ་ -ར་ འགྱུར་བ་ -འི་ ཆོས་ གང་ཡང་ མེད་ དོ་ ། །

source: Then the youthful Mañjuśrī rose from his seat,
bo: དེ་ནས་ འཇམ་དཔལ་ གཞོན་ནུ་ -ར་ གྱུར་པ་ སྟན་ ལས་ ལངས་ ཏེ་ །

source: folded his upper robe,
bo: བླ་གོས་ ཕྲག་པ་ གཅིག་ ཏུ་ གཟར་ ནས་ །

source: placed his right knee on the ground.
bo: པུས་མོ་ གཡས་པ་ -འི་ ལྷ་ང་ ས་ ལ་ བཙུགས་ ཏེ་ །

source: Folding his hands in the direction of the Bhagavat,
bo: བཅོམ་ལྡན་འདས་ ག་ལ་བ་ དེ་ ལོགས་ སུ་ ཐལ་མོ་ སྦྱར་བ་ བཏུད་ ནས་ །

source: he praised him with these verses:
bo: བཅོམ་ལྡན་འདས་ ལ་ཚིགས་ སུ་ བཅད་པ་ འདི་དག་ གིས་ མངོན་པར་ བསྟོད་ དོ་ ། །

source: “You have no color, sign, or shape,
bo: ཁ་དོག་ རྟགས་ དང་ དབྱིབས་ མི་ མངའ་ ། །

source: you are free of any point of reference: I bow to you!
bo: མི་ རྟེན་ ཁྱོད་ ལ་ ཕྱག་ འཚལ་ ལོ་ ། །

source: “You have no ground to stand upon,
bo: མི་ གནས་ གནས་པ་ མི་ མངའ་བ་ ། །

source: No striving or giving up;
bo: བླང་བ་ མི་ མངའ་ དོར་ མི་ མངའ་ ། །

source: “You are not situated in any dharma,
bo: ཆོས་ རྣམས་ ཀུན་ ལ་ མི་ གནས་ ཤིང་ ། །

source: Bereft of existence or non-existence.
bo: དངོས་ དང་ དངོས་མེད་ རྣམ་པ་ -ར་ སྤངས་ ། །

source: You obtained the sameness of co-producing factors,
bo: འདུ་བྱེད་ མཉམ་པ་ཉིད་ བརྙེས་པ་ ། །

source: “Free from the three world spheres,
bo: ཁམས་ གསུམ་ དག་ ལས་ རྣམ་པ་ -ར་ གྲོལ་ ། །

source: You have attained the sky’s own sameness.
bo: མཁའ་ ལྟར་ མཉམ་ཉིད་ ཐུགས་ སུ་ ཆུད་ །

source: You are not defiled by desires,
bo: འདོད་པ་ རྣམས་ ཀྱིས་ མི་ གོས་པ་ ། །

source: No root and no ground to stand upon,
bo: རྩ་བ་ མི་ མངའ་ གནས་ མི་ མངའ་ ། །

source: No cessation or origination,
bo: མི་ འགག་ འབྱུང་བ་ མི་ མངའ་བ་ །

source: Entering the Dharma method in this way, the outflows do not arise and do not cease.
bo: ཆོས་ ཀྱི་ ཚུལ་ ལ་ འཇུག་པ་ -ས་ ཟག་པ་ སྐྱེད་པ་ -ར་ མི་ བྱེད་ ། འགག་པ་ -ར་ མི་ བྱེད་ དོ་ །

source: he does not practice by thinking, ‘The present mind abides.’
bo: ད་ལྟར་ བྱུང་བ་ -འི་ སེམས་ ལ་ ཡོད་ ཅེས་བྱ་བ་ -ར་ མི་ སྤྱོད་

source: he does not practice by thinking, ‘The future mind has yet to be obtained;’
bo: མ་འོངས་པ་ -འི་ སེམས་ ལ་མ་ ཐོབ་པ་ ཞེས་ བྱ་བ་ -ར་ མི་ སྤྱོད་ །

source: He is not stuck in the past, future, or present mind. As he practices in this way,
bo: ཅིང་ འདས་པ་ དང་ མ་འོངས་པ་ དང་ ། ད་ལྟར་ བྱུང་བ་ -འི་ སེམས་ ལ་ ཆགས་པ་ -ར་ མི་འགྱུར་བ་ དེ་ལྟར་ སྤྱོད་ ན་ །

source: the Tathāgata; diligence, awakening, and sentient beings, and,
bo: དེ་བཞིན་ གཤེགས་པ་ དང་ ། བརྩོན་འགྲུས་ དང་ བྱང་ཆུབ་ དང་ ། སེམས་ཅན་ རྣམས་ དང་ །

source: the Tathāgata;
bo: དེ་བཞིན་ གཤེགས་པ་ དང་ །

source: awakening, and sentient beings, and,
bo: བྱང་ཆུབ་ དང་ ། སེམས་ཅན་ རྣམས་ དང་ །

source: These are non-dual, they are not divided into two.
bo: གཉིས་ སུ་ མེད་ དེ་ གཉིས་ སུ་ དབྱེ་ -ར་ མེད་པ་

source: “You always remain in samādhi,
bo: རྟག་ ཏུ་ མཉམ་པ་ -ར་ བཞག་ མཛད་པ་ །

source: Whichever your posture may be.
bo: སྤྱོད་ལམ་ རྣམ་པ་ ཐམས་ཅད་ དུ་ ། །

source: As you move, stand, or lie down—
bo: གཤེགས་ དང་ བཞུགས་ དང་ གཟིམས་པ་ ཡི་ །

source: “You arrive evenly and go evenly,
bo: མཉམ་པ་ -ར་ བྱོན་ ཅིང་ མཉམ་པ་ -ར་ གཤེགས་ ། །

source: Remaining well placed in sameness.
bo: མཉམ་པ་ཉིད་ ལ་ གནས་པ་པོ་ ། །

source: You are not disturbed at sameness,
bo: མཉམ་ ཞིང་ འཁྲུགས་པ་ -ར་ མི་ མཛད་པ་ ། །

source: “You are absorbed in sameness,
bo: མཉམ་པ་ཉིད་ ལ་ ཞུགས་ གྱུར་ ཅིང་ ། །

source: In samādhi within all dharmas.
bo: ཆོས་ རྣམས་ ཀུན་ ལ་ མཉམ་པ་ -ར་ བཞག་ །

source: Absorbed in the sign-less,
bo: མཚན་མ་ མེད་ ལ་ ཞུགས་ གྱུར་པ་ ། །

source: “Unplaced, without point of reference,
bo: མི་ གནས་ དམིགས་པ་ མི་ མངའ་བ་ ། །

source: Your samādhi is the peak of wisdom.
bo: ཤེས་རབ་ བསགས་ ཤིང་ མཉམ་པ་ -ར་ བཞག་ །

source: You have become the lord of Dharma,
bo: ཆོས་ ལ་ མངའ་དབང་ བརྙེས་ གྱུར་པ་ ། །

source: you are free of any point of reference: I bow to you!
bo: མི་ རྟེན་ ཁྱོད་ ལ་ ཕྱག་ འཚལ་ ལོ་ །

source: free from the six entrances,
bo: དྲུག་ ལས་ རྣམ་གྲོལ་བ་ །

source: “In one instant, you see The forms, voices, and postures Of all sentient beings.
bo: སེམས་ཅན་ ཀུན་ གྱི་ སྒྲ་ སྐད་ དང་ ། ། དེ་བཞིན་ གཟུགས་ དང་ སྤྱོད་ལམ་ དག་ ། སྐད་ཅིག་ གཅིག་ གིས་ གཟིགས་ མཛད་པ་ ། །

source: “Free from name and form,
bo: མིང་ དང་ གཟུགས་ ལས་ རྣམ་པ་ -ར་ གྲོལ་ ། །

source: You cut off all causes and aggregates.
bo: རྒྱུ་ དང་ ཕུང་པོ་ ཐམས་ཅད་ བཅད་ ། །

source: You are the entrance into the aspect-less,
bo: རྣམ་པ་ མེད་ ལ་ འཇུག་ མཛད་པ་ ། །

source: “You are free from signs
bo: མཚན་མ་ དག་ དང་ རྣམ་ བྲལ་ ཞིང་ ། །

source: And bereft of their aspects.
bo: མཚན་མ་ -འི་ རྣམ་པ་ རྣམ་པ་ -ར་ སྤངས་ ། །

source: You are the entrance into the sign-less,
bo: མཚན་མ་ མེད་ ལ་ འཇུག་ མཛད་པ་ ། །

source: “You do not form concepts,
bo: ཡང་དག་ རྟོག་པ་ རྣམ་ མ་ བརྟགས་ ། །

source: your mind has no ground to stand upon.
bo: ཐུགས་ ཡིད་ རབ་ཏུ་ མི་ གནས་ ཤིང་ ། །

source: You have no recollection or mental placement,
bo: ཡིད་ མཛད་ མི་ མངའ་ མི་ དགོངས་པ་ ། །

source: “Space is without abode;
bo: ནམ་མཁའ་ འདྲ་བ་ -ར་ གནས་ མི་ མངའ་ ། །

source: It is free from elaboration and stainless.
bo: ཐོགས་པ་ མི་ མངའ་ སྤྲོས་ མི་ མངའ་ ། །

source: Your mind is the same as space,
bo: ནམ་མཁའ་ མཉམ་པ་ -འི་ ཐུགས་ མངའ་བ་ ། །

source: “Space is without edge or center,
bo: ནམ་མཁའ་ དབུས་ མཐའ་མ་ མཆིས་པ་ ། །

source: so, too, is the dharmatā of the buddhas.
bo: སངས་རྒྱས་ ཆོས་ཉིད་ དེ་ དང་ འདྲ་ ། །

source: You have gone beyond the three times,
bo: དུས་གསུམ་ ཡང་དག་ འདས་ གྱུར་པ་ ། །

source: You have gone beyond the three times,
bo: དུས་གསུམ་ ཡང་དག་ འདས་ གྱུར་པ་ ། །

source: “The buddhas have the characteristic of space,
bo: ནམ་མཁའ་ -འི་ མཚན་ཉིད་ སངས་རྒྱས་ ཏེ་ ། །

source: And space has no characteristics.
bo: ནམ་མཁའ་ -འང་ མཚན་ཉིད་ མཆིས་ མ་ ལགས་ ། །

source: You are free from effect and cause,
bo: རྒྱུ་ དང་ འབྲས་བུ་ རྣམ་གྲོལ་བ་ ། །

source: you cannot be grasped:
bo: ངར་ འཛིན་ མི་ མངའ་ སྒྲ་ མི་ མངའ་ ། །

source: “Like the moon in the water,
bo: གཟུང་བ་ མ་ མཆིས་ ཆུ་ཟླ་ འདྲ་ ། །

source: You are not placed in any dharma.
bo: ཆོས་ རྣམས་ ཀུན་ ལ་ མི་ གནས་པ་ ། །

source: “Free from the two extremes,
bo: མཐའ་ གཉིས་ དག་ ལས་ རྣམ་གྲོལ་ ཞིང་ ། །

source: You cut off the view of ‘self.’
bo: བདག་ ཏུ་ ལྟ་བ་ ཡང་དག་ བཅད་ ། །

source: You obtained sameness with the dharmadhātu,
bo: ཆོས་དབྱིངས་ མཉམ་པ་ཉིད་ བརྙེས་པ་ ། །

source: “You are free from form and number,
bo: གཟུགས་ ཀྱི་ གྲངས་ ལས་ རྣམ་གྲོལ་ ཞིང་ ། །

source: “You are not dwelling in the aggregates, The bases, or the entrances.
bo: ཕུང་པོ་ རྣམས་ དང་ སྐྱེ་མཆེད་ དང་ ། ། ཁམས་ རྣམས་ དག་ ལ་ མི་ གནས་ ལ་ ། །

source: You are free from distortions,
bo: ཕྱིན་ ཅི་ ལོག་ ལས་ རྣམ་པ་ -ར་ གྲོལ་ ། །

source: bereft of any false dharmas.
bo: དམ་ཆོས་ མ་ ལགས་ རྣམ་པ་ -ར་ སྤངས་ ། །

source: You neither cling to, nor abandon,
bo: ལེན་ དང་ གཏོང་བ་ མི་ མངའ་བ་ ། །

source: “You have gone beyond the faults of Māra
bo: བདུད་ ཀྱི་ མིང་ ལས་ རབ་ འདས་ ཤིང་ ། །

source: reached the path of the dharmadhātu.
bo: ཆོས་ ཀུན་ རྟོགས་པ་ -ར་ ཐུགས་ སུ་ ཆུད་ ། །

source: You have the feature of non-obscuration,
bo: སྒྲིབ་པ་ མི་ མངའ་ ཆོས་ གྱུར་པ་ ། །

source: “Those who understand the meaning, Do not say ‘he exists’ or ‘he does not.’
bo: དོན་ འཚལ་ རྣམས་ ཀྱིས་ མཆིས་ མི་ བརྗོད་ ། ། མ་ མཆིས་ ཤེས་ ཀྱང་ བརྗོད་ མི་ བགྱི་ ། །

source: You are not in the realm of words,
bo: ལན་ མེད་ ཚིག་ ལམ་ མ་ མཆིས་པ་ ། །

source: “Not relying on duality,
bo: གཉིས་ ཀྱི་ ཆོས་ ལ་ མི་ རྟེན་པ་ -ར་ ། །

source: You are free from duality and non-duality,
bo: གཉིས་ དང་ གཉིས་ མེད་ རྣམ་གྲོལ་བ་ །

source: You cut down the banner of pride.
bo: རྒྱལ་མཚན་ ཀུན་ ཏུ་ བཙུགས་ ། །

source: You are inconceivable, without compare,
bo: བསམ་ཡས་ དཔེ་ དང་ རྣམ་ བྲལ་བ་ ། །

source: “You have subdued all mental flaws, And the four flaws of the body.
bo: ཁྱོད་ ཀྱིས་ ཡིད་ ཀྱི་ ཉེས་པ་ དང་ ། ། ལུས་ ཀྱི་ ནད་ བཞི་ ཕམ་པ་ -ར་ མཛད་ ། །

source: “You conduct yourself effortlessly,
bo: ལྷུན་ གྱིས་ གྲུབ་པ་ -ར་ འཇུག་ མཛད་ ཅིང་ ། །

source: you are bereft of any flaws.
bo: ཉེས་པ་ ཐམས་ཅད་ རྣམ་པ་ -ར་ སྤངས་ ། །

source: Awareness precedes all your actions,
bo: སྤྱོད་པ་ མཁྱེན་པ་ -ས་ ཐོག་དྲངས་པ་ ། །

source: Your recollection has no outflows:
bo: ཁྱོད་ དགོངས་ ཞི་ ཞིང་ ཟག་ མི་ མངའ་ ། །

source: It is subtle and conforms to what is real and unreal.
bo: འབྱུང་ མིན་ འབྱུང་བ་ -འི་ བདག་ཉིད་ ཅན་ ། །

source: You have no abode and no thoughts,
bo: གནས་ དང་ རྟོག་པ་ མི་ མངའ་བ་ ། །

source: “With your mind free of a point of reference,
bo: དམིགས་པ་ མི་ མངའ་ ཐུགས་ ཀྱིས་ སུ་ ། །

source: You understand well the mind of all,
bo: ཀུན་ གྱི་ སེམས་ ནི་ རབ་ཏུ་ མཁྱེན་ ། །

source: While having no notion of ‘self’ and ‘others.’
bo: བདག་གཞན་ འདུ་ཤེས་ མི་ མངའ་བ་ ། །

source: You remain unobscured,
bo: སྒྲིབ་པ་ མེད་པ་ -འི་ ཆོས་ གྱུར་པ་ ། །

source: Makes everyone’s mind bewildered.
bo: ཀུན་ གྱི་ སེམས་ ནི་ རྨོངས་པ་ -ར་ བགྱིད་ ། །

source: “Taking up points of reference
bo: དམིགས་ དང་ དམིགས་པ་ རྣམས་ ཀྱིས་ ནི་ ། །

source: you are free of any point of reference: I bow to you!
bo: མི་ རྟེན་ ཁྱོད་ ལ་ ཕྱག་ འཚལ་ ལོ་ ། །

source: a mind without point of reference
bo: དམིགས་པ་ དག་ དང་སེམས་ རྣམས་ ནི་ ། །

source: Cannot essentially be found.
bo: ངོ་བོ་ ཉིད་ ཀྱི་ མཆིས་ མ་ ལགས་ ། །

source: You obtained inconceivable sameness,
bo: བསམ་ཡས་ མཉམ་པ་ཉིད་ བརྙེས་པ་ ། །

source: “With your unplaced awareness,
bo: གནས་པ་ མི་ མངའ་ མཁྱེན་པ་ ཡིས་ ། །

source: You see all the fields,
bo: ཞིང་ རྣམས་ ཀུན་ དང་ དེ་བཞིན་ དུ་ ། །

source: And the conduct of all beings.
bo: སེམས་ཅན་ ཀུན་ གྱི་ སྤྱོད་ གཟིགས་པ་ ། །

source: you know everything about all dharmas.
bo: ཆོས་ རྣམས་ ཐམས་ཅད་ ཀུན་མཁྱེན་པ་ ། །

source: “The buddhas do not apprehend the mind, In any way, ever;
bo: སངས་རྒྱས་ རྣམས་ ཀྱིས་ ལན་འགའ་ ཡང་ ། ། སེམས་ དང་ ཆོས་ ཀུན་ གཏན་མ་ དམིགས་ ། །

source: “Illusion-like are all dharmas,
bo: ཆོས་ ཀུན་ སྒྱུ་མ་ ལྟ་བུ་ སྟེ་ ། །

source: Yet the illusion itself cannot be found.
bo: སྒྱུ་མ་ ཉིད་ ཀྱང་ མཆིས་ མ་ ལགས་ ། །

source: You are free from the dharma of illusion,
bo: སྒྱུ་མ་ -འི་ ཆོས་ ལས་ རྣམ་གྲོལ་བ་ ། །

source: “Perfect Buddha, you act in the world,
bo: རྫོགས་ སངས་ འཇིག་རྟེན་ སྤྱོད་ མཛད་ ཀྱང་ ། །

source: Not dwelling upon worldly dharmas,
bo: འཇིག་རྟེན་ ཆོས་ ལ་ རྟེན་ མི་ མཛད་ ། །

source: you do not form concepts about the ‘world.’
bo: འཇིག་རྟེན་ རྣམ་རྟོག་ མི་ མངའ་བ་ །

source: You declare what is empty as empty,
bo: སྟོང་པ་ སྟོང་པ་ -ར་ སྟོན་ མཛད་པ་ ། །

source: You are absorbed into freedom from multiplicity,
bo: ཐ་དད་ མ་ མཆིས་ སྙོམས་ ཞུགས་པ་ །

source: “Through great powers and illusory samādhi, You perform miracles.
bo: སྒྱུ་མ་ ལྟ་བུ་ -འི་ ཏིང་འཛིན་ དང་ ། ། སྒྱུ་འཕྲུལ་ ཆེན་པོ་ -ས་ རྣམ་འཕྲུལ་ ཞིང་ ། །

source: “You are neither one, nor many,
bo: དུ་མ་ མ་ ལགས་ གཅིག་ མ་ ལགས་ ། །

source: You are neither far, nor near.
bo: རིང་ དང་ ཉེ་ ལ་ མི་ འཇུག་ ཅིང་ ། །

source: You neither remove, nor add,
bo: གདེག་ དང་ གཞག་པ་ མི་ མངའ་བ་ ། །

source: “Through the diamond-like samādhi,
bo: རྡོ་རྗེ་ ལྟ་བུ་ -འི་ ཏིང་འཛིན་ གྱིས་ ། །

source: You obtained supreme awakening in one instant.
bo: སྐད་ཅིག་ གཅིག་ ལ་ མངོན་ སངས་རྒྱས་ ། །

source: You are absorbed into non-appearance,
bo: དངོས་ མ་ མཆིས་པ་ -ར་ མཉམ་ གཞག་པ་ ། །

source: “You know nirvāṇa to be unmoving in the three times.
bo: འདྲེན་པ་ དུས་ རྣམས་ ཐམས་ཅད་ དུ་ ། ། མི་ གཡོ་ མྱ་ངན་ འདས་པ་ རྟོགས་ ། །

source: You are a guide endowed with many methods,
bo: སྣ་ཚོགས་ ཐབས་ དང་ ལྡན་པ་པོ་ ། །

source: You know nirvāṇa to be unmoving,
bo: དེ་ཕྱིར་ མི་ གཡོ་ མྱ་ངན་ འདས་ ། །

source: “You are expert in understanding which methods,
bo: སེམས་ཅན་ རྣམས་ ཀྱི་ བརྒྱུད་པ་ -འི་ ཐབས་ ། །

source: “You are free from signs, effortless,
bo: མཚན་མ་ མི་ མངའ་ ལྷུན་ གྱིས་ གྲུབ་ །

source: Free from elaboration, and untainted.
bo: སྤྲོས་པ་ མི་ མངའ་ སྐྱོན་ མི་ མངའ་ །

source: Free from appearance, free from a ‘self,’
bo: སྣང་མེད་ བདག་ གི་ མི་ མངའ་བ་ ། །

source: You are omniscient with respect to everything,
bo: ཀུན་ ཏུ་ མཁྱེན་པ་ ཐམས་ཅད་ མཁྱེན་ ། །

source: You yourself know the self as it is.
bo: བདག་ གིས་ བདག་ཉིད་ ཇི་བཞིན་པ་ -ར་ ། །

source: “Free from concepts, free from what belongs to a self,
bo: རྣམ་རྟོག་ མི་ མངའ་ སྐྱོན་ མི་ མངའ་ ། །

source: you are free of any point of reference: I bow to you!
bo: མི་ རྟེན་ ཁྱོད་ ལ་ ཕྱག་ འཚལ་ ལོ་ ། །

source: “I salute you, who have ten powers and have crossed the stream.
bo: སྟོབས་ བཅུ་ ཆུ་བོ་ རྒལ་བ་ ཁྱོད་ ལ་ ཕྱག་ འཚལ་ ལོ་ ། །

source: I salute you, the fearless one who bestows fearlessness.
bo: འཇིགས་ བྲལ་ འཇིགས་མེད་ སྩོལ་བ་ ཁྱོད་ ལ་ ཕྱག་ འཚལ་ ལོ་ ། །

source: You obtained certainty in the unshared dharmas:
bo: མ་ འདྲེས་ ཆོས་ རྣམས་ ངེས་པར་ ཐུགས་ སུ་ ཆུད་ གྱུར་པ་ ། །

source: Guide for the entire world, I salute you.
bo: འགྲོ་བ་ ཀུན་ གྱི་ འདྲེན་པ་ ཁྱོད་ ལ་ ཕྱག་ འཚལ་ ལོ་ ། །

source: “I salute you, who break the bondage of fetters,
bo: ཀུན་སྦྱོར་ འཆིང་བ་ བཅད་པ་ ཁྱོད་ ལ་ ཕྱག་ འཚལ་ ལོ་ ། །

source: I salute you, who reached the other shore and remain on dry ground.
bo: ཕ་རོལ་ བྱོན་ ཏེ་ ཐང་ལ་ བཞུགས་ ལ་ ཕྱག་ འཚལ་ ལོ་ ། །

source: I salute you, guide for the exhausted world.
bo: སྐྱེ་བོ་ ངལ་བ་ -འི་ རྣམ་འདྲེན་ ཁྱོད་ ལ་ ཕྱག་ འཚལ་ ལོ་ ། །

source: I salute you, who go to saṃsāra and remain unplaced.
bo: འཁོར་བ་ -ར་ གཤེགས་ ཤིང་ མི་ གནས་པ་ ལ་ ཕྱག་ འཚལ་ ལོ་ ། །

source: Sage, Buddha, you practiced emptiness!
bo: སངས་རྒྱས་ ཐུབ་པ་ ཁྱོད་ ཀྱིས་ སྟོང་ཉིད་ ཤིན་ཏུ་ བསྟེན་ ། །

source: You are untainted, like a lotus by the waters it grows in;
bo: ཇི་ལྟར་ པད་མ་ ཆབ་ ཀྱིས་ གོས་པ་ -ར་ མི་ འགྱུར་ ཞིང་ ། །
