Repository: OpenPecha-Data/0fbd31ce377b49a79da3bbcf2402ad48
Catalog: *.po
Languages: bo

source: Mañjuśrī, when searching for the real awakening, it cannot be explained through any dharma.
bo: འཇམ་དཔལ་ ཡང་དག་ པར་བྱང་ ཆུབ་ ཡོངས་སུ་ ཚོལ་བ་ ན་ ཡང་ ཆོས་ ཐམས་ཅད་ ཀྱིས་ བརྗོད་པ་ -ར་ བྱ་བ་ མ་ ཡིན་ ནོ་ །

source: Mañjuśrī, with respect to what is real, no words can be found, because it is non-arisen and unceasing.
bo: འཇམ་དཔལ་ ཡང་དག་པ་ -ར་ ནི་ ཚིག་ ནི་ མ་ སྐྱེས་པ་ དང་ ། མ་ འགགས་པ་ ཡིན་པ་ -ས་ ཡོད་པ་ མ་ཡིན་པ་ -འི་ ཕྱིར་ རོ་ ། །

source: “Awakening, Mañjuśrī, means to be ungraspable and to have no abode.
bo: འཇམ་དཔལ་ བྱང་ཆུབ་ ནི་ གཟུང་བ་ མེད་པ་ ཉིད་ དང་ ། གནས་ མེད་པ་ ཉིད་ ཡིན་ ཏེ་ །

source: In that respect, Mañjuśrī, what is it to be ungraspable,
bo: འཇམ་དཔལ་ དེ་ ལ་ གཟུང་བ་ མེད་པ་ ནི་ གང་ །

source: what is it to have no abode?
bo: གནས་ མེད་པ་ ནི་ གང་ཞེ་ན་ །

source: what is it to have no abode?
bo: གནས་ མེད་པ་ ནི་ གང་ཞེ་ན་ །

source: The thorough cognition of the eye, Mañjuśrī, is to be ungraspable.
bo: འཇམ་དཔལ་ མིག་ ཡོངས་སུ་ ཤེས་པ་ ནི་ གཟུང་བ་ མེད་པ་ ཉིད་ ཡིན་ ནོ

source: The non-perception of form is to have no abode.
bo: གཟུགས་ དམིགས་ སུ་ མེད་པ་ ནི་ གནས་ མེད་པ་ ཉིད་ ཡིན་ ནོ་ ། །

source: The thorough cognition of the ear is to be ungraspable.
bo: རྣ་བ་ ཡོངས་སུ་ ཤེས་པ་ ནི་ གཟུང་བ་ མེད་པ་ ཉིད་ ཡིན་ ནོ་ ། །

source: The non-perception of sound is to have no abode.
bo: སྒྲ་ དམིགས་ སུ་ མེད་པ་ ནི་ གནས་ མེད་པ་ ཉིད་ ཡིན་ ནོ་ ། །

source: The thorough cognition of the nose is to be ungraspable.
bo: སྣ་ ཡོངས་སུ་ ཤེས་པ་ ནི་ གཟུང་བ་ མེད་པ་ ཉིད་ ཡིན་ ནོ་ ། །

source: The non-perception of smell is to have no abode.
bo: དྲི་ དམིགས་ སུ་ མེད་པ་ ནི་ གནས་ མེད་པ་ ཉིད་ ཡིན་ ནོ་ ། །

source: The thorough cognition of the tongue is to be ungraspable.
bo: ལྕེ་ ཡོངས་སུ་ ཤེས་པ་ ནི་ གཟུང་བ་ མེད་པ་ ཉིད་ ཡིན་ ནོ་ ། །

source: The non-perception of flavor is to have no abode.
bo: རོ་ དམིགས་ སུ་ མེད་པ་ ནི་ གནས་ མེད་པ་ ཉིད་ ཡིན་ ནོ་ ། །

source: The thorough cognition of the body is to be ungraspable.
bo: ལུས་ ཡོངས་སུ་ ཤེས་པ་ ནི་ གཟུང་བ་ མེད་པ་ ཉིད་ ཡིན་ ནོ་ ། །

source: The non-perception of touchable things is to have no abode.
bo: རེག་བྱ་ དམིགས་ སུ་ མེད་པ་ ནི་ གནས་ མེད་པ་ ཉིད་ ཡིན་ ནོ་ ། །

source: The thorough cognition of the mind is to be ungraspable.
bo: ཡིད་ ཡོངས་སུ་ ཤེས་པ་ ནི་ གཟུང་བ་ མེད་པ་ ཉིད་ ཡིན་ ནོ་ ། །

source: The non-perception of dharmas is to have no abode.
bo: ཆོས་ དམིགས་ སུ་ མེད་པ་ ནི་ གནས་ མེད་པ་ ཉིད་ ཡིན་ ནོ་ ། །

source: In this way, the Tathāgata has realized awakening, ungraspable and without abode.
bo: དེ་བཞིན་ གཤེགས་པ་ -ས་ ནི་ དེ་ལྟར་ གཟུང་བ་ མེད་པ་ ཉིད་ དང་ ། གནས་ མེད་པ་ ཉིད་ དུ་ བྱང་ཆུབ་ མངོན་པར་ རྫོགས་པ་ -ར་ སངས་རྒྱས་ ཏེ་ །

source: the eye-consciousness has no ground to stand upon.
bo: མིག་ གི་ རྣམ་པ་ -ར་ ཤེས་པ་ ལ་ མི་ གནས་ སོ་ ། །

source: Not grasping at the ear and
bo: རྣ་བ་ གཟུང་ དུ་ མེད་པ་ དང་ །

source: not perceiving sounds, the ear-consciousness has no ground to stand upon.
bo: སྒྲ་ དམིགས་ སུ་ མེད་པ་ -འི་ ཕྱིར་ རྣ་བ་ -འི་ རྣམ་པ་ -ར་ ཤེས་པ་ ལ་ མི་ གནས་ སོ་ ། །

source: Not grasping at the nose and
bo: སྣ་ གཟུང་ དུ་ མེད་པ་ དང་ །

source: not perceiving smells, the nose-consciousness has no ground to stand upon.
bo: དྲི་ དམིགས་ སུ་ མེད་པ་ -འི་ ཕྱིར་ སྣ་ -འི་ རྣམ་པ་ -ར་ ཤེས་པ་ ལ་ མི་ གནས་ སོ་ ། །

source: Not grasping at the body and
bo: ལུས་ གཟུང་ དུ་ མེད་པ་ དང་ །

source: not perceiving touchable things, the body-consciousness has no ground to stand upon.
bo: རེག་བྱ་ དམིགས་ སུ་ མེད་པ་ -འི་ ཕྱིར་ ལུས་ ཀྱི་ རྣམ་པ་ -ར་ ཤེས་པ་ ལ་ མི་ གནས་ སོ་ ། །

source: Not grasping at the mind and
bo: ཡིད་ གཟུང་ དུ་ མེད་པ་ དང་ །

source: not perceiving dharmas, the mind-consciousness has no ground to stand upon.
bo: ཆོས་ དམིགས་ སུ་ མེད་པ་ -འི་ ཕྱིར་ ཡིད་ ཀྱི་ རྣམ་པ་ -ར་ ཤེས་པ་ ལ་ མི་ གནས་ ཏེ་ །

source: Therefore, as his consciousness has no ground to stand upon, he comes to be counted as the Tathāgata, the Arhat, the Perfect and Complete Buddha.
bo: དེ་ -འི་ ཕྱིར་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་པ་ -ར་ རྫོགས་པ་ -འི་ སངས་རྒྱས་ ནི་ རྣམ་པ་ -ར་ ཤེས་པ་ ལ་ མི་ གནས་པ་ དང་ ལྡན་པ་ ཞེས་ བྱ་བ་ -འི་ གྲངས་ སུ་ འགྲོ་ -འོ་ ། །

source: “Mañjuśrī, there are four grounds for the minds of sentient beings to stand upon.
bo: འཇམ་དཔལ་ བཞི་པོ་ འདི་དག་ ནི་ སེམས་ཅན་ རྣམས་ ཀྱི་ སེམས་ ཀྱི་ གནས་ ཡིན་ ཏེ་ །

source: Which four?
bo: བཞི་ གང་ཞེ་ན་ །

source: Form is a ground for the mind of sentient beings to stand upon.
bo: གཟུགས་ ནི་ སེམས་ཅན་ རྣམས་ ཀྱི་ སེམས་ ཀྱི་ གནས་ ཡིན་ ནོ་ །

source: Similarly,
bo: འདི་ལྟ་སྟེ་ ། །

source: Mañjuśrī, feeling, notion, and co-producing factors are grounds for the minds of sentient beings to stand upon.
bo: འཇམ་དཔལ་ དེ་བཞིན་ དུ་ ཚོར་བ་ དང་ ། འདུ་ཤེས་ དང་ ། འདུ་བྱེད་ རྣམས་ ནི་ སེམས་ཅན་ རྣམས་ ཀྱི་ སེམས་ ཀྱི་ གནས་ ཡིན་ ཏེ་ །

source: Mañjuśrī, these four grounds for the mind to stand upon are known by the Tathāgata to be non-arisen and unceasing.
bo: འཇམ་དཔལ་ དེ་བཞིན་ གཤེགས་པ་ -ས་ ནི་ སེམས་ཅན་ རྣམས་ ཀྱི་ སེམས་ ཀྱི་ གནས་ བཞི་པོ་ དེ་དག་ མ་ སྐྱེས་པ་ དང་ ། མ་ འགགས་པ་ -ར་ ཤེས་ སོ་ །

source: Mañjuśrī, these four grounds for the mind to stand upon are known by the Tathāgata to be non-arisen and unceasing.
bo: འཇམ་དཔལ་ དེ་བཞིན་ གཤེགས་པ་ -ས་ ནི་ སེམས་ཅན་ རྣམས་ ཀྱི་ སེམས་ ཀྱི་ གནས་ བཞི་པོ་ དེ་དག་ མ་ སྐྱེས་པ་ དང་ ། མ་ འགགས་པ་ -ར་ ཤེས་ སོ་ །

source: “Awakening, Mañjuśrī, is an appellation for emptiness.
bo: འཇམ་དཔལ་ བྱང་ཆུབ་ ཅེས་བྱ་བ་ དེ་ ནི་ སྟོང་པ་ཉིད་ ཀྱི་ ཚིག་ བླ་དགས་ ཡིན་ ཏེ་ །

source: Mañjuśrī, the emptiness by which awakening is empty is also the emptiness by which all dharmas are empty.
bo: འཇམ་དཔལ་ སྟོང་པ་ཉིད་ གང་ གིས་ བྱང་ཆུབ་ སྟོང་པ་ -འི་ སྟོང་པ་ཉིད་ དེ་ -ས་ ཆོས་ ཐམས་ཅད་ ཀྱང་ སྟོང་ སྟེ་ །

source: And the Tathāgata realized them, precisely in the way in which they are empty.
bo: དེ་བཞིན་ གཤེགས་པ་ -ས་ ནི་ དེ་དག་ ཇི་ལྟར་ སྟོང་པ་ དེ་ལྟ་ བུ་ ཁོ་ན་ -ར་ མངོན་པར་ རྫོགས་པ་ -ར་ སངས་རྒྱས་ སོ་ ། །

source: Mañjuśrī, it is not that emptiness is realized through emptiness.
bo: འཇམ་དཔལ་ སྟོང་པ་ཉིད་ ཀྱིས་ སྟོང་པ་ཉིད་ མངོན་པར་ རྫོགས་པ་ -ར་ སངས་རྒྱས་པ་ ཡང་ མ་ ཡིན་ ཏེ་ །

source: there is one single method: emptiness, or awakening.
bo: སྟོང་པ་ཉིད་ དམ་ བྱང་ཆུབ་ དེ་ ནི་ ཤེས་པ་ -འི་ ཚུལ་ གཅིག་པ་ ཡིན་ ནོ་ ། །

source: And why?
bo: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན་ ། །

source: Mañjuśrī, where there is no emptiness, there is no awakening.
bo: འཇམ་དཔལ་ གང་ ལ་སྟོང་པ་ ཉིད་ ཀྱང་ མེད་ ། བྱང་ཆུབ་ ཀྱང་ མེད་པ་

source: In that respect, Mañjuśrī, there is no duality by which emptiness and awakening could be made into two.
bo: དེ་ ལ་ ནི་ འཇམ་དཔལ་ གང་ གིས་ སྟོང་པ་ཉིད་ དང་ ། བྱང་ཆུབ་ ཅེས་ གཉིས་ སུ་ དབྱེ་བ་ -འི་ གཉིས་ ནི་ ཅུང་ཟད་ ཀྱང་ མེད་ དོ་ །

source: Mañjuśrī, all dharmas are non-dual,
bo: འཇམ་དཔལ་ ཆོས་ ཐམས་ཅད་ ནི་ གཉིས་ སུ་ མེད་པ་ །

source: without characteristics, not made into two,
bo: མཚན་ཉིད་ མེད་པ་ གཉིས་ སུ་ དབྱེ་ -ར་ མེད་པ་ །

source: without names,
bo: མིང་མེད་པ་

source: without signs,
bo: མཚན་མ་ མེད་པ་ །

source: free from mind, mentality, and consciousness,
bo: སེམས་ དང་ ཡིད་ དང་ རྣམ་པ་ -ར་ ཤེས་པ་ དང་ བྲལ་བ་ །

source: non-arisen
bo: མ་ སྐྱེས་པ་ །

source: unceasing,
bo: མ་ འགགས་པ་ །

source: not acting,
bo: རྒྱུ་བ་ མེད་པ་ །

source: not moving forth,
bo: སྤྱོད་པ་ མེད་པ་ །

source: not occurring,
bo: ཀུན་འབྱུང་བ་ མེད་པ་ །

source: without syllables,
bo: ཡི་གེ་ མེད་པ་ །

source: without speech.
bo: སྒྲ་མེད་པ་ ཡིན་པ་ -འི་ ཕྱིར་ རོ་ །།

source: Mañjuśrī, that which is called empty is an appellation for no attachment and no grasping.
bo: འཇམ་དཔལ་ སྟོང་པ་ཉིད་ ཅེས་བྱ་བ་ གང་ཡིན་པ་ དེ་ ནི་ མངོན་པར་ ཞེན་པ་ མེད་པ་ དང་ ། འཛིན་པ་ མེད་པ་ -འི་ ཚིག་ བླ་དགས་ ཡིན་ ཏེ་ །

source: On the other hand, Mañjuśrī, in the ultimate sense, no dharma called empty is there to be perceived.
bo: འཇམ་དཔལ་ དེ་ ལ་ ནི་ དོན་དམ་པ་ -ར་ ན་ གང་སྟོང་པ་ ཞེས་ བྱ་བ་ -འི་ ཆོས་ གང་ཡང་ དམིགས་ སུ་ མེད་ དོ་ །

source: On the other hand, Mañjuśrī,
bo: འཇམ་དཔལ་ འདི་ལྟ་སྟེ་ །

source: the sky is called sky, yet the sky cannot be expressed.
bo: ནམ་མཁའ་ ནམ་མཁའ་ ཞེས་ བརྗོད་ ཀྱང་ ནམ་མཁའ་ ནི་ བརྗོད་པ་ -ར་ བྱ་བ་ མ་ ཡིན་ ནོ་ ། །

source: In the same way, Mañjuśrī, we say ‘empty, empty’ as an entrance to inexpressible, empty things.
bo: འཇམ་དཔལ་ དེ་བཞིན་ དུ་ སྟོང་པ་ སྟོང་པ་ ཞེས་ བརྗོད་ ཀྱང་ སྟོང་པ་ ནི་ བརྗོད་པ་ -ར་ བྱ་བ་ མ་ ཡིན་ ཏེ་ །

source: “All dharmas are nameless,
bo: ཆོས་ ཐམས་ཅད་ ནི་ མིང་མེད་པ་ ཡིན་ ན

source: yet all dharmas are described through names.
bo: དེ་དག་ ལ་ མིང་ གིས་ རྗོད་པ་ -ར་ བྱེད་ དེ་ །

source: Mañjuśrī, a name is not placed in either a primary or an intermediate location.
bo: འཇམ་དཔལ་ ཇི་ལྟར་ མིང་ ཡུལ་ ན་ གནས་པ་ མ་ ཡིན་ །

source: without characteristics,
bo: མཚན་ཉིད་ མེད་པ་ ། །

source: “Thus, Mañjuśrī, all the dharmas are known by the Tathāgata to be, from the very beginning, unborn, non-arisen,
bo: འཇམ་དཔལ་ དེ་བཞིན་ གཤེགས་པ་ -ས་ ནི་ ཆོས་ དེ་དག་ ཐམས་ཅད་ དེ་ལྟར་ གཟོད་མ་ ཉིད་ ནས་ མ་ སྐྱེས་པ་ མ་བྱུང་བ་ །

source: free from mind, mentality, and consciousness,
bo: སེམས་ དང་ ཡིད་ དང་ རྣམ་པ་ -ར་ ཤེས་པ་ དང་ བྲལ་བ་ །

source: without syllables,
bo: ཡི་གེ་ མེད་པ་ །

source: without voice.
bo: སྒྲ་མེད་པ་ -ར་ ཤེས་ སོ་ །

source: They are known to be just free.
bo: དེ་ ཁོ་ན་ བཞིན་ དུ་ རྣམ་པ་ -ར་ གྲོལ་ ཏེ་ །

source: it is not that they are first bound and then freed.
bo: བཅིངས་པ་ ལས་ གྲོལ་བ་ -ར་ གྱུར་པ་ མ་ ཡིན་ ནོ་ ། །

source: “Awakening, Mañjuśrī, is the same as the sky.
bo: འཇམ་དཔལ་ བྱང་ཆུབ་ ནི་ ནམ་མཁའ་ དང་ མཉམ་པ་ སྟེ་ །

source: The sky is neither even nor uneven.
bo: ནམ་མཁའ་ ནི་ མཉམ་པ་ མ་ ཡིན་ ། མི་མཉམ་པ་ མ་ ཡིན་

source: Awakening, too, is neither even nor uneven.
bo: ལ་ བྱང་ཆུབ་ ཀྱང་ མཉམ་པ་ མ་ ཡིན་ ། མི་མཉམ་པ་ མ་ ཡིན་ ནོ་ ། །

source: And why?
bo: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན་ །

source: Mañjuśrī, a dharma with no real perfection cannot be spoken of as either even or uneven.
bo: འཇམ་དཔལ་ ཆོས་ གང་ ལ་ ཡང་དག་པ་ -ར་ ཡོངས་སུ་ འགྲུབ་པ་ མེད་པ་ དེ་ ནི་ མཉམ་པ་ དང་ ། མི་མཉམ་པ་ -ར་ བརྗོད་པ་ -ར་ བྱ་བ་ མ་ཡིན་པ་ -འི་ ཕྱིར་ རོ་ ། །

source: Therefore, Mañjuśrī, all dharmas are realized by the Tathāgata as neither even nor uneven.
bo: འཇམ་དཔལ་ དེ་བཞིན་ གཤེགས་པ་ -ས་ ནི་ དེ་ལྟར་ ཆོས་ ཐམས་ཅད་ མཉམ་པ་ མེད་པ་ དང་ ། མི་མཉམ་པ་ མེད་པ་ -ར་ མངོན་པར་ རྫོགས་པ་ -ར་ སངས་རྒྱས་ ཏེ་ །

source: They are realized in such a way that not even an atom is made even or uneven.
bo: ཇི་ལྟར་ ཆོས་ ཕྲ་རབ་ ཙམ་ ཡང་ མཉམ་པ་ -ར་ མ་ བྱས་ ། མི་མཉམ་པ་ -ར་ མ་ བྱས་པ་ དེ་ལྟར་ མངོན་པར་ རྫོགས་པ་ -ར་ སངས་རྒྱས་ ཤིང་ །

source: Dharmas are cognized just as they are.
bo: ཡང་དག་པ་ -འི་ ཤེས་པ་ -ས་ ཆོས་ དེ་དག་ ཇི་ལྟ་བ་ དེ་ལྟ་ བུ་ ཁོ་ན་ -ར་ ཤེས་ སོ་ ། །

source: “And how does that accord with the awareness of reality?
bo: འཇམ་དཔལ་ ཡང་དག་པ་ -འི་ ཤེས་པ་ ཡང་ གང་ཞེ་ན་ །

source: Mañjuśrī, all dharmas, non-arisen and unceasing, come into being after having not existed.
bo: འཇམ་དཔལ་ ཆོས་ ཐམས་ཅད་ རྩ་བ་ མེད་པ་ དང་ ། མ་ སྐྱེས་པ་ དང་ ། མ་ འགགས་པ་ དང་ ། མ་བྱུང་བ་ ལས་ འབྱུང་བ་ དང་ ། བྱུང་ ནས་ ཀྱང་ འཇིག་པ་ -ར་ འགྱུར་ ཏེ་ ། །

source: Just like awakening, so also feeling, notion, co-producing factors, and consciousness do not swerve from the tathatā.
bo: བྱང་ཆུབ་ ཇི་ལྟ་བ་ དེ་བཞིན་ དུ་ ཚོར་བ་ དང་ ། འདུ་ཤེས་ དང་ ། འདུ་བྱེད་ རྣམས་ དང་ ། རྣམ་པ་ -ར་ ཤེས་པ་ ཡང་ དེ་བཞིན་ཉིད་ ལས་མི་ འདའ་ -འོ་ །

source: In that respect, Mañjuśrī, what is a consistent basis?
bo: འཇམ་དཔལ་ དེ་ ལ་ ཇི་ལྟ་བ་ བཞིན་ གྱི་ གནས་ གང་ཞེ་ན་ །

source: Mañjuśrī, just like awakening, so also form does not swerve from the tathatā.
bo: འཇམ་དཔལ་ ཇི་ལྟ་བ་ བཞིན་ གྱི་ གནས་ ཞེས་ བྱ་བ་ ནི་ བྱང་ཆུབ་ སྟེ་ ། བྱང་ཆུབ་ ཇི་ལྟ་བ་ དེ་བཞིན་ དུ་ གཟུགས་ ཀྱང་ དེ་བཞིན་ཉིད་ ལས་མི་ འདའ་ -འོ་ ། །

source: In this way, Mañjuśrī, they come into existence and go out of existence.
bo: འཇམ་དཔལ་ དེ་ལྟར་ བྱུང་བ་ དང་ ། འཇིག་པ་ ལ་ བརྟེན་ ནས་ ཆོས་ རྣམས་ འཇུག་པ་ -ར་ འགྱུར་ ཡང་ འདི་ ལ་ འཇུག་པ་ -ར་ འགྱུར་བ་ གང་ཡང་ མེད་ དེ་ །

source: Thus it is said that the Tathāgata teaches the Dharma for the sake of cutting off the dharmas.
bo: དེ་ ནི་ ལམ་ གྱི་ རྒྱུན་ བཅད་པ་ -འི་ ཕྱིར་ དེ་བཞིན་ གཤེགས་པ་ ཆོས་སྟོན་པ་ ཞེས་ བྱ་ -འོ་ ། །

source: “Awakening, Mañjuśrī, is a consistent basis.
bo: འཇམ་དཔལ་ བྱང་ཆུབ་ ཅེས་བྱ་བ་ དེ་ ནི་ ཇི་ལྟ་བ་ བཞིན་ གྱི་ གནས་ ཡིན་ ཏེ་ ། །

source: Just like awakening, so also feeling, notion, co-producing factors, and consciousness do not swerve from the tathatā.
bo: བྱང་ཆུབ་ ཇི་ལྟ་བ་ དེ་བཞིན་ དུ་ ཚོར་བ་ དང་ ། འདུ་ཤེས་ དང་ ། འདུ་བྱེད་ རྣམས་ དང་ ། རྣམ་པ་ -ར་ ཤེས་པ་ ཡང་ དེ་བཞིན་ཉིད་ ལས་མི་ འདའ་ -འོ་ ། །

source: Just like awakening, so also the earth element does not swerve from the tathatā.
bo: བྱང་ཆུབ་ ཇི་ལྟ་བ་ དེ་བཞིན་ དུ་ ས་ -འི་ ཁམས་ ཀྱང་ དེ་བཞིན་ཉིད་ ལས་མི་ འདའ་ -འོ་ ། །

source: Just like awakening, so also the water element,
bo: བྱང་ཆུབ་ ཇི་ལྟ་བ་ དེ་བཞིན་ དུ་ ཆུ་ -འི་ ཁམས་ དང་ །

source: the heat element,
bo: མེ་ -འི་ ཁམས་ དང་ །

source: the wind element do not swerve from the tathatā.
bo: རླུང་ གི་ ཁམས་ ཀྱང་ དེ་བཞིན་ཉིད་ ལས་མི་ འདའ་ -འོ་ །

source: “Just like awakening, so also the eye-base,
bo: འཇམ་དཔལ་ བྱང་ཆུབ་ ཇི་ལྟ་བ་ དེ་བཞིན་ དུ་ མིག་ གི་ ཁམས་ དང་ །

source: the eye-consciousness-base do not swerve from the tathatā.
bo: མིག་ གི་ རྣམ་པ་ -ར་ ཤེས་པ་ -འི་ ཁམས་ ཀྱང་ དེ་བཞིན་ཉིད་ ལས་མི་ འདའ་ -འོ་ ། །

source: Just like awakening, Mañjuśrī, the ear-base,
bo: བྱང་ཆུབ་ ཇི་ལྟ་བ་ དེ་བཞིན་ དུ་ རྣ་བ་ -འི་ ཁམས་ དང་ །

source: the sound-base,
bo: སྒྲ་ -འི་ ཁམས་ དང་ །

source: the ear-consciousness-base,
bo: རྣ་བ་ -འི་ རྣམ་པ་ -ར་ ཤེས་པ་ -འི་ ཁམས་ དང་ །

source: the nose-base,
bo: སྣ་ -འི་ ཁམས་ དང་ །

source: the smell-base,
bo: དྲི་ -འི་ ཁམས་ དང་ །

source: the nose-consciousness-base,
bo: སྣ་ -འི་ རྣམ་པ་ -ར་ ཤེས་པ་ -འི་ ཁམས་ དང་ །

source: the tongue-base,
bo: ལྕེ་ -འི་ ཁམས་ དང་ །

source: the flavor-base,
bo: རོ་ -འི་ ཁམས་ དང་ །

source: the tongue-consciousness-base,
bo: ལྕེ་ -འི་ རྣམ་པ་ -ར་ ཤེས་པ་ -འི་ ཁམས་ དང་ །

source: the body-base,
bo: ལུས་ ཀྱི་ ཁམས་ དང་ །

source: the touchable-base,
bo: རེག་བྱ་ -འི་ ཁམས་ དང་ །

source: the body-consciousness-base,
bo: ལུས་ ཀྱི་ རྣམ་པ་ -ར་ ཤེས་པ་ -འི་ ཁམས་ དང་ །

source: the mind-base,
bo: ཡིད་ ཀྱི་ ཁམས་ དང་ །

source: the dharma-base,
bo: ཆོས་ ཀྱི་ ཁམས་ དང་ །

source: the mind-consciousness-base do not swerve from the tathatā.
bo: ཡིད་ ཀྱི་ རྣམ་པ་ -ར་ ཤེས་པ་ -འི་ ཁམས་ ཀྱང་ དེ་བཞིན་ཉིད་ ལས་མི་ འདའ་ -འོ་ ། །

source: “And dharmas can be designated
bo: ཆོས་ གདགས་པ་ དེ་ ནི་ འདི་ཙམ་ དུ་ ཟད་ དེ་ །

source: just as this: the aggregates,
bo: འདི་ལྟ་སྟེ་ ཕུང་པོ་ དང་ །

source: the bases, and
bo: ཁམས་ དང་ །

source: the entrances.
bo: སྐྱེ་མཆེད་ དུ་ གདགས་པ་ -འོ་ ། །

source: And this entire set has been realized by the Tathāgata as consistent:
bo: དེ་བཞིན་ གཤེགས་པ་ -ས་ ནི་ དེ་དག་ ཡང་དག་པ་ ཇི་ལྟ་བ་ བཞིན་ དུ་ མངོན་པར་ རྫོགས་པ་ -ར་ སངས་རྒྱས་ ཤིང་ ཕྱིན་ ཅི་ མ་ ལོག་པ་ -ར་ མངོན་པར་ རྫོགས་པ་ -ར་ སངས་རྒྱས་ སོ་ ། །

source: as it is before, so also is it later, and in between.
bo: དེ་དག་ ནི་ སྔོན་ ཇི་ལྟ་བ་ བཞིན་ དུ་ ཕྱིས་ ཀྱང་ དེ་བཞིན་ བར་ དུ་ ཡང་ དེ་བཞིན་ ཏེ་ །

source: It is unborn in the prior limit,
bo: སྔོན་ གྱི་ མཐའ་ -ར་ མ་ སྐྱེས་པ་ དང་ །

source: not transferred at the later limit, and
bo: ཕྱི་མ་ -འི་ མཐའ་ -ར་ མི་ འཕོ་བ་ དང་ །

source: isolated in the middle.
bo: དབུས་ སུ་ བདེན་པ་ ཡིན་ ནོ་ ། །

source: In this way, for all those things there is a ‘consistent basis.’
bo: དེ་ལྟར་ དེ་དག་ ཇི་ལྟ་བ་ བཞིན་ གྱི་ གནས་ ཡིན་ ཏེ་ །

source: Just as one is, so are all;
bo: གཅིག་ ཇི་ལྟ་བ་ བཞིན་ དུ་ ཐམས་ཅད་ དེ་བཞིན་ ལ་ །

source: just as all are, so is one.
bo: ཐམས་ཅད་ ཇི་ལྟ་བ་ བཞིན་ དུ་ གཅིག་ ཀྱང་ དེ་བཞིན་ ཏེ་ །

source: And in this respect, Mañjuśrī, neither oneness nor plurality is perceived.
bo: འཇམ་དཔལ་ འདི་ ལ་ ནི་ གཅིག་པ་ ཉིད་ དམ་ ། མང་པོ་ ཉིད་ དུ་ དམིགས་ སུ་ མེད་ དོ་ ། །

source: “Awakening, Mañjuśrī, enters the aspect-less by entering an aspect.
bo: འཇམ་དཔལ་ བྱང་ཆུབ་ ནི་ རྣམ་པ་ -འི་ འཇུག་པ་ -ས་ རྣམ་པ་ མེད་པ་ -ར་ ཞུགས་པ་ ཡིན་ ཏེ་ །

source: In that respect, Mañjuśrī, what is an aspect, and what is the aspect-less?
bo: འཇམ་དཔལ་ དེ་ ལ་ རྣམ་པ་ ནི་ གང་ ། རྣམ་པ་ མེད་པ་ ནི་ གང་ཞེ་ན་ །

source: The aspect, Mañjuśrī, is explained as taking up all wholesome dharmas.
bo: འཇམ་དཔལ་ རྣམ་པ་ ཞེས་ བྱ་བ་ ནི་ དགེ་བ་ -འི་ ཆོས་ ཐམས་ཅད་ ལ་ རྩོམ་པ་ -འོ་ །

source: The aspect-less is explained as the non-perception of any dharmas.
bo: རྣམ་པ་ མེད་པ་ ཞེས་ བྱ་བ་ ནི་ ཆོས་ ཐམས་ཅད་ དམིགས་ སུ་ མེད་པ་ -འོ་ ། །

source: The aspect is explained as the stabilization of an unstable mind.
bo: རྣམ་པ་ ཞེས་ བྱ་བ་ ནི་ སེམས་ མི་ གནས་པ་ -འི་ གནས་སྐབས་ སོ་ ། །

source: The aspect-less is explained as the gate to liberation of the samādhi of no-sign.
bo: རྣམ་པ་ མེད་པ་ ཞེས་ བྱ་བ་ ནི་ རྣམ་པ་ -ར་ ཐར་པ་ -འི་ སྒོ་ མཚན་མ་ མེད་པ་ -འི་ ཏིང་ངེ་འཛིན་ ཏོ་ ། །

source: The aspect-less is explained as the gate to liberation of the samādhi of no-sign.
bo: རྣམ་པ་ མེད་པ་ ཞེས་ བྱ་བ་ ནི་ རྣམ་པ་ -ར་ ཐར་པ་ -འི་ སྒོ་ མཚན་མ་ མེད་པ་ -འི་ ཏིང་ངེ་འཛིན་ ཏོ་ །

source: The aspect is explained as thinking, comparing, counting, and thorough consideration of all dharmas.
bo: རྣམ་པ་ ཞེས་ བྱ་བ་ ནི་ ཆོས་ ཐམས་ཅད་ ལ་ སེམས་པ་ དང་ འཇལ་བ་ དང་ ། བགྲང་བ་ དང་ ། སོ་སོ་ -ར་ རྟོག་པ་ -འོ་ ། །

source: The aspect-less is explained as transcending comparison.
bo: རྣམ་པ་ མེད་པ་ ཞེས་ བྱ་བ་ ནི་ གཞལ་བ་ ལས་ ཡང་དག་པ་ -ར་ འདས་པ་ སྟེ

source: What is transcending comparison?
bo: གཞལ་བ་ ལས་ ཡང་དག་པ་ -ར་ འདས་པ་ ཡང་ གང་ཞེ་ན་ །

source: It is that with respect to which there is no function of consciousness.
bo: གང་ ལ་ རྣམ་པ་ -ར་ ཤེས་པ་ -འི་ ལས་ མེད་པ་ -འོ་ ། །

source: The aspect is explained as the thorough consideration of the co-produced.
bo: རྣམ་པ་ ཞེས་ བྱ་བ་ ནི་ འདུས་བྱས་ ལ་སོ་ སོ་ -ར་ རྟོག་པ་ -འོ་ ། །

source: The aspect-less is explained as the thorough consideration of the unproduced.
bo: རྣམ་པ་ མེད་པ་ ཞེས་ བྱ་བ་ ནི་ འདུས་མ་བྱས་ ལ་སོ་ སོ་ -ར་ རྟོག་པ་ -འོ་ ། །

source: “Awakening, Mañjuśrī, is without outflows and without clinging.
bo: འཇམ་དཔལ་ བྱང་ཆུབ་ ནི་ ཟག་པ་ མེད་པ་ ཉིད་ དང་ ། ལེན་པ་ མེད་པ་ ཉིད་ ཡིན་ ཏེ་ །

source: In that respect, Mañjuśrī, how is it without outflows, and how is it without clinging?
bo: འཇམ་དཔལ་ དེ་ ལ་ ཟག་པ་ མེད་པ་ གང་ ལེན་པ་ མེད་པ་ ཉིད་ གང་ཞེ་ན་ །

source: Being without outflows, Mañjuśrī, is explained as the absence of the four outflows.
bo: འཇམ་དཔལ་ ཟག་པ་ མེད་པ་ ཉིད་ ཅེས་བྱ་བ་ ནི་ ཟག་པ་ བཞི་ དང་ བྲལ་བ་ སྟེ་ །

source: Which four?
bo: བཞི་པོ་ དེ་དག་ ཀྱང་ གང་ཞེ་ན་ །

source: They are: the outflow of desire,
bo: འདི་ལྟ་སྟེ་ འདོད་པ་ -འི་ ཟག་པ་ དང་

source: the outflow of existence,
bo: སྲིད་པ་ -འི་ ཟག་པ་ དང་ །

source: the outflow of views.
bo: ལྟ་བ་ -འི་ ཟག་པ་ སྟེ་ །

source: the outflow of ignorance, and
bo: མ་རིག་པ་ -འི་ ཟག་པ་ དང་ ། །

source: “Being without clinging is explained as the absence of four types of clinging.
bo: ལེན་པ་ མེད་པ་ ཉིད་ ཅེས་བྱ་བ་ ནི་ ལེན་པ་ བཞི་ དང་ བྲལ་བ་ སྟེ་ །

source: They are: clinging to desire,
bo: འདི་ལྟ་སྟེ་ འདོད་པ་ -འི་ ལེན་པ་ དང་ །

source: clinging to views,
bo: ལྟ་བ་ -འི་ ལེན་པ་ དང་ །

source: clinging to positing a self.
bo: བདག་ ཏུ་ སྨྲ་བ་ -འི་ ལེན་པ་ སྟེ་ །

source: clinging to one’s attachment to discipline and vows, and
bo: ཚུལ་ཁྲིམས་ དང་ ། བརྟུལ་ཞུགས་ མཆོག་ ཏུ་ འཛིན་པ་ -འི་ ལེན་པ་ དང་ ། །

source: “Beings are blinded by ignorance.
bo: འཇམ་དཔལ་ དེ་ ལ་ སེམས་ཅན་ མ་རིག་པ་ -ས་ ལྡོངས་པ་ -ར་ བྱས་པ་ །

source: Craving disturbs them.
bo: སྲེད་པ་ -ས་ དཀྲུགས་པ་ -ར་ གྱུར་པ་ དག་ ནི་

source: They develop mutual attachment and cling to each other.
bo: ཕན་ཚུན་ མངོན་པར་ ཞེན་པ་ -ར་ གྱུར་ ནས་ ལེན་པ་ -ར་ བྱེད་ ཀྱི་

source: In that respect, Mañjuśrī, the Tathāgata thoroughly understands that the root of clinging is the position of a self.
bo: དེ་བཞིན་ གཤེགས་པ་ -ས་ ནི་ བདག་ ཏུ་ སྨྲ་བ་ -འི་ ལེན་པ་ རྩ་བ་ ཡིན་པ་ -ར་ ཡོངས་སུ་ ཤེས་ ནས་ །

source: Through self-purity, he understands the purity of all sentient beings.
bo: བདག་ རྣམ་པ་ -ར་ དག་པ་ -ས་ སེམས་ཅན་ ཐམས་ཅད་ རྣམ་པ་ -ར་ དག་པ་ རྗེས་སུ་ རྟོགས་པ་ -ར་ གྱུར་ ཏེ་ །

source: The purity of self is the purity of all sentient beings. The purity of all sentient beings is non-dual, not divided into two.
bo: བདག་ རྣམ་པ་ -ར་ དག་པ་ གང་ཡིན་པ་ དང་ ། སེམས་ཅན་ ཐམས་ཅད་ རྣམ་པ་ -ར་ དག་པ་ གང་ཡིན་པ་ དེ་ ནི་ གཉིས་ སུ་ མེད་ དེ་ གཉིས་ སུ་ དབྱེ་ -ར་ མེད་ ལ་ །

source: And the meaning of non-duality is non-arising and non-cessation.
bo: གཉིས་ སུ་ མེད་པ་ -འི་ དོན་ གང་ཡིན་པ་ དེ་ ནི་ སྐྱེ་བ་ མེད་པ་ དང་ ། འགག་པ་ མེད་པ་ ཡིན་ ནོ་ ། །

source: “With respect to non-arising and non-cessation, Mañjuśrī, mind, mentality, and consciousness do not come about.
bo: འཇམ་དཔལ་ སྐྱེ་བ་ མེད་པ་ དང་ ། འགག་པ་ མེད་པ་ ལ་ ནི་ སེམས་ དང་ ཡིད་ དང་ ། རྣམ་པ་ -ར་ ཤེས་པ་ འཇུག་པ་ -ར་ མི་ འགྱུར་ ཏེ་ །

source: In that respect there is no mental construct by which one may place the mind improperly.
bo: དེ་ ལ་ ནི་ ཡོངས་སུ་ རྟོགས་པ་ གང་ གིས་ ཚུལ་བཞིན་ མ་ཡིན་པ་ ཡིད་ ལ་ བྱེད་པ་ -ར་ འགྱུར་བ་ -འི་ ཡོངས་སུ་ རྟོག་པ་ གང་ཡང་ མེད་ དོ་ །

source: In that respect there is no mental construct by which one may place the mind improperly.
bo: དེ་ ལ་ ནི་ ཡོངས་སུ་ རྟོགས་པ་ གང་ གིས་ ཚུལ་བཞིན་ མ་ཡིན་པ་ ཡིད་ ལ་ བྱེད་པ་ -ར་ འགྱུར་བ་ -འི་ ཡོངས་སུ་ རྟོག་པ་ གང་ཡང་ མེད་ དོ་ ། །

source: Whosoever engages in proper mental placement does not give rise to ignorance.
bo: ཚུལ་བཞིན་ ཡིད་ ལ་ བྱེད་པ་ ལ་ རབ་ཏུ་ བརྩོན་པ་ དེ་ ནི་ མ་རིག་པ་ ཀུན་ ནས་ སློང་བ་ མི་ བྱེད་ དོ་ ། །

source: Not giving rise to ignorance means not giving rise to the twelve limbs of existence.
bo: མ་རིག་པ་ ཀུན་ ནས་ ལྡང་བ་ མེད་པ་ གང་ཡིན་པ་ དེ་ ནི་ སྲིད་པ་ -འི་ ཡན་ལག་ བཅུ་གཉིས་པོ་ དག་ གི་ ཀུན་ ནས་ སློང་བ་ མེད་པ་ ཡིན་ ནོ་ ། །

source: Not giving rise to the twelve limbs of existence means no birth.
bo: སྲིད་པ་ -འི་ ཡན་ལག་ བཅུ་གཉིས་པོ་ དག་ གི་ ཀུན་ ནས་ ལྡང་བ་ མེད་པ་ གང་ཡིན་པ་ དེ་ ནི་ སྐྱེ་བ་ མེད་པ་ ཡིན་ ནོ་ ། །

source: No birth is the fixed rule.
bo: སྐྱེ་བ་ མེད་པ་ གང་ཡིན་པ་ དེ་ ནི་ སྐྱོན་མེད་པ་ ཡིན་ ནོ་ ། །

source: The fixed rule is the definitive meaning.
bo: སྐྱོན་མེད་པ་ གང་ཡིན་པ་ དེ་ ནི་ ངེས་པ་ -འི་ དོན་ ཡིན་ ནོ

source: The definitive meaning is the ultimate meaning.
bo: ངེས་པ་ -འི་ དོན་ གང་ཡིན་པ་ དེ་ ནི་ དོན་དམ་པ་ ཡིན་ ནོ་ ། །

source: The ultimate meaning means to be devoid of a person.
bo: དོན་དམ་པ་ གང་ཡིན་པ་ དེ་ ནི་ གང་ཟག་ མེད་པ་ -འི་ དོན་ ཡིན་ ནོ་ ། །

source: The meaning of being devoid of a person is the ineffable meaning.
bo: གང་ཟག་ མེད་པ་ -འི་ དོན་ གང་ཡིན་པ་ དེ་ ནི་ བརྗོད་ དུ་ མེད་པ་ -འི་ དོན་ ཡིན་ ནོ་ ། །

source: The ineffable meaning is the meaning of dependent arising.
bo: བརྗོད་ དུ་ མེད་པ་ -འི་ དོན་ གང་ཡིན་པ་ དེ་ ནི་ རྟེན་ ཅིང་ འབྲེལ་པ་ -ར་ འབྱུང་བ་ -འི་ དོན་ ཡིན་ ནོ་ ། །

source: The meaning of dependent arising is the meaning of the Dharma.
bo: རྟེན་ ཅིང་ འབྲེལ་པ་ -ར་ འབྱུང་བ་ -འི་ དོན་ གང་ཡིན་པ་ དེ་ ནི་ ཆོས་ ཀྱི་ དོན་ ཡིན་ ནོ་ ། །

source: The meaning of the Dharma is the meaning of the Tathāgata.
bo: ཆོས་ ཀྱི་ དོན་ གང་ཡིན་པ་ དེ་ ནི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ དོན་ ཡིན་ ཏེ་ །

source: Hence it is said, ‘One who sees dependent arising sees the Dharma;
bo: དེ་ -འི་ ཕྱིར་ གང་ གིས་ རྟེན་ ཅིང་ འབྲེལ་པ་ -ར་ འབྱུང་བ་ མཐོང་བ་ དེ་ -ས་ ཆོས་ མཐོང་ ངོ་ ། །

source: one who sees the Dharma sees the Tathāgata.’
bo: གང་ གིས་ ཆོས་ མཐོང་བ་ དེ་ -ས་ དེ་བཞིན་ གཤེགས་པ་ མཐོང་ ངོ་ ཞེས་ གསུངས་ ཏེ་ །

source: And he sees in such a way that, when he searches, he does not see anything whatsoever.
bo: ཇི་ལྟར་ ཡོངས་སུ་ ཚོལ་བ་ ན་ ཅི་ཡང་ མི་ མཐོང་བ་ དེ་ལྟར་ མཐོང་ ངོ་ ། ། འཇམ་དཔལ་ དེ་ ལ་ ཅི་ཡང་ ཞེས་ བྱ་བ་ གང་ཞེ་ན་ ། འདི་ལྟ་སྟེ་ སེམས་ དང་ དམིགས་པ་ སྟེ་ ། །

source: “Awakening, Mañjuśrī, is pure, stainless, and without disturbance.
bo: འཇམ་དཔལ་ བྱང་ཆུབ་ ནི་ དག་པ་ དང་ ། དྲི་མ་ མེད་པ་ དང་ ཉོན་མོངས་པ་ མེད་པ་ ཡིན་ ཏེ་ །

source: In that respect, Mañjuśrī, what is purity, what is meant by stainless, and what is non-disturbance?
bo: འཇམ་དཔལ་ དེ་ ལ་ དག་པ་ ནི་ གང་ དྲི་མ་ མེད་པ་ ནི་ གང་ ཉོན་མོངས་པ་ མེད་པ་ ནི་ གང་ཞེ་ན་ །

source: Emptiness, Mañjuśrī, is purity;
bo: འཇམ་དཔལ་ སྟོང་པ་ཉིད་ ནི་ དག་པ་ -འོ་ ། །

source: no-sign is stainless;
bo: མཚན་མ་ མེད་པ་ ནི་ དྲི་མ་ མེད་པ་ -འོ་ ། །

source: no-wish is non-disturbance.
bo: སྨོན་པ་ མེད་པ་ ནི་ ཉོན་མོངས་པ་ མེད་པ་ -འོ་ ། །

source: Non-birth is purity;
bo: སྐྱེ་བ་ མེད་པ་ ནི་ དག་པ་ -འོ་ ། །

source: non-effort is stainless;
bo: མངོན་པར་ འདུ་ བྱ་བ་ མེད་པ་ ནི་ དྲི་མ་ མེད་པ་ -འོ་ ། །

source: non-arising is non-disturbance.
bo: འབྱུང་བ་ མེད་པ་ ནི་ ཉོན་མོངས་པ་ མེད་པ་ -འོ་ ། །

source: The nature is purity;
bo: རང་བཞིན་ ནི་ དག་པ་ -འོ་ །

source: complete purity is stainless;
bo: ཡོངས་སུ་ དག་པ་ ནི་ དྲི་མ་ མེད་པ་ -འོ་ ། །

source: luminosity is non-disturbance.
bo: འོད་གསལ་བ་ ནི་ ཉོན་མོངས་པ་ མེད་པ་ -འོ་ ། །

source: No elaboration is purity;
bo: སྤྲོས་པ་ མེད་པ་ ནི་ དག་པ་ -འོ་ ། །
