Repository: OpenPecha-Data/0fbd31ce377b49a79da3bbcf2402ad48
Catalog: *.po
Languages: bo

source: It is sameness according to the understanding of the meaning; it is the sameness of awareness, entering the gate of non-duality.
bo: དོན་ ཤེས་པ་ དང་ ། རྣམ་པ་ -ར་ ཤེས་པ་ ལ་ མཉམ་པ་ཉིད་ གང་ཡིན་པ་ དེ་ ནི་ གཉིས་ སུ་ མེད་པ་ -འི་ སྒོར་ འཇུག་པ་ -ས་ ན་ ། ཤེས་པ་ ཡིན་ ནོ་ ། །

source: The non-occurrence of the dharma and the sameness of meaning and expression are the same with respect to the non-dual meaning.
bo: ཆོས་ ལ་མ་ ཞུགས་པ་ གང་ཡིན་པ་ དང་ ། དོན་ དང་ ཚིག་འབྲུ་ མཉམ་པ་ཉིད་ གང་ཡིན་པ་ དེ་ ནི་ གཉིས་ སུ་ མེད་པ་ -འི་ དོན་ གྱིས་ མཉམ་པ་ཉིད་ ཡིན་ ཏེ་ །

source: With respect to that, a bodhisattva should understand well the cause of affliction and the cause of purification.
bo: དེ་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ -ས་ ཀུན་ ནས་ ཉོན་མོངས་པ་ -འི་ རྒྱུ་ དང་ ། རྣམ་པ་ -ར་ བྱང་བ་ -འི་ རྒྱུ་ ཡང་ ཡོངས་སུ་ ཤེས་པ་ -ར་ བྱ་ ཞིང་ །

source: He should neither abide with the purity of the cause of affliction, nor with the purity of the cause of purification.
bo: ཀུན་ ནས་ ཉོན་མོངས་པ་ -འི་ རྒྱུ་ རྣམ་པ་ -ར་ དག་པ་ དང་ ། རྣམ་པ་ -ར་ བྱང་བ་ -འི་ རྒྱུ་ རྣམ་པ་ -ར་ དག་པ་ -ས་ ཀྱང་ གནས་པ་ -ར་ མི་ བྱ་ -འོ་ ། །

source: “Elevating self is a cause of affliction.
bo: བདག་ ཀུན་ ནས་ སློང་བ་ དང་ ། ལྟ་བ་ ཀུན་ ནས་ སློང་བ་ ནི་ ཀུན་ ནས་ ཉོན་མོངས་པ་ -འི་ རྒྱུ་ ཡིན་ ནོ་ ། །

source: Forbearance in one’s engagement with the selflessness of dharmas is a cause of purification.
bo: ཆོས་བདག་ མེད་པ་ ལ་ འཇུག་པ་ -འི་ བཟོད་པ་ ནི་ རྣམ་པ་ -ར་ བྱང་བ་ -འི་ རྒྱུ་ ཡིན་ ནོ་ ། །

source: “The view of ‘I’ and ‘mine’ is a cause of affliction.
bo: ངར་ འཛིན་པ་ དང་ ། ང་རྒྱལ་ གྱི་ ལྟ་བ་ ནི་ ཀུན་ ནས་ ཉོན་མོངས་པ་ -འི་ རྒྱུ་ ཡིན་ ནོ་ ། །

source: Inner pacification and outer non-movement is a cause of purification.
bo: ནང་ཉེ་ བར་ ཞི་བ་ དང་ ཕྱི་རོལ་ ཏུ་ རྒྱུ་བ་ མེད་པ་ ནི་ རྣམ་པ་ -ར་ བྱང་བ་ -འི་ རྒྱུ་ ཡིན་ ནོ་ ། །

source: “Thoughts of desire, ill will, and harm are a cause of affliction.
bo: འདོད་པ་ དང་ ། གནོད་སེམས་ དང་ ། རྣམ་པ་ -ར་ འཚེ་བ་ དང་ ། རྟོག་པ་ དག་ ནི་ ཀུན་ ནས་ ཉོན་མོངས་པ་ -འི་ རྒྱུ་ ཡིན་ ནོ་ །

source: emptiness,
bo: སྟོང་པ་ཉིད་ དང

source: “It is awakening, because in this way one realizes emptiness, no-sign, no-wish; no-effort, no-dwelling, no coming about; no object of apprehension and no-abode.
bo: དེ་ -ས་ དེ་ལྟར་ སྟོང་པ་ཉིད་ དང་ ། མཚན་མ་ མེད་པ་ དང་ ། སྨོན་པ་ མེད་པ་ དང་ ། མངོན་པར་ འདུ་ བྱ་བ་ མེད་པ་ དང་ ། གནས་ མེད་པ་ དང་ ། འབྱུང་བ་ མེད་པ་ དང་ ། གཟུང་བ་ མེད་པ་ དང་ ། གཞི་མེད་པ་ རྗེས་སུ་ རྟོགས་པ་ -འི་ ཕྱིར་ བྱང་ཆུབ་ སྟེ་ ། །

source: Forbearance in one’s dealings with impure things, in one’s practice of friendliness, compassion, rejoicing, equanimity, and with dependent dharmas, is a cause of purification.
bo: མི་ སྡུག་པ་ དང་ ། བྱམས་པ་ དང་ ། སྙིང་རྗེ་ དང་ ། དགའ་བ་ དང་ ། བཏང་སྙོམས་ དང་ ། བརྟེན་པ་ -འི་ ཆོས་ ལ་ འཇུག་པ་ -འི་ བཟོད་པ་ ནི་ རྣམ་པ་ -ར་ བྱང་བ་ -འི་ རྒྱུ་ ཡིན་ ནོ་ ། །

source: “The four distortions are a cause of affliction.
bo: ཕྱིན་ ཅི་ ལོག་ བཞི་ ནི་ ཀུན་ ནས་ ཉོན་མོངས་པ་ -འི་ རྒྱུ་ ཡིན་ ནོ་ ། །

source: The four placements of mindfulness are a cause of purification.
bo: ཡང་དག་པ་ -འི་ དྲན་པ་ ཉེ་བར་ གཞག་པ་ བཞི་ ནི་ རྣམ་པ་ -ར་ བྱང་བ་ -འི་ རྒྱུ་ ཡིན་ ནོ་ ། །

source: “The five hindrances are a cause of affliction.
bo: སྒྲིབ་པ་ ལྔ་ ནི་ ཀུན་ ནས་ ཉོན་མོངས་པ་ -འི་ རྒྱུ་ ཡིན་ ནོ་ ། །

source: The five faculties are a cause of purification.
bo: དབང་པོ་ ལྔ་ ནི་ རྣམ་པ་ -ར་ བྱང་བ་ -འི་ རྒྱུ་ ཡིན་ ནོ་ ། །

source: “The six entrances are a cause of affliction.
bo: སྐྱེ་མཆེད་ དྲུག་ ནི་ ཀུན་ ནས་ ཉོན་མོངས་པ་ -འི་ རྒྱུ་ ཡིན་ ནོ་ ། །

source: The six remembrances are a cause of purification.
bo: རྗེས་སུ་ དྲན་པ་ དྲུག་ ནི་ རྣམ་པ་ -ར་ བྱང་བ་ -འི་ རྒྱུ་ ཡིན་ ནོ་ ། །

source: “The seven false dharmas are a cause of affliction.
bo: དམ་པ་ མ་ཡིན་པ་ -འི་ ཆོས་ བདུན་ ནི་ ཀུན་ ནས་ ཉོན་མོངས་པ་ -འི་ རྒྱུ་ ཡིན་ ནོ་ ། །

source: The seven limbs of awakening are a cause of purification.
bo: བྱང་ཆུབ་ ཀྱི་ ཡན་ལག་ བདུན་ ནི་ རྣམ་པ་ -ར་ བྱང་བ་ -འི་ རྒྱུ་ ཡིན་ ནོ་ ། །

source: “The eight wrong modes are a cause of affliction.
bo: ལོག་པ་ ཉིད་ བརྒྱད་ ནི་ ཀུན་ ནས་ ཉོན་མོངས་པ་ -འི་ རྒྱུ་ ཡིན་ ནོ་ །

source: The eight right modes are a cause of purification.
bo: ཡང་དག་པ་ ཉིད་ བརྒྱད་ ནི་ རྣམ་པ་ -ར་ བྱང་བ་ -འི་ རྒྱུ་ ཡིན་ ནོ་ ། །

source: “The nine causes of antagonism are a cause of affliction.
bo: ཀུན་ ནས་ མནར་སེམས་ ཀྱི་ དངོས་པོ་ དགུ་ ནི་ ཀུན་ ནས་ ཉོན་མོངས་པ་ -འི་ རྒྱུ་ ཡིན་ ནོ་ ། །

source: The absorptions into nine successive abodes are a cause of purification.
bo: མཐར་གྱིས་ གནས་པ་ -འི་ སྙོམས་པར་ འཇུག་པ་ དགུ་ ནི་ རྣམ་པ་ -ར་ བྱང་བ་ -འི་ རྒྱུ་ ཡིན་ ནོ་ ། །

source: “The ten unwholesome courses of karma are a cause of affliction.
bo: མི་དགེ་བ་ བཅུ་ -འི་ ལས་ ཀྱི་ ལམ་ ནི་ ཀུན་ ནས་ ཉོན་མོངས་པ་ -འི་ རྒྱུ་ ཡིན་ ནོ་ །

source: The ten wholesome courses of karma are a cause of purification.
bo: དགེ་བ་ བཅུ་ -འི་ ལས་ ཀྱི་ ལམ་ ནི་ རྣམ་པ་ -ར་ བྱང་བ་ -འི་ རྒྱུ་ ཡིན་ ཏེ་ །

source: “In brief, all unwholesome mental engagements are a cause of affliction;
bo: མདོ་ -ར་ མི་དགེ་བ་ ཡིད་ ལ་ བྱེད་པ་ ཐམས་ཅད་ ནི་ ཀུན་ ནས་ ཉོན་མོངས་པ་ -འི་ རྒྱུ་ ཡིན་ ནོ་ ། །

source: all wholesome mental engagements are a cause of purification.
bo: དགེ་བ་ ཡིད་ ལ་ བྱེད་པ་ ཐམས་ཅད་ ནི་ རྣམ་པ་ -ར་ བྱང་བ་ -འི་ རྒྱུ་ ཡིན་ ནོ་ །

source: without a sentient being,
bo: སེམས་ཅན་ མེད་པ་ དང་ །

source: without a living being,
bo: སྲོག་མེད་པ་ དང་ །

source: without one who nourishes,
bo: གང་ཟག་ མེད་པ་ དང་ །

source: without a soul or a person,
bo: བདག་པོ་ མེད་པ་ དང་ །

source: without a master,
bo: ཡོངས་སུ་ འཛིན་པ་ མེད་པ་ དང་ །

source: without activity,
bo: བྱེད་པ་ མེད་པ་ དང་ །

source: comparable to an illusion, without characteristics,
bo: སྒྱུ་མ་ ལྟ་བུ་ དང་ མཚན་ཉིད་ མེད་པ་ དང་

source: pacified from within.
bo: ནང་ཉེ་ བར་ ཞི་བ་ ཡིན་ ནོ་ ། །

source: “In that respect, whether causes of affliction or of purification, all dharmas are by nature empty,
bo: དེ་ ལ་ ཀུན་ ནས་ ཉོན་མོངས་པ་ -འི་ རྒྱུ་ གང་ཡིན་པ་ དང་ ། རྣམ་པ་ -ར་ བྱང་བ་ -འི་ རྒྱུ་ གང་ཡིན་པ་ -འི་ ཆོས་ དེ་དག་ ཐམས་ཅད་ ནི་ རང་བཞིན་ གྱིས་ སྟོང་པ་ དང་ ། །

source: pacified from within they are utterly pacified.
bo: ནང་ཉེ་ བར་ ཞི་བ་ གང་ཡིན་པ་ དེ་ ནི་ རབ་ཏུ་ ཞི་བ་ -འོ་ ། །

source: Utterly pacified, they are their intrinsic nature.
bo: རབ་ཏུ་ ཞི་བ་ གང་ཡིན་པ་ དེ་ ནི་ རང་བཞིན་ ནོ་ ། །

source: Their intrinsic nature is not being perceived.
bo: རང་བཞིན་ གང་ཡིན་པ་ དེ་ ནི་ དམིགས་ སུ་ མེད་པ་ -འོ་ ། །

source: Not being perceived is to have no abode.
bo: དམིགས་ སུ་ མེད་པ་ གང་ཡིན་པ་ དེ་ ནི་ གནས་ མེད་པ་ -འོ་ ། །

source: That which has no abode is thatness.
bo: གནས་ མེད་པ་ གང་ཡིན་པ་ དེ་ ནི་ དེ་ ཁོ་ན་ -འོ་ ། །

source: Thatness is space.
bo: དེ་ ཁོ་ན་ ནི་ ནམ་མཁའ་ སྟེ་ ། །

source: And why?
bo: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན་ །

source: One cognizes all dharmas as the same as space. One engages conventionally in the purification of afflictions, yet does not abandon the dharmatā of space.
bo: དེ་ -ས་ ཆོས་ ཐམས་ཅད་ ནམ་མཁའ་ ལྟ་བུ་ -ར་ རབ་ཏུ་ ཤེས་ ན་ ཀུན་ ནས་ ཉོན་མོངས་པ་ དང་ རྣམ་པ་ -ར་ བྱང་བ་ -ས་ སྤྱོད་ ཀྱང་ ནམ་མཁའ་ -འི་ ཆོས་ཉིད་ དག་ མི་ སྤོང་ ངོ་ །

source: Mañjuśrī, no dharma whatsoever can be found for which there may be arising or cessation.”
bo: འཇམ་དཔལ་ གང་ ལ་ སྐྱེ་བ་ -འམ་ ། འགག་པ་ -ར་ འགྱུར་བ་ -འི་ ཆོས་ དེ་ གང་ཡང་ མེད་པ་ -འི་ ཕྱིར་ རོ་ ། །

source: Mañjuśrī inquired,
bo: འཇམ་དཔལ་ གྱིས་ གསོལ་པ་ །

source: “How then, Bhagavat, did the Tathāgata obtain awakening?”
bo: བཅོམ་ལྡན་འདས་ འོ་ན་ དེ་བཞིན་ གཤེགས་པ་ -ས་ བྱང་ཆུབ་ ཇི་ལྟར་ བརྙེས་ ལགས་ །

source: The Bhagavat replied,
bo: བཅོམ་ལྡན་འདས་ ཀྱིས་ བཀའ་ སྩལ་པ་ །

source: “Mañjuśrī, the Tathāgata obtained an awakening that has no root and no ground to stand upon.”
bo: འཇམ་དཔལ་ དེ་བཞིན་ གཤེགས་པ་ -ས་ ནི་ རྩ་བ་ མེད་པ་ དང་ ། གནས་ མེད་པ་ -ར་ བྱང་ཆུབ་ ཐོབ་བོ་ ། །

source: Mañjuśrī asked,
bo: འཇམ་དཔལ་ གྱིས་ གསོལ་པ་ །

source: Bhagavat, what root would that be,
bo: བཅོམ་ལྡན་འདས་ དེ་ ལ་རྩ་བ་ ནི་ གང་ ལགས་ །

source: and what ground to stand upon?”
bo: གནས་ ནི་ གང་ ལགས་ །

source: “Mañjuśrī, that root would be the transitory collection,
bo: འཇམ་དཔལ་ འཇིག་ཚོགས་ ནི་ རྩ་བ་ ཡིན་ ནོ་ ། །

source: and that ground to stand upon the imagination of what is not there.
bo: ཡང་དག་པ་ མ་ཡིན་པ་ -འི་ ཀུན་ ཏུ་ རྟོག་པ་ ནི་ གནས་ ཡིན་ ནོ་ ། །

source: Then, Mañjuśrī, the Tathāgata knows the sameness of all dharmas through the sameness of awakening.
bo: འཇམ་དཔལ་ དེ་ ལ་ དེ་བཞིན་ གཤེགས་པ་ -ས་ བྱང་ཆུབ་ མཉམ་པ་ཉིད་ ཀྱིས་ ཆོས་ ཐམས་ཅད་ མཉམ་པ་ཉིད་ དུ་ ཤེས་ ཏེ་ །

source: Therefore it is said, Mañjuśrī, that ‘the Tathāgata realized an awakening that has no root and no ground to stand upon.’
bo: འཇམ་དཔལ་ དེ་ -འི་ ཕྱིར་ དེ་བཞིན་ གཤེགས་པ་ -ས་ རྩ་བ་ མེད་པ་ དང་ ། གནས་ མེད་པ་ -ར་ བྱང་ཆུབ་ མངོན་པར་ རྫོགས་པ་ -ར་ སངས་རྒྱས་ ཞེས་ བྱ་ -འོ་ ། །

source: “Awakening, Mañjuśrī, is to be at peace, utterly at peace.
bo: འཇམ་དཔལ་ བྱང་ཆུབ་ ནི་ ཞི་བ་ དང་ ཉེ་བར་ ཞི་བ་ ཡིན་ ཏེ་ །

source: In that respect, what is peace,
bo: དེ་ ལ་ ཞི་བ་ ནི་ གང་ །

source: what is utter peace?
bo: ཉེ་བར་ ཞི་བ་ ནི་ གང་ཞེ་ན་ །

source: Inside there is peace;
bo: ནང་ ནི་ ཞི་བ་ ཡིན་ ནོ་ ། །

source: outside there is utter peace.
bo: ཕྱི་རོལ་ ནི་ ཉེ་བར་ ཞི་བ་ ཡིན་ ནོ་ ། །

source: Why is that?
bo: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན་ །

source: “The eye, Mañjuśrī, is empty of a self and what belongs to a self;
bo: འཇམ་དཔལ་ མིག་ ནི་ བདག་ དང་ བདག་ གིས་ སྟོང་ སྟེ་ །

source: such is its nature. This is called peace.
bo: དེ་ -འི་ རང་བཞིན་ དེ་ ཡིན་པ་ -འི་ ཕྱིར་ དེ་ ནི་ ཞི་བ་ ཞེས་ བྱ་ -འོ་ ། །

source: Thoroughly understanding that the eye is empty, one does not run toward forms.
bo: དེ་ -ས་ མིག་ སྟོང་པ་ ཞེས་ བྱ་བ་ -ར་ ཡོངས་སུ་ ཤེས་ ནས་ གཟུགས་ རྣམས་ ལ་ མི་ རྒྱུག་ སྟེ་ །

source: Thus it is called utter peace.
bo: དེ་ -འི་ ཕྱིར་ ཉེ་བར་ ཞི་བ་ ཞེས་ བྱ་ -འོ་ ། །

source: “In the same way, the ear is empty of a self and what belongs to a self;
bo: དེ་བཞིན་ དུ་ རྣ་བ་ ནི་ བདག་ དང་ བདག་ གིས་ སྟོང་ སྟེ་ ། །

source: Thoroughly understanding that the ear is empty, one does not run toward sounds.
bo: དེ་ -ས་ རྣ་བ་ སྟོང་པ་ ཞེས་ བྱ་བ་ -ར་ ཡོངས་སུ་ ཤེས་ ནས་ སྒྲ་ རྣམས་ ལ་ མི་ རྒྱུག་ སྟེ་ ། །

source: “The nose is empty of a self and what belongs to a self;
bo: སྣ་ ནི་ བདག་ དང་ བདག་ གིས་ སྟོང་ སྟེ་ །

source: Thoroughly understanding that the nose is empty,
bo: དེ་ -ས་ སྣ་ སྟོང་པ་ ཞེས་ བྱ་བ་ -ར་ ཡོངས་སུ་ ཤེས་ ནས་ །

source: one does not run toward smells.
bo: དྲི་ རྣམས་ ལ་ མི་ རྒྱུག་ སྟེ་ ། །

source: “The tongue is empty of a self and what belongs to a self;
bo: ལྕེ་ ནི་ བདག་ དང་ བདག་ གིས་ སྟོང་ སྟེ་ ། །

source: Thoroughly understanding that the tongue is empty, one does not run toward flavors.
bo: དེ་ -ས་ ལྕེ་ སྟོང་པ་ ཞེས་ བྱ་བ་ -ར་ ཡོངས་སུ་ ཤེས་ ནས་ རོ་ རྣམས་ ལ་ མི་ རྒྱུག་ སྟེ་ ། །

source: “The body is empty of a self and what belongs to a self;
bo: ལུས་ ནི་ བདག་ དང་ བདག་ གིས་ སྟོང་ སྟེ་ ། །

source: Thoroughly understanding that the body is empty,
bo: དེ་ -ས་ ལུས་ སྟོང་པ་ ཞེས་ བྱ་བ་ -ར་ ཡོངས་སུ་ ཤེས་ ནས་ །

source: one does not run toward touchable things.
bo: རེག་བྱ་ རྣམས་ ལ་ མི་ རྒྱུག་ སྟེ་ ། །

source: “The mind, Mañjuśrī, is empty of a self and what belongs to a self;
bo: འཇམ་དཔལ་ ཡིད་ ནི་ བདག་ དང་ བདག་ གིས་ སྟོང་ སྟེ་ ། །

source: Thoroughly understanding that the mind is empty,
bo: དེ་ -ས་ ཡིད་ སྟོང་པ་ ཞེས་ བྱ་བ་ -ར་ ཡོངས་སུ་ ཤེས་ ནས་ །

source: one does not run toward dharmas.
bo: ཆོས་ རྣམས་ ལ་ མི་ རྒྱུག་ སྟེ་ །

source: The nature is not afflicted;
bo: རང་བཞིན་ གང་ཡིན་པ་ དེ་ ནི་ ཀུན་ ནས་ ཉོན་མོངས་པ་ མེད་པ་ །

source: “Awakening, Mañjuśrī, is by nature luminous, because the mind is by nature luminous; that is why it is said to be luminous by nature.
bo: འཇམ་དཔལ་ བྱང་ཆུབ་ ནི་ སེམས་ ཀྱི་ རང་བཞིན་ འོད་གསལ་བ་ ཉིད་ ཀྱིས་ རང་བཞིན་ འོད་གསལ་བ་ ཡིན་ ཏེ་ ། ཅིའི་ཕྱིར་ འོད་གསལ་བ་ ཞེས་ བྱ་ ཞེ་ན་ །

source: it is the same as space,
bo: ནམ་མཁའ་ དང་ མཉམ་པ་ །

source: it has the nature of space,
bo: ནམ་མཁའ་ -འི་ རང་བཞིན་ ཅན་ །

source: it goes together with space,
bo: ནམ་མཁའ་ -ར་ ཡང་དག་པ་ -ར་ འདུ་བ་ །

source: it is comparable to space.
bo: ནམ་མཁའ་ ལྟ་བུ་ སྟེ་ །

source: The nature is utterly luminous.
bo: ཪང་ བཞིན་ གྱིས་ ཤིན་ཏུ་ འོད་གསལ་བ་ ཡིན་པ་ -འི་ ཕྱིར་ རོ་ ། །

source: “Awakening, Mañjuśrī, is without striving or giving anything up.
bo: འཇམ་དཔལ་ བྱང་ཆུབ་ ནི་ བླང་བ་ མེད་པ་ ཉིད་ དང་ ། དོར་བ་ མེད་པ་ ཉིད་ ཡིན་ ཏེ་ །

source: In that respect, how is it without striving,
bo: དེ་ ལ་ བླང་བ་ མེད་པ་ ཉིད་ ནི་ གང་ །

source: and how is it without giving anything up?
bo: དོར་བ་ མེད་པ་ ཉིད་ ནི་ གང་ཞེ་ན་ །

source: Without striving means not to grasp at any dharma.
bo: བླང་བ་ མེད་པ་ ཉིད་ ཅེས་བྱ་བ་ ནི་ ཆོས་ ཐམས་ཅད་ གཟུང་ དུ་ མེད་པ་ ཉིད་ ཡིན་ ནོ་ །

source: Without striving means not to grasp at any dharma.
bo: བླང་བ་ མེད་པ་ ཉིད་ ཅེས་བྱ་བ་ ནི་ ཆོས་ ཐམས་ཅད་ གཟུང་ དུ་ མེད་པ་ ཉིད་ ཡིན་ ནོ་ ། །

source: Without giving anything up means not to abandon any dharma.
bo: དོར་བ་ མེད་པ་ ཉིད་ ཅེས་བྱ་བ་ ནི་ ཆོས་ ཐམས་ཅད་ སྤང་ དུ་ མེད་པ་ ཉིད་ ཡིན་ ནོ་ ། །

source: In that respect, Mañjuśrī, the Tathāgata, without striving or giving anything up, crossed the stream.
bo: འཇམ་དཔལ་ དེ་ ལ་ དེ་བཞིན་ གཤེགས་པ་ ནི་ བླང་བ་ མེད་པ་ ཉིད་ དང་ ། དོར་བ་ མེད་པ་ ཉིད་ ཀྱིས་ ཆུ་བོ་ ལས་ རྒལ་བ་ -ར་ གྱུར་ ཏེ་ །

source: He crossed it in such a way that he does not see this shore or the other shore of tathatā.
bo: ཇི་ལྟར་ དེ་བཞིན་ཉིད་ ཀྱི་ ཚུ་རོལ་ ཡང་ཡང་ དག་པ་ -ར་ རྗེས་སུ་ མི་ མཐོང་ ། ཕ་རོལ་ ཡང་ཡང་ དག་པ་ -ར་ རྗེས་སུ་ མི་ མཐོང་བ་ དེ་ལྟར་ ཆུ་བོ་ ལས་ རྒལ་ ཏོ་ །

source: Thus he is called the Tathāgata.
bo: དེ་ -འི་ ཕྱིར་ དེ་བཞིན་ གཤེགས་པ་ ཞེས་ བྱ་ -འོ་ ། །

source: Therefore, the Tathāgata realized all dharmas to be free from this shore or the other shore.
bo: དེ་ལྟར་ དེ་བཞིན་ གཤེགས་པ་ -ས་ ཚུ་རོལ་ དང་ ཕ་རོལ་ དང་ བྲལ་བ་ -འི་ ཆོས་ ཐམས་ཅད་ མངོན་པར་ རྫོགས་པ་ -ར་ བྱང་ཆུབ་ སྟེ་ ། །

source: “Awakening, Mañjuśrī, is without sign or reference point.
bo: འཇམ་དཔལ་ བྱང་ཆུབ་ ནི་ མཚན་མ་ མེད་པ་ ཉིད་ དང་ ། དམིགས་པ་ མེད་པ་ ཉིད་ ཡིན་ ཏེ་ །

source: In that respect, what is signlessness, and what is the lack of reference point?
bo: དེ་ ལ་ མཚན་མ་ མེད་པ་ ཉིད་ ནི་ གང་ ། དམིགས་པ་ མེད་པ་ ཉིད་ ནི་ གང་ཞེ་ན་ །

source: “That the eye-consciousness does not perceive, Mañjuśrī, is signlessness.
bo: འཇམ་དཔལ་ མིག་ གི་ རྣམ་པ་ -ར་ ཤེས་པ་ མི་ དམིགས་པ་ ནི་ མཚན་མ་ མེད་པ་ ཉིད་ ཡིན་ ནོ་ ། །

source: That form is not seen is the lack of reference point.
bo: གཟུགས་ ཡང་དག་པ་ -ར་ རྗེས་སུ་ མི་ མཐོང་བ་ ནི་ དམིགས་པ་ མེད་པ་ ཉིད་ ཡིན་ ནོ་ ། །

source: “That the ear-consciousness does not perceive is signlessness.
bo: རྣ་བ་ -འི་ རྣམ་པ་ -ར་ ཤེས་པ་ ནི་ དམིགས་པ་ ནི་ མཚན་མ་ མེད་པ་ ཉིད་ ཡིན་ ནོ་ ། །

source: That sounds are not heard is the lack of reference point.
bo: སྒྲ་ མཉན་ དུ་ མེད་པ་ ནི་ དམིགས་པ་ མེད་པ་ ཉིད་ ཡིན་ ནོ་ ། །

source: “That the nose-consciousness does not perceive is signlessness.
bo: སྣ་ -འི་ རྣམ་པ་ -ར་ ཤེས་པ་ མི་ དམིགས་པ་ ནི་ མཚན་མ་ མེད་པ་ ཉིད་ ཡིན་ ནོ་ ། །

source: That smells are not smelt is the lack of reference point.
bo: དྲི་ བསྣམ་ དུ་ མེད་པ་ ནི་ དམིགས་པ་ མེད་པ་ ཉིད་ ཡིན་ ནོ་ ། །

source: “That the tongue-consciousness does not perceive is signlessness.
bo: ལྕེ་ -འི་ རྣམ་པ་ -ར་ ཤེས་པ་ མི་ དམིགས་པ་ ནི་ མཚན་མ་ མེད་པ་ ཉིད་ ཡིན་ ནོ་ ། །

source: “That the body-consciousness does not perceive is signlessness.
bo: ལུས་ ཀྱི་ རྣམ་པ་ -ར་ ཤེས་པ་ མི་ དམིགས་པ་ ནི་ མཚན་མ་ མེད་པ་ ཉིད་ ཡིན་ ནོ་ ། །

source: That touchable things are not touched is the lack of reference point.
bo: རེག་བྱ་ རེག་པ་ -ར་ བྱ་བ་ མེད་པ་ ནི་ དམིགས་པ་ མེད་པ་ ཉིད་ ཡིན་ ནོ་ ། །

source: “That the mind-consciousness does not perceive is signlessness.
bo: ཡིད་ ཀྱི་ རྣམ་པ་ -ར་ ཤེས་པ་ མི་ དམིགས་པ་ ནི་ མཚན་མ་ མེད་པ་ ཉིད་ ཡིན་ ནོ་ ། །

source: That dharmas are not cognized is the lack of reference point.
bo: ཆོས་ རྣམས་ རྣམ་པ་ -ར་ ཤེས་པ་ -ར་ བྱར་མེད་པ་ ནི་ དམིགས་པ་ མེད་པ་ ཉིད་ ཡིན་ ནོ་ ། །

source: “This, Mañjuśrī, is the scope of the noble ones.
bo: འཇམ་དཔལ་ དེ་ ནི་ འཕགས་པ་ རྣམས་ ཀྱི་ སྤྱོད་ཡུལ་ ཡིན་ ཏེ

source: That which is not the scope of the three realms, Mañjuśrī, is the scope of the noble ones.
bo: འཇམ་དཔལ་ གང་ ཁམས་ གསུམ་པ་ -འི་ སྤྱོད་ཡུལ་ མ་ཡིན་པ་ དེ་ ནི་ འཕགས་པ་ རྣམས་ ཀྱི་ སྤྱོད་ཡུལ་ ཡིན་ ནོ་ ། །

source: “Awakening, Mañjuśrī, is not past, not future, not present.
bo: འཇམ་དཔལ་ བྱང་ཆུབ་ ནི་ འདས་པ་ མ་ ཡིན་ ། མ་འོངས་པ་ མ་ ཡིན་ ། ད་ལྟར་ བྱུང་བ་ མ་ ཡིན་ ཏེ་ ། །

source: That flavors are not tasted is the lack of reference point.
bo: རོ་མྱང་ དུ་ མེད་པ་ ནི་ དམིགས་པ་ མེད་པ་ ཉིད་ ཡིན་ ནོ་ །

source: It is the same in the three times, and is cut off from the three spheres.
bo: དུས་གསུམ་ མཉམ་པ་ འཁོར་གསུམ་ ཡོངས་སུ་ ཆད་པ་ ཡིན་ ནོ་ ། །

source: In that respect, Mañjuśrī, what does it mean to be cut off from the three spheres?
bo: འཇམ་དཔལ་ དེ་ ལ་ འཁོར་གསུམ་ ཡོངས་སུ་ ཆད་པ་ གང་ཞེ་ན་ །

source: The mind in the past is not perceived.
bo: འདས་པ་ ལ་ སེམས་ མི་ འཇུག་པ་ དང་ །

source: Consciousness does not run toward the future.
bo: མ་འོངས་པ་ ལ་ རྣམ་པ་ -ར་ ཤེས་པ་ མི་ རྒྱུག་པ་ དང་ །

source: Consciousness does not run toward the future.
bo: མ་འོངས་པ་ ལ་ རྣམ་པ་ -ར་ ཤེས་པ་ མི་ རྒྱུག་པ་ དང་ །

source: Mental placement does not occur in the present.
bo: ད་ལྟར་ བྱུང་བ་ ལ་ ཡིད་ ལ་ བྱེད་པ་ མི་ འབྱུང་བ་ གང་ཡིན་པ་ སྟེ་ །

source: One who does not abide in mind, mentality, and consciousness does not form mental constructs or concepts.
bo: རྣམ་པ་ -ར་ ཤེས་པ་ ལ་ མི་ གནས་ ཤིང་ རྟོག་པ་ -ར་ མི་ བྱེད་ རྣམ་པ་ -ར་ རྟོག་པ་ -ར་ མི་ བྱེད་ དོ་ །

source: one does not elaborate about the present.
bo: དེ་ལྟར་ བྱུང་བ་ ལ་ འཕྲོ་བ་ -ར་ མི་ བྱེད་ དོ་ ། །

source: Not forming mental constructs or concepts, one does not create the past
bo: རྟོག་པ་ -ར་ མི་ བྱེད་ རྣམ་པ་ -ར་ རྟོག་པ་ -ར་ མི་ བྱེད་པ་ ནི་ འདས་པ་ ཡིད་ ལ་ མི་ བྱེད་ །

source: does not think of the future;
bo: མ་འོངས་པ་ ལ་ རློམ་སེམས་ སུ་ མི་ བྱེད་ ། །

source: “Awakening, Mañjuśrī, is bodiless and unproduced.
bo: འཇམ་དཔལ་ བྱང་ཆུབ་ ནི་ ལུས་མེད་པ་ ཉིད་ དང་ ། འདུས་མ་བྱས་པ་ ཉིད་ ཡིན་ ཏེ་ །

source: In that respect, Mañjuśrī, bodilessness is what cannot be cognized by the eye consciousness,
bo: འཇམ་དཔལ་ དེ་ ལ་ ལུས་མེད་པ་ ཉིད་ ནི་ མིག་ གི་ རྣམ་པ་ -ར་ ཤེས་པ་ -ས་ རྣམ་པ་ -ར་ ཤེས་པ་ -ར་ བྱ་བ་ མ་ཡིན་པ་ དང་ །

source: what cannot be cognized by the ear, nose, tongue, body, or mind consciousness.
bo: རྣ་བ་ དང་ སྣ་ དང་ ལྕེ་ དང་ ལུས་ དང་ ། ཡིད་ ཀྱི་ རྣམ་པ་ -ར་ ཤེས་པ་ -ས་ རྣམ་པ་ -ར་ ཤེས་པ་ -ར་ བྱ་བ་ མ་ཡིན་པ་ གང་ཡིན་པ་ -འོ་ ། །

source: Mañjuśrī, that which cannot be cognized by mind, mentality, and consciousness is unproduced.
bo: འཇམ་དཔལ་ སེམས་ དང་ ཡིད་ དང་ རྣམ་པ་ -ར་ ཤེས་པ་ -ས་ རྣམ་པ་ -ར་ ཤེས་པ་ -ར་ བྱ་བ་ མ་ཡིན་པ་ གང་ཡིན་པ་ དེ་ཉིད་ འདུས་མ་བྱས་པ་ ཉིད་ ཡིན་ ཏེ་ །

source: no abiding,
bo: གནས་པ་ མེད་པ་ དང་ །

source: The unproduced is explained this way: where there is no arising,
bo: འདུས་མ་བྱས་པ་ ཉིད་ ཅེས་བྱ་བ་ ནི་ གང་ ལ་ སྐྱེ་བ་ མེད་པ་ དང་ །

source: no passing away,
bo: འཇིག་པ་ མེད་པ་ -འོ་ ། །

source: that is called the unproduced purified of the three spheres.
bo: དེ་ ནི་ འཁོར་གསུམ་ ཡོངས་སུ་ དག་པ་ འདུས་མ་བྱས་པ་ ཡིན་ ཏེ་ ། །

source: And why?
bo: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན་ །

source: The co-produced should be understood just like the unproduced.
bo: འདུས་མ་བྱས་པ་ ཇི་ལྟ་བ་ ཁོ་ན་ བཞིན་ དུ་ འདུས་བྱས་ ཀྱང་ དེ་ལྟ་ བུ་ ཁོ་ན་ ཡིན་པ་ -ར་ རྟོགས་པ་ -ར་ བྱ་ -འོ་ །

source: The essence of all dharmas is no-essence;
bo: ཆོས་ ཐམས་ཅད་ ཀྱི་ ངོ་བོ་ ཉིད་ གང་ཡིན་པ་ དེ་ ནི་ ངོ་བོ་ ཉིད་ མེད་པ་ སྟེ་ །

source: in that respect, there is no duality.
bo: དེ་ ལ་ ནི་ གཉིས་ སུ་ མེད་པ་ -འི་ ཕྱིར་ རོ་ ། །

source: “Awakening, Mañjuśrī, is a basis of non-division.
bo: འཇམ་དཔལ་ བྱང་ཆུབ་ དེ་ ནི་ དབྱེ་ -ར་ མེད་པ་ -འི་ གཞི་ ཡིན་ ཏེ་ །

source: In that respect, what is non-division,
bo: དེ་ ལ་ དབྱེ་ -ར་ མེད་པ་ ནི་ གང་ །

source: hat is the basis?
bo: གཞི་ ནི་ གང་ཞེ་ན་ །

source: No-notion is non-division.
bo: མིང་མེད་པ་ ནི་ དབྱེ་ -ར་ མེད་པ་ -འོ་ ། །

source: The tathatā is the basis.
bo: དེ་བཞིན་ཉིད་ ནི་ གཞི་ -འོ་ ། །

source: No-ground-to-stand-upon is non-division.
bo: གནས་ མེད་པ་ ནི་ དབྱེ་ -ར་ མེད་པ་ -འོ་ ། །

source: The dharmadhātu is the basis.
bo: ཆོས་ ཀྱི་ དབྱིངས་ ནི་ གཞི་ -འོ་ ། །

source: Non-multiplicity is non-division.
bo: ཐ་དད་པ་ ཉིད་ མེད་པ་ ནི་ དབྱེ་ -ར་ མེད་པ་ -འོ་ ། །

source: Emptiness is non-division.
bo: སྟོང་པ་ཉིད་ ནི་ དབྱེ་ -ར་ མེད་པ་ -འོ་ ། །

source: The true limit is the basis.
bo: ཡང་དག་པ་ -འི་ མཐའ་ ནི་ གཞི་ -འོ་ ། །

source: Non-apprehension is non-division.
bo: དམིགས་པ་ མེད་པ་ ནི་ དབྱེ་ -ར་ མེད་པ་ -འོ་ ། །

source: Non-movement is the basis.
bo: གཡོ་བ་ མེད་པ་ ནི་ གཞི་ -འོ་ ། །

source: No-sign is the basis.
bo: མཚན་མ་ མེད་པ་ ནི་ གཞི་ -འོ་ ། །

source: Non-deliberation is non-division.
bo: རྣམ་པ་ -ར་ རྟོག་པ་ མེད་པ་ ནི་ དབྱེ་ -ར་ མེད་པ་ -འོ་ ། །

source: No-wish is the basis.
bo: སྨོན་པ་ མེད་པ་ ནི་ གཞི་ -འོ་ །

source: Being without a sentient being is the basis.
bo: སེམས་ཅན་ མེད་པ་ ནི་ གཞི་ -འོ་ ། །

source: Non-essence of a sentient being is non-division.
bo: སེམས་ཅན་ གྱི་ ངོ་བོ་ ཉིད་ མེད་པ་ ནི་ དབྱེ་ -ར་ མེད་པ་ -འོ་ ། །

source: Space is the basis.
bo: ནམ་མཁའ་ ནི་ གཞི་ -འོ་ ། །

source: Non-perception is non-division.
bo: དམིགས་ སུ་ མེད་པ་ ནི་ དབྱེ་ -ར་ མེད་པ་ -འོ་ ། །

source: Non-arising is the basis.
bo: སྐྱེ་བ་ མེད་པ་ ནི་ གཞི་ -འོ་ ། །

source: Non-cessation is non-division.
bo: འགག་པ་ མེད་པ་ ནི་ དབྱེ་ -ར་ མེད་པ་ -འོ་ ། །

source: The unproduced is the basis.
bo: འདུས་མ་བྱས་ ནི་ གཞི་ -འོ་ ། །

source: The unproduced is the basis.
bo: འདུས་མ་བྱས་ ནི་ གཞི་ -འོ་ ། །

source: No moving about is non-division.
bo: སྤྱོད་པ་ མེད་པ་ ནི་ དབྱེ་ -ར་ མེད་པ་ -འོ་ ། །

source: Awakening is the basis.
bo: བྱང་ཆུབ་ ནི་ གཞི་ -འོ་ ། །

source: Pacification is non-division.
bo: ཉེ་བར་ ཞི་བ་ ནི་ དབྱེ་ -ར་ མེད་པ་ -འོ་ ། །

source: Nirvāṇa is the basis.
bo: མྱ་ངན་ ལས་ འདས་པ་ ནི་ གཞི་ -འོ་ ། །

source: Non-development is non-division;
bo: མངོན་པར་ འགྲུབ་པ་ མེད་པ་ ནི་ དབྱེ་ -ར་ མེད་པ་ -འོ་ ། །

source: non-birth is the basis.
bo: སྐྱེ་བ་ མེད་པ་ ནི་ གཞི་ -འོ་ ། །

source: And why?
bo: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན་ ། །

source: “Awakening, Mañjuśrī, is not realized by the body
bo: འཇམ་དཔལ་ བྱང་ཆུབ་ ནི་ ལུས་ ཀྱིས་ མངོན་པར་ རྫོགས་པ་ -ར་ བྱང་ཆུབ་པ་ -ར་ མི་ འགྱུར་ ཏེ་ །

source: nor by the mind.
bo: སེམས་ ཀྱིས་ ཀྱང་ མ་ ཡིན་ ནོ་ །

source: The body, Mañjuśrī, is inert, motionless, and insentient.
bo: འཇམ་དཔལ་ ལུས་ ནི་ བེམས་པོ་ གཡོ་བ་ མེད་པ་ སེམས་པ་ མེད་པ་ སྟེ་ །

source: It is similar and comparable to grass, logs of wood, walls, or clay.
bo: རྩྭ་ དང་ ། རྩིག་པ་ དང་ ། ཤིང་ དང་ བོང་བ་ དང་ ། གཟུགས་བརྙན་ ལྟ་བུ་ ཡིན་ ལ་ །

source: “The mind, on the other hand, can be compared to an illusion.
bo: སེམས་ ཀྱང་ སྒྱུ་མ་ ལྟ་བུ་ སྟེ་ །

source: It is hollow, void, unreal, and unproduced.
bo: གསོག་ དང་ གསོབ་ དང་ ། ཡང་དག་པ་ མ་ཡིན་པ་ དང་ ། འདུས་མ་བྱས་པ་ ཡིན་པ་ -འི་ ཕྱིར་ རོ་ ། །

source: Mañjuśrī, to realize the body and mind in this manner is explained as awakening.
bo: འཇམ་དཔལ་ གང་ གིས་ ལུས་ དང་སེམས་ དེ་ལྟར་ རྟོགས་པ་ དེ་ ནི་ བྱང་ཆུབ་ ཅེས་ བྱ་ སྟེ་ །

source: This is based on conventional usage, but it is not in the ultimate sense.
bo: འཇམ་དཔལ་ དེ་ཡང་ ཐ་སྙད་ ལ་ བརྟེན་པ་ ཡིན་ གྱི་ དོན་དམ་པ་ -ར་ ནི་ མ་ ཡིན་ ནོ་ །

source: Mañjuśrī, awakening cannot be explained in terms of the body, the mind, or dharma, non-dharma, real, unreal, truth, or falsity.
bo: འཇམ་དཔལ་ བྱང་ཆུབ་ ནི་ ལུས་ དང་སེམས་ དང་ ཆོས་ དང་ ཆོས་མ་ ཡིན་པ་ དང་ ། ཡང་དག་པ་ དང་ ཡང་དག་པ་ མ་ཡིན་པ་ དང་ ། བདེན་པ་ དང་ བརྫུན་པ་ -ས་ བརྗོད་པ་ -ར་ བྱ་བ་ མ་ཡིན་པ་ -འི་ ཕྱིར་ རོ་ ། །

source: “Awakening, Mañjuśrī, cannot be expressed through any dharma.
bo: འཇམ་དཔལ་ བྱང་ཆུབ་ ནི་ ཆོས་ ཐམས་ཅད་ ཀྱིས་ བརྗོད་པ་ -ར་ བྱ་བ་ མ་ཡིན་པ་ སྟེ་ །

source: Mañjuśrī, awakening does not have the slightest location that allows it to enter conventional usage.
bo: འཇམ་དཔལ་ བྱང་ཆུབ་ ལ་ ནི་ གང་ གིས་ ཚིག་ དང་ ཐ་སྙད་ འཇུག་པ་ -ར་ འགྱུར་བ་ -འི་ གནས་ ཅུང་ཟད་ ཀྱང་ མེད་པ་ -འི་ ཕྱིར་ རོ་ ། །

source: In the same way, Mañjuśrī, awakening has no location;
bo: འཇམ་དཔལ་ དེ་བཞིན་ དུ་ བྱང་ཆུབ་ ཀྱང་ གནས་ མེད་པ་ །

source: space has no location;
bo: ནམ་མཁའ་ ནི་ གནས་ མེད་པ་ །

source: it is unproduced,
bo: འདུས་མ་བྱས་པ་ །

source: non-arisen,
bo: མ་ སྐྱེས་པ་ །

source: unceasing,
bo: མ་ འགགས་པ་ །

source: cannot be expressed.
bo: བརྗོད་པ་ -ར་ བྱ་བ་ མ་ཡིན་པ་ -འོ་ ། །

source: Mañjuśrī, when searching for the real space, it cannot be explained through any dharma.
bo: འཇམ་དཔལ་ འདི་ལྟ་སྟེ་ དཔེར་ན་ ། ཡང་དག་པ་ -ར་ ཡོངས་སུ་ ཚོལ་བ་ ན་ ཆོས་ ཐམས་ཅད་ ཀྱིས་ བརྗོད་པ་ -ར་ བྱ་བ་ མ་ཡིན་པ་ དེ་བཞིན་ དུ་ །
