Repository: OpenPecha-Data/0fbd31ce377b49a79da3bbcf2402ad48
Catalog: *.po
Languages: bo

source: Thus have I heard, at one time,
bo: འདི་སྐད་ བདག་ གིས་ ཐོས་པ་ དུས་ གཅིག་ ན་ །

source: the Bhagavat was dwelling on the Vulture Peak Mountain in Rājgir, on a summit of infinite gems, in the Womb of Dharmadhātu Palace,
bo: བཅོམ་ལྡན་འདས་ རྒྱལ་པོ་ -འི་ ཁབ་ ན་ བྱ་རྒོད་ ཕུང་པོ་ -འི་ རི་ -འི་ རྩེ་མོ་ བཞི་ -འི་ ཤིང་ དྲུང་ ཆོས་ ཀྱི་ དབྱིངས་ ཀྱི་ སྙིང་པོ་ -འི་ ཁང་ བཟངས་ ན་ །

source: together with a great assembly of twenty-five thousand monks. All of them were arhats who had exhausted their outflows.
bo: འདི་ལྟ་སྟེ་ ། ཉན་ཐོས་ ཆེན་པོ་ བརྒྱད་ དང་ ཀུན་ཤེས་ ཀོོཎྜི་ ནྱ་ ལ་སོགས་པ་ དགེ་སློང་ ཉི་ཁྲི་ ལྔ་ སྟོང་ གི་ དགེ་སློང་ གི་ དགེ་འདུན་ ཆེན་པོ་ ཐམས་ཅད་ ཀྱང་ དགྲ་བཅོམ་པ་ ཟག་པ་ ཟད་པ་ །

source: They were without afflictions and controlled.
bo: ཉོན་མོངས་པ་ མེད་པ་ དབང་ དང་ ལྡན་པ་ -ར་ གྱུར་པ་ །

source: Their minds were perfectly liberated,
bo: སེམས་ ཤིན་ཏུ་ རྣམ་པ་ -ར་ གྲོལ་བ་ །

source: and their wisdom was perfectly free.
bo: ཤེས་རབ་ ཤིན་ཏུ་ རྣམ་པ་ -ར་ གྲོལ་བ་ །

source: They were knowledgeable great elephants who had accomplished what needed to be done.
bo: ཅང་ཤེས་པ་ གླང་པོ་ ཆེན་པོ་ བྱ་བ་ བྱས་པ་ ། བྱེད་པ་ བྱས་པ་ །

source: They had laid down their burden and fulfilled their own benefit.
bo: ཁུར་ བོར་བ་ བདག་ གི་ དོན་ རྗེས་སུ་ ཐོབ་པ་ །

source: They had destroyed the bonds of existence and,
bo: སྲིད་པ་ ཀུན་ ཏུ་ སྦྱོར་བ་ ཡོངས་སུ་ ཟད་པ་ །

source: thanks to their correct knowledge, their minds were perfectly liberated.
bo: ཡང་དག་པ་ -འི་ ཤེས་པ་ -ས་ སེམས་ ཤིན་ཏུ་ རྣམ་པ་ -ར་ གྲོལ་བ་ །

source: youthful Mañjuśrī,
bo: འཇམ་དཔལ་ གཞོན་ནུ་ -ར་ གྱུར་པ་ དང་ །

source: Dhanaśrī,
bo: ནོར་ དཔལ་ དང་ །

source: Buddhiśrī,
bo: སངས་རྒྱས་ དཔལ་ དང་ །

source: Bhaiṣajyarāja, and
bo: སྨན་ གྱི་ རྒྱལ་པོ་ དང་ །

source: Bhaiṣajya­samudgata.
bo: སྨན་ ཡང་དག་ འཕགས་

source: All of them were turning the Dharma wheel that does not turn back.
bo: ཕྱིར་ མི་ ལྡོག་པ་ -འི་ ཆོས་ ཀྱི་ འཁོར་ལོ་ རབ་ཏུ་ བསྐོར་བ་ ཐམས་ཅད་ ཀྱང་

source: They were skilled in inquiring about the vaipulya sūtras of the Heap of Jewels and
bo: ཤིན་ཏུ་ རྒྱས་པ་ -འི་ སྡེ་ དཀོན་མཆོག་ བརྩེགས་པ་ -འི་ མདོ་ ཡོངས་སུ་ ཞུ་བ་ ལ་ མཁས་པ་ །

source: and had obtained the level called Cloud of Dharma.
bo: ཐམས་ཅད་ ཀྱང་ ས་བཅུ་པ་ ཆོས་ ཀྱི་ སྤྲིན་ ཐོབ་པ་ །

source: In terms of wisdom, they were like Sumeru,
bo: ཐམས་ཅད་ ཀྱང་ ཤེས་རབ་ ཀྱིས་ རི་རབ་ ལྟར་ གྱུར་པ་ །

source: and all of them had thoroughly cultivated the dharmas of emptiness, no sign, no wish, no arising, no birth, and no existence.
bo: ཐམས་ཅད་ ཀྱང་ སྟོང་པ་ཉིད་ དང་ ། མཚན་མ་ མེད་པ་ དང་ ། སྨོན་པ་ མེད་པ་ དང་ ། སྐྱེ་བ་ མེད་པ་ དང་ ། འབྱུང་བ་ མེད་པ་ དང་ ། དངོས་པོ་ མེད་པ་ -འི་ སེམས་ སུ་ བསྒོམས་པ་ -འི་ སེམས་ དང་ ལྡན་པ་ །

source: The greatly profound Dharma appeared to them ,
bo: ཐམས་ཅད་ ཀྱང་ ཆོས་ ཟབ་མོ་ -འི་ སྣང་བ་ ཆེན་པོ་ ཐོབ་པ་ །

source: and they had the postures of the tathāgatas.
bo: ཐམས་ཅད་ ཀྱང་ དེ་བཞིན་ གཤེགས་པ་ -འི་ སྤྱོད་ལམ་ དང་ ལྡན་པ་ །

source: In other world spheres, they had been sent out by quintillions of tathāgatas.
bo: འཇིག་རྟེན་ གྱི་ ཁམས་ གཞན་ དང་ གཞན་དག་ གི་ དེ་བཞིན་ གཤེགས་པ་ བྱེ་བ་ ཁྲག་ཁྲིག་ བརྒྱ་ སྟོང་ དག་ གིས་ ཀུན་ ནས་ བཀྱེ་བ་ -འི་

source: All of them were fully clairvoyant and well settled in the essential nature of all dharmas.
bo: ཐམས་ཅད་ ཀྱང་ མངོན་པར་ ཤེས་པ་ ཡོངས་སུ་ སྦྱངས་པ་ -ས་ ངེས་པར་ འབྱུང་བ་ ཐམས་ཅད་ ཀྱི་ ངོ་བོ་ ཉིད་ ཀྱི་ རང་བཞིན་ ལ་ གནས་པ་ ཤ་སྟག་

source: At that time,
bo: དེ་ -འི་ ཚེ་ ན་

source: the Bhagavat thought, “To generate great swiftness, strength, impetus, and stamina in the bodhisattva great beings,
bo: བཅོམ་ལྡན་འདས་ འདི་ སྙམ་ དུ་ བདག་ གིས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ རྣམས་ ཀྱི་ མྱུར་བ་ དང་ ། སྟོབས་ དང་ ཤུགས་ ཆེན་པོ་ ཡང་དག་པ་ -ར་ བསྐྱེད་པ་ -ར་ བྱ་བ་ -འི་ ཕྱིར་ །

source: I shall give a Dharma discourse.
bo: ཆོས་ ཀྱི་ གཏམ་ བརྗོད་པ་ -ར་ བྱ་ ཞིང་ །

source: From as many world spheres as there are grains of sand in the river Ganges,
bo: འཇིག་རྟེན་ གྱི་ ཁམས་ གང་ གཱའི་ ཀླུང་ གི་ བྱེ་མ་ སྙེད་ དག་ ནས་ །

source: I shall cause splendorous bodhisattva great beings to assemble.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ གཟི་བརྗིད་ ཆེ་བ་ གཟི་བརྗིད་ ཆེ་བ་ དག་ བསྡུ་བ་ -ར་ ཡང་ བྱ་ །

source: Hence, I will display a sign to show that there is to be a great teaching of the Dharma.
bo: བདག་ གིས་ ཆོས་ བསྟན་པ་ ཆེན་པོ་ -འི་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ བཤད་པ་ -འི་ ལྟས་ སྣང་བ་ ཆེན་པོ་ -འང་ བསྟན་པ་ -ར་ བྱ་ །

source: I shall cause a great light, so that bodhisattva great beings shall come to me and ask for a great Dharma teaching.”
bo: བདག་ གིས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ རྣམས་ ལྷགས་ ནས་ བདག་ ལ་ ཆོས་ བསྟན་པ་ ཆེན་པོ་ ཡོངས་སུ་ ཞུ་བ་ -ར་ འགྱུར་བ་ -ར་ ཡང་ བྱ་ -འོ་ སྙམ་ དུ་ དགོངས་ སོ་ །

source: the Bhagavat illuminated the ten directions with great clouds of light rays that shone in as many worlds as there are atoms of dust in the great trichiliocosm—an uncountable and inconceivable number.
bo: ཕྱོགས་ བཅུ་ -འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་པོ་ -འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་ ཅིང་ བསམ་ གྱིས་ མི་ ཁྱབ་པ་ དག་ གི་ རྡུལ་ ཕྲ་རབ་ ཀྱི་ རྡུལ་ སྙེད་ དག་ འོད་ཟེར་ ཆེན་པོ་ -འི་ སྤྲིན་ དག་ གིས་ སྣང་བ་ -ར་ མཛད་ དོ་ །

source: as many bodhisattva great beings as there are atoms of dust in ten ineffable quintillion buddhafields approached him from all the ten directions;
bo: ཕྱོགས་ བཅུ་ -འི་ ཕྱོགས་ རེ་རེ་ ནས་ ཀྱང་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ སངས་རྒྱས་ ཀྱི་ ཞིང་ བྱེ་བ་ ཁྲག་ཁྲིག་ ཕྲག་ འབུམ་ཕྲག་ བརྗོད་ དུ་ མེད་པ་ བཅུ་ -འི་ རྡུལ་ ཕྲ་རབ་ ཀྱི་ རྡུལ་ སྙེད་ དག་ ལྷགས་ སོ་ །

source: present with the Bhagavat were seventy-two quintillion bodhisattvas,
bo: བྱང་ཆུབ་ སེམས་དཔའ་ བྱེ་བ་ ཁྲག་ཁྲིག་ ཕྲག་ བདུན་ཅུ་ རྩ་ གཉིས་ ཐམས་ཅད་ ཀྱང་

source: each and every bodhisattva great being arrived with exceptional feats beyond imagination.
bo: དེ་དག་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ རེ་རེ་ ཡང་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ རྣམ་པ་ -ར་ འཕྲུལ་པ་ བསམ་ གྱིས་ མི་ ཁྱབ་པ་ དག་ གིས་ འོངས་ ཏེ་ ལྷགས་ ནས་ ཀྱང་ །

source: They first performed a fitting, inconceivable worship of the Bhagavat,
bo: བཅོམ་ལྡན་འདས་ ལ་ ཚུལ་ དང་ འཐུན་པ་ -འི་ མཆོད་པ་ བསམ་ གྱིས་ མི་ ཁྱབ་པ་ དག་ བྱས་ ནས་ །

source: and then sat down in front of him on lotus seats that appeared through the force of their aspirations.
bo: བཅོམ་ལྡན་འདས་ ཀྱི་ སྤྱན་སྔ་ -ར་ རང་རང་ གི་ སྨོན་ལམ་ གྱི་ སྟོབས་ ལས་ བྱུང་བ་ -འི་ པད་མ་ -འི་ སྟན་ དག་ ལ་ འཁོད་ དེ་ །

source: They stayed still, looking at the Bhagavat without blinking.
bo: བཅོམ་ལྡན་འདས་ ལ་ མིག་ མི་ འཛུམས་པ་ -ར་ ལྟ་ ཞིང་ སྡོད་པ་ -ར་ གྱུར་ ཏོ་ །

source: A lion throne within a great, jeweled lotus then appeared at the center of the Womb of Dharmadhātu Palace. It was an uncountable number of leagues in width, and of unprecedented height.
bo: ཆོས་ ཀྱི་ དབྱིངས་ ཀྱི་ སྙིང་པོ་ -འི་ ཁང་ བཟངས་ དེ་ -འི་ དབུས་ སུ་ སེང་གེ་ -འི་ ཁྲི་ ནོར་བུ་ རིན་པོ་ཆེ་ ཆེན་པོ་ -འི་ པད་མ་ -འི་ སྙིང་པོ་ ཅན་ རྒྱ་ -ར་ དཔག་ཚད་ བྱེ་བ་ ཕྲག་ གྲངས་མེད་པ་ ཡོད་པ་ །

source: It was made of gems and jewels sparkling in every way,
bo: རིམ་གྱིས་ མཐོ་བ་ ནོར་བུ་ རིན་པོ་ཆེ་ ཀུན་ ཏུ་ སྣང་བ་ ལས་ གྲུབ་པ་ །

source: with lightning for lamps, and a surrounding railing made of gems and jewels.
bo: ནོར་བུ་ རིན་པོ་ཆེ་ གློག་ གི་ སྒྲོན་མ་ -འི་ ཁ་ཁྱེར་ གྱིས་ ཡོངས་སུ་ བསྐོར་བ་ །

source: Its staffs were of gems and jewels of inconceivable brilliance,
bo: ནོར་བུ་ རིན་པོ་ཆེ་ འོད་ བསམ་ གྱིས་ མི་ ཁྱབ་པ་ -འི་ ལན་ཀན་ གྱིས་ ཡོངས་སུ་ བསྐོར་བ་ །

source: and incomparable gems and jewels enclosed it.
bo: ནོར་བུ་ རིན་པོ་ཆེ་ དཔེ་མེད་པ་ -ས་ ཡོངས་སུ་ བསྐོར་བ་ །

source: Jewel garlands splendid beyond comparison beautified the throne,
bo: ནོར་བུ་ རིན་པོ་ཆེ་ སྣང་བ་ དཔེ་ ལས་ འདས་པ་ -འི་ ཕྲེང་བ་ -ས་ མཛེས་པ་ -ར་ བྱས་པ་ །

source: studded with many types of precious gems.
bo: ནོར་བུ་ རིན་པོ་ཆེ་ རྣམ་པ་ སྣ་ཚོགས་ སྤྲས་པ་ །

source: It was hung about with raised parasols, standards, and flags.
bo: གདུགས་ དང་ རྒྱལ་མཚན་ དང་ ། བ་དན་ བསྒྲེང་བ་ དང་ ལྡན་པ་ ཞིག་ བྱུང་བ་ -ར་ གྱུར་ ཏོ་ །

source: From above the lion throne within the great lotus of gems and jewels, ten innumerable quintillions of light rays now issued forth
bo: སེང་གེ་ -འི་ ཁྲི་ ནོར་བུ་ རིན་པོ་ཆེ་ ཆེན་པོ་ -འི་ སྙིང་པོ་ ཅན་ དེ་ -འི་ ཁོ་ར་ ཁོར་ཡུག་ ནས་ འོད་ཟེར་ གྲངས་མེད་པ་ བྱེ་བ་ ཁྲག་ཁྲིག་ འབུམ་ཕྲག་ བཅུ་ བྱུང་ སྟེ་ །

source: in all directions and illumined the very many world spheres in the ten directions by their great brightness.
bo: འོད་ཟེར་ དེ་དག་ གིས་ ཕྱོགས་ བཅུ་ -འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ གཞན་ དང་ གཞན་དག་ སྣང་བ་ ཆེན་པོ་ -ས་ ཁྱབ་པ་ -ར་ གྱུར་ ཏོ་ ། །

source: And at that very time, from each and every one of the ten directions, gods,
bo: ཡང་ དེ་ -འི་ ཚེ་ ན་ ཕྱོགས་ བཅུ་ -འི་ ཕྱོགས་ རེ་རེ་ ནས་ ལྷ་ དང་ །

source: nāgas,
bo: ཀླུ་ དང་ །

source: yakṣas,
bo: གནོད་སྦྱིན་ དང་ །

source: gandharvas,
bo: དྲི་ཟ་ དང་ །

source: demigods,
bo: ལྷ་མ་ ཡིན་ དང་ །

source: garuḍa,
bo: ནམ་མཁའ་ ལྡིང་ དང་ །

source: kinnaras,
bo: མི་ -འམ་ ཅི་ དང་ །

source: great serpents,
bo: ལྟོ་འཕྱེ་ ཆེན་པོ་ དང་ །

source: śakras,
bo: བརྒྱ་བྱིན་ དང་ །

source: brahmās,
bo: ཚངས་པ་ དང་ །

source: and world protectors arrived, as many as there are atoms of dust in the ineffable quintillion buddhafields.
bo: འཇིག་རྟེན་ སྐྱོང་བ་ སངས་རྒྱས་ ཀྱི་ ཞིང་ བྱེ་བ་ ཁྲག་ཁྲིག་ འབུམ་ཕྲག་ བརྗོད་ དུ་ མེད་པ་ བཅུ་ -འི་ རྡུལ་ ཕྲ་རབ་ ཀྱི་ རྡུལ་ སྙེད་ དག་ ཀྱང་ ལྷགས་པ་ -ར་ གྱུར་ ཏེ་ །

source: Some of them arrived together with a quintillion apsaras, uncountable and beyond conception, singing and playing musical instruments while they sat in jeweled palaces.
bo: དེ་དག་ ལས་ ཁ་ཅིག་ ནི་ རིན་པོ་ཆེ་ -འི་ ཁང་པ་ བརྩེགས་པ་ དག་ ན་ འཁོད་ ལ་ ། ལྷ་ -འི་ བུ་མོ་ བྱེ་བ་ ཁྲག་ཁྲིག་ འབུམ་ཕྲག་ གྲངས་མེད་ ཅིང་ བསམ་ གྱིས་ མི་ ཁྱབ་པ་ གླུ་དབྱངས་ དང་ ། རོལ་མོ་ -འི་ སྒྲ་ འབྱིན་པ་ དག་ དང་ ལྷགས་ སོ་ ། །

source: Some arrived with palaces that were made of flowers,
bo: ཁ་ཅིག་ ནི་ མེ་ཏོག་ ལས་ བྱས་པ་ དག་ དང་ །

source: others with palaces were made of heaps of uragasāra sandalwood.
bo: ཁ་ཅིག་ ནི་ ཙན་དན་ སྦྲུལ་ གྱི་ སྙིང་པོ་ ལས་ བྱས་པ་ དག་ དང་ །

source: Some palaces were made of pearls, others of diamonds,
bo: ཁ་ཅིག་ ནི་ མུ་ཏིག་ ལས་ བྱས་པ་ དག་ དང་ ། ཁ་ཅིག་ ནི་ རྡོ་རྗེ་ ལས་ བྱས་པ་ དག་ དང་ །

source: and others still of gems and jewels that shone like diamonds.
bo: ཁ་ཅིག་ ནི་ ནོར་བུ་ རིན་པོ་ཆེ་ རྡོ་རྗེ་ ལྟར་ སྣང་བ་ ལས་ བྱས་པ་ དག་ དང་ །

source: Some were made of gold from the river Jāmbū,
bo: ཁ་ཅིག་ ནི་ འཛམ་བུ་ -འི་ ཆུ་བོ་ -འི་ གསེར་ ལས་ བྱས་པ་ དག་ དང་ །

source: and others were built with gems that shone in all colors.
bo: ཁ་ཅིག་ ནི་ ནོར་བུ་ རིན་པོ་ཆེ་ འོད་ ཐམས་ཅད་ ཡང་དག་པ་ -ར་ འདུས་པ་ ལས་ བྱས་པ་ དག་ དང་ །

source: Some were made of the vaśirāja gem and others of wish-fulfilling jewels.
bo: ཁ་ཅིག་ ནི་ ནོར་བུ་ རིན་པོ་ཆེ་ དབང་ གི་ རྒྱལ་པོ་ ལས་ བྱས་པ་ དག་ དང་ ། ཁ་ཅིག་ ནི་ ནོར་བུ་ རིན་པོ་ཆེ་ ཡིད་བཞིན་ གྱི་ ནོར་བུ་ ལས་ བྱས་པ་ དག་ དང་ །

source: Still other palaces were made of those gems worn by Śakra.
bo: ཁ་ཅིག་ ནི་ ནོར་བུ་ རིན་པོ་ཆེ་ བརྒྱ་བྱིན་ ཐོགས་པ་ ལས་ བྱས་པ་ དག་ དང་ །

source: Yet others arrived with uncountable, inconceivable quadrillions of apsaras, singing and playing musical instruments while they sat in palaces of great jewels, gems beaming uninterruptedly from the array of pure, ocean-ground jewels.
bo: ཁ་ཅིག་ ནི་ རྒྱ་མཚོ་ -འི་ རྟེན་ རྣམ་པ་ -ར་ དག་པ་ -འི་ རིན་པོ་ཆེ་ -འི་ བཀོད་པ་ སྟོང་ ལྟ་བུ་ ནོར་བུ་ རིན་པོ་ཆེ་ ཆེན་པོ་ ཀུན་ ནས་ འོད་ཟེར་ སྣང་བ་ ལས་ བྱས་པ་ -འི་ ཁང་པ་ བརྩེགས་པ་ དག་ ལ་ འཁོད་ ལ་ ། ལྷ་ -འི་ བུ་མོ་ བྱེ་བ་ ཁྲག་ཁྲིག་ འབུམ་ཕྲག་ གྲངས་མེད་ ཅིང་ བསམ་ གྱིས་ མི་ ཁྱབ་པ་ -འི་ གླུ་དབྱངས་ དང་ རོལ་མོ་ -འི་ སྒྲ་ འབྱིན་པ་ དག་ ལྷགས་ སོ་ ། །

source: As they arrived, they first worshipped the Bhagavat in an inconceivable, matchless, immeasurable, and limitless manner.
bo: ལྷགས་ ནས་ ཀྱང་ བཅོམ་ལྡན་འདས་ ལ་ བསམ་ གྱིས་ མི་ ཁྱབ་པ་ དང་ ། མཚུངས་པ་ མེད་པ་ དང་ ། གཞལ་ དུ་ མེད་པ་ དང་ ། དཔག་ ཏུ་ མེད་པ་ ལས་ ཀྱང་ ཤིན་ཏུ་ འདས་པ་ -འི་ མཆོད་པ་ བྱས་ ཏེ་ །

source: Then they arranged themselves on one side, on seats that manifested through their own aspirations.
bo: བཅོམ་ལྡན་འདས་ ཀྱི་ སྤྱན་སྔ་ -ར་ རང་རང་ གི་ སྨོན་ལམ་ གྱི་ སྟོབས་ ལས་ བྱུང་བ་ -འི་ སྟན་ དག་ ལ་ འཁོད་ ནས་ །

source: they stayed still, looking at the Bhagavat without blinking.
bo: བཅོམ་ལྡན་འདས་ ལ་ མིག་ མི་ འཛུམས་པ་ -ས་ ལྟ་ ཞིང་ སྡོད་པ་ -ར་ གྱུར་ ཏོ་ ། །

source: At that very moment this world sphere, a great trichiliocosm, turned into Jāmbū River gold.
bo: དེ་ -འི་ ཚེ་ ན་ སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་པོ་ -འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ འདི་ འཛམ་བུ་ ཆུ་བོ་ -འི་ གསེར་ ལས་ གྲུབ་པ་ -ར་ ཀུན་ ཏུ་ གནས་པ་ -ར་ གྱུར་ ཅིང་ །

source: It was adorned with trees of many great gems and jewels,
bo: ནོར་བུ་ རིན་པོ་ཆེ་ ཆེན་པོ་ སྣ་ཚོགས་ ཀྱི་ ཤིང་ ལྗོན་པ་ དག་ གིས་ ལེགས་པ་ -ར་ བརྒྱན་པ་ དང་ །

source: divine flowering trees,
bo: ལྷ་ -འི་ མེ་ཏོག་ གི་ ཤིང་ ལྗོན་པ་ དག་ དང་ །

source: trees of fine fabrics,
bo: གོས་ ཀྱི་ ཤིང་ ལྗོན་པ་ དག་ དང་ །

source: It was covered with a net of precious moon gems, sun gems, and vidyutpradīpa gems.
bo: ནོར་བུ་ རིན་པོ་ཆེ་ ཉི་མ་ དང་ ཟླ་བ་ དང་ ། གློག་ གི་ སྒྲོན་མ་ -འི་ དྲ་བ་ -ས་ ཀུན་ ནས་ ཁེབས་པ་ དང་ །

source: Parasols, standards, and flags were hoisted.
bo: གདུགས་ དང་ རྒྱལ་མཚན་ དང་ ། བ་དན་ བསྒྲེང་བ་ དང་ ལྡན་ ལ་ །

source: nnumerable quintillions of apsaras with half their bodies in sight thronged all trees, which were enveloped by strings of pearls and garlands of great precious jewels.
bo: ཤིང་ ལྗོན་པ་ ཐམས་ཅད་ ལ་ ཡང་ ལྷ་ -འི་ བུ་མོ་ བྱེ་བ་ ཁྲག་ཁྲིག་ འབུམ་ཕྲག་ གྲངས་མེད་པ་ མུ་ཏིག་ གི་ དོ་ཤལ་ ལུས་ ཕྱེད་ ལ་ ཐོགས་པ་ དང་ ། རིན་པོ་ཆེ་ -འི་ ཕྲེང་བ་ ཐོགས་པ་ དག་ འཁོད་པ་ -ར་ གྱུར་ ཏོ་ ། །

source: At that time these verses rang out from the lion throne with its great, jeweled lotus inside:
bo: དེ་ -འི་ ཚེ་ ན་ སེང་གེ་ -འི་ ཁྲི་ ནོར་བུ་ རིན་པོ་ཆེ་ ཆེན་པོ་ -འི་ སྙིང་པོ་ ཅན་ དེ་ལས་ ཚིགས་ སུ་ བཅད་པ་ འདི་དག་ བྱུང་ ངོ་ ། །

source: I came about by the force of your merit.
bo: ཁྱོད་ ཀྱི་ བསོད་ནམས་ སྟོབས་ ཀྱིས་ བདག་ བྱུང་ སྟེ་ ། །

source: “Come, be seated, king of the best among men!
bo: མི་དབང་ རྒྱལ་པོ་ ཚུར་ གཤེགས་ བཞུགས་ སུ་ གསོལ་ ། །

source: Victor, best among the two-footed.
bo: རྒྱལ་བ་ རྐང་ གཉིས་ དམ་པ་ འདེགས་ བགྱི་ སྟེ་ ། །

source: Fulfilling my wish, today I shall support you,
bo: དེ་རིང་ བདག་ གིས་ བརྣག་པ་ འདི་ རྫོགས་ འགྱུར་ ། །

source: “My body is made of jewels.
bo: བདག་ གི་ ལུས་ འདི་ རིན་ཆེན་ རྒྱུས་ གྲུབ་ སྟེ་ ། །

source: Oh Guide, for your sake, At my center is a beautiful jewel lotus;
bo: འདྲེན་པ་ ཁྱོད་ ཕྱིར་ བདག་ གིས་ དཀྱིལ་ ན་ ནི་ ། ། རིན་ཆེན་ པད་མ་ ཡིད་འོང་ གཅིག་ མཆིས་ ཏེ་ ། །

source: Protector, please fulfill my wish today!
bo: སྐྱོབ་པ་ བདག་ གི་ བརྣག་པ་ དེ་ རྫོགས་ མཛོད་ ། །

source: “Seated on this jewel lotus,
bo: རིན་ཆེན་ པད་མ་ འདི་ ལ་ བཞུགས་ ནས་ ནི་ ། །

source: You shall beautify this entire world and me.
bo: བདག་ དང་ འཇིག་རྟེན་ འདི་ ཀུན་ མཛེས་པ་ -ར་ མཛོད་ ། །

source: Hearing such Dharma, one obtains a lion throne like this!
bo: གང་ ཐོས་ སེང་གེ་ -འི་ ཁྲི་ འདི་འདྲ་ ཐོབ་པ་ ། །

source: You shall teach the Dharma to many millions of living beings.
bo: ཆོས་ དེ་ སྲོག་ཆགས་ བྱེ་ མང་ བསྟན་ དུ་ གསོལ་ །

source: “Thousands of light rays shining from your limbs Illuminate many world spheres.
bo: ཁྱོད་ ཀྱི་ སྐུ་ ལ་ འོད་ཟེར་ སྟོང་ བྱུང་ སྟེ་ ། ། འཇིག་རྟེན་ ཁམས་ མང་ རབ་ཏུ་ སྣང་བྱེད་པ་ ། །

source: This is the sign of someone in whom joy is born.
bo: དེ་ ནི་ བདག་ གིས་ དགའ་ མཆོག་ སྐྱེས་པ་ -འི་ མཚན་ ། །

source: Guide, ascend to me!
bo: འདྲེན་པ་ བདག་ གི་ སླད་ དུ་ བཞུགས་ སུ་ གསོལ་ ། །

source: In the past, in this very place, I have supported eighty million self-arisen sages.
bo: སྔོན་ ཡང་ བདག་ གིས་ ཕྱོགས་ འདི་ -ར་ རང་བྱུང་བ་ -འི་ ། ། ཐུབ་པ་ བྱེ་བ་ ཕྲག་ བརྒྱད་ བཏེག་ གྱུར་པ་ -ས་ ། །

source: “Quickly, take your seat and grant your favor!
bo: མྱུར་ དུ་ བཞུགས་ ཏེ་ ཕན་ བཏགས་ མཛད་ དུ་ གསོལ་ །

source: May the Bhagavat also, today, bestow his favor!”
bo: བཅོམ་ལྡན་ དེང་ འདི་ -ར་ ཕན་ གདགས་ མཛད་ དུ་ གསོལ་ ། །

source: At this the Bhagavat arose from his previous seat and
bo: དེ་ནས་ བཅོམ་ལྡན་འདས་ གདན་ སྔ་མ་ ལས་ བཞེངས་ ཏེ་ །

source: sat down on the lion throne with its great jewel lotus inside. He sat with his legs crossed and observed the entire gathering of bodhisattvas.
bo: སེང་གེ་ -འི་ ཁྲི་ ནོར་བུ་ རིན་པོ་ཆེ་ ཆེན་པོ་ པད་མོ་ -འི་ སྙིང་པོ་ ཅན་ དེ་ ལ་ སྐྱིལ་མོ་ཀྲུང་ བཅས་ ཏེ་ བཞུགས་ ནས་ ། ཐམས་ཅད་ དང་ ལྡན་པ་ -འི་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ ཚོགས་ ལ་ རྣམ་པ་ -ར་ གཟིགས་ ཏེ་ །

source: Then, to those bodhisattva great beings, he signaled that he was about to deliver a distinguished Dharma teaching.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ དེ་དག་ ལ་ ཡང་དག་ ཕུལ་ གྱི་ ཆོས་ བསྟན་པ་ -འི་ ལྟས་ མཛད་ དོ་ ། །

source: At that very time, the entire assembly of bodhisattvas had the thought,
bo: དེ་ -འི་ ཚེ་ ན་ ཐམས་ཅད་ དང་ ལྡན་པ་ -འི་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ ཚོགས་ རྣམས་ འདི་ སྙམ་ དུ་ སེམས་ ཏེ་ །

source: “The youthful Mañjuśrī should now inquire of the Tathāgata, the Arhat, the Perfect and Complete Buddha, about non-arising and non-cessation. We have not heard that Dharma teaching for a long time.”
bo: འཇམ་དཔལ་ གཞོན་ནུ་ -ར་ གྱུར་པ་ འདི་ -ས་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་པ་ -ར་ རྫོགས་པ་ -འི་ སངས་རྒྱས་ ལ་ བདག་ཅག་ གིས་ ཐོས་ ནས་ ། ཡུན་རིང་ དུ་ ལོན་པ་ སྐྱེ་བ་ མེད་པ་ དང་ ། འགག་པ་ མེད་པ་ -འི་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ དེ་ ཡོངས་སུ་ ཞུས་ ན་ ཅི་མ་རུང་ སྙམ་ མོ་ ། །

source: The youthful Mañjuśrī had understood the Bhagavat’s signal,
bo: དེ་ནས་ འཇམ་དཔལ་ གཞོན་ནུ་ -ར་ གྱུར་པ་ -ས་ ། བཅོམ་ལྡན་འདས་ ཀྱིས་ ལྷས་ མཛད་པ་ ཡང་ རིག་ །

source: and he also knew what the bodhisattva great beings were thinking.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ དེ་དག་ གི་ སེམས་ ཀྱི་ ཡོངས་སུ་ རྟོགས་པ་ ཡང་ སེམས་ ཀྱིས་ ཤེས་ ནས་ །

source: So he arose and adjusted his upper robe so that one shoulder was uncovered.
bo: སྟན་ ལས་ ལངས་ ནས་ བླ་གོས་ ཕྲག་པ་ གཅིག་ ཏུ་ གཟར་ ནས་ །

source: He then knelt in front of the Bhagavat with his right knee placed in the center of a lotus.
bo: པུས་མོ་ གཡས་པ་ -འི་ ལྷ་ང་ པད་མ་ -འི་ སྙིང་པོ་ ལ་ བཙུགས་ ཏེ་ །

source: With joined palms he then addressed this question to the Bhagavat:
bo: བཅོམ་ལྡན་འདས་ ག་ལ་བ་ དེ་ ལོགས་ སུ་ ཐལ་མོ་ སྦྱར་བ་ བཏུད་ ནས་ ། བཅོམ་ལྡན་འདས་ ལ་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ་ ། །

source: “Bhagavat, ‘non-arising’ and ‘non-cessation’ have been spoken of.
bo: བཅོམ་ལྡན་འདས་ སྐྱེ་བ་ མ་ མཆིས་པ་ དང་ ། འགག་པ་ མ་ མཆིས་པ་ ཞེས་ བགྱི་ ན་ །

source: Bhagavat, to what dharma do the terms ‘non-arising’ and ‘non-cessation’ refer?”
bo: བཅོམ་ལྡན་འདས་ སྐྱེ་བ་ མཆིས་པ་ དང་ ། འགག་པ་ མ་ མཆིས་པ་ ཞེས་ བགྱི་བ་ དེ་ ཆོས་ གང་ གི་ ཚིག་ བླ་དགས་ ལགས་ །

source: He also expressed his question in verse:
bo: དེ་ -འི་ ཚེ་ ཚིགས་ སུ་ བཅད་པ་ འདི་དག་ གསོལ་ ཏོ་ ། །

source: Of ‘non-cessation’ and ‘non-arising.’
bo: མི་ སྐྱེ་འགག་ -ས་པ་ མ་ མཆིས་པ་ །

source: “Guide, you speak
bo: རྣམ་འདྲེན་ ཁྱོད་ ཀྱིས་ བཤད་ དུ་ གསོལ་ ། །

source: Greatly wise one, How do you explain those terms?
bo: དེ་ ཡི་ ངེས་ཚིག་ མཚན་ཉིད་ དེ་ ། ། ཅི་འདྲ་ ཤེས་རབ་ ཆེན་པོ་པ་ ། །

source: “ ‘Non-cessation’ and ‘non-arising,’
bo: མི་ སྐྱེ་འགག་པ་ མ་ མཆིས་པ་ ། །

source: Why are they called so?
bo: དེ་ ནི་ ཇི་ལྟར་ བརྗོད་པ་ -ར་ བགྱི་ ། །

source: Through analogies and reasons!
bo: དཔེ་ རྣམས་ དང་ ནི་ གཏན་ཚིགས་ ཀྱིས་ ། །

source: Great sage, please tell us
bo: ཐུབ་ཆེན་ བཤད་པ་ མཛད་ དུ་ གསོལ་ ། །

source: “These many bodhisattvas have come here,
bo: བྱང་ཆུབ་ སེམས་དཔའ་ མང་པོ་ འདུས་པ་ འདི་དག་ ནི་ ། །

source: Wishing for awareness; They were sent to salute you,
bo: ཡེ་ཤེས་ འཚལ་ ཞིང་ ཁྱོད་ ལ་ ཕྱག་ འཚལ་ མཆིས་ ལགས་ ན་ ། །

source: by many guides of the world.
bo: འཇིག་རྟེན་ རྣམ་པ་ -ར་ འདྲེན་པ་ རྣམས་ ཀྱིས་ བཀྱེ་ ལགས་ ཏེ་ ། །

source: So please teach the lofty and excellent, good Dharma!”
bo: དམ་ཆོས་ རྒྱ་ ཆེན་ དམ་པ་ བཤད་པ་ -ར་ མཛད་ དུ་ གསོལ་ །

source: the Bhagavat said to the youthful Mañjuśrī:
bo: བཅོམ་ལྡན་འདས་ ཀྱིས་ འཇམ་དཔལ་ གཞོན་ནུ་ -ར་ གྱུར་པ་ ལ་ འདི་སྐད་ ཅེས་ བཀའ་ སྩལ་ ཏོ་ །

source: You are striving for the benefit of many people, for the happiness of many people, and with compassion for the world.
bo: ཁྱོད་ སྐྱེ་བོ་ མང་པོ་ ལ་ ཕན་པ་ དང་ ། སྐྱེ་བོ་ མང་པོ་ ལ་ བདེ་བ་ དང་ ། འཇིག་རྟེན་ ལ་ སྙིང་བརྩེ་བ་ དང་ །

source: You are doing so for the goodness, benefit, and happiness of a great group of beings, both gods and men.
bo: ལྷ་ དང་ མི་ རྣམས་ ཀྱི་ སྐྱེ་བོ་ ཕལ་པོ་ ཆེ་ -འི་ དོན་ དང་ ། ཕན་པ་ དང་ ། བདེ་བ་ དང་ །

source: You are also acting so that the bodhisattva great beings who have come here may obtain the level of a buddha.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ རྣམས་ ཀྱིས་ སངས་རྒྱས་ ཀྱིས་ ཐོབ་པ་ -ར་ བྱ་བ་ -འི་ ཕྱིར་ ཞུགས་ ཏེ་ ། །

source: “Good, Mañjuśrī, good!
bo: འཇམ་དཔལ་ ལེགས་ སོ་ ལེགས་ སོ་ །

source: Mañjuśrī, it is good that you think to ask the Tathāgata about this matter.
bo: ཁྱོད་ དེ་བཞིན་ གཤེགས་པ་ ལ་དོན་ དེ་ལྟ་ བུ་ ཡོངས་སུ་ ཞུ་བ་ -ར་ སེམས་པ་ ནི་ འཇམ་དཔལ་ ཡང་ ཁྱོད་ ལེགས་ སོ་ །

source: you should apply yourself to this point without alarm, without fear, and without hesitation.
bo: གནས་ དེ་ ལ་ ཁྱོད་ སྐྲག་པ་ དང་ འཇིགས་པ་ དང་ ། དངང་ བར་མི་ བྱ་

source: And, Mañjuśrī, you must rely on awareness.
bo: ཞིང་ འཇམ་དཔལ་ ཁྱོད་ ཀྱིས་ ཡེ་ཤེས་ ལ་ བསྟེན་པ་ -ར་ ཡང་ བྱ་ -འོ་ །

source: “It is as follows. Mañjuśrī, imagine that this wide earth were made entirely of beryl,
bo: འཇམ་དཔལ་ འདི་ལྟ་སྟེ་ དཔེར་ན་ ། ས་གཞི་ ཆེན་པོ་ འདི་ བེེ་ དཱུཪྱ་ རིན་པོ་ཆེ་ -འི་ རང་བཞིན་ དུ་ ཀུན་ ནས་ གནས་པ་ -ར་ གྱུར་ ཅིང་ །

source: so that in that beryl one could see reflections of the abode of the Thirty-Three; of Śakra, lord of the gods; and of his Palace of Victory.
bo: དེ་ཡང་ ཇི་ལྟར་ བེེ་ དཱུཪྱ་ ཆེན་པོ་ -འི་ རང་བཞིན་ གྱིས་ གཞི་ ཆེན་པོ་ དེ་ ལ་ སུམ་ཅུ་རྩ་གསུམ་པ་ -འི་ གནས་ དང་ ། ལྷ་ -འི་ དབང་པོ་ བརྒྱ་བྱིན་ དང་ ། ཁང་ བཟངས་ རྣམ་པ་ -ར་ རྒྱལ་བྱེད་ ཀྱི་ གཟུགས་བརྙན་ ཀུན་ ཏུ་ སྣང་བ་ -ར་ འགྱུར་བ་

source: And imagine that Śakra, lord of the gods, could be seen there, playing and enjoying himself with the five divine objects of pleasure.
bo: དེ་ ན་ ལྷ་ -འི་ དབང་པོ་ བརྒྱ་བྱིན་ ལྷ་ -འི་ འདོད་པ་ -འི་ ཡོན་ཏན་ ལྔ་པོ་ དག་ གིས་ རྩེ་བ་ དང་ ། དགའ་བ་ དང་ ། དགའ་མགུ་ -ར་ སྤྱོད་པ་ ཡང་ ཀུན་ ཏུ་ སྣང་བ་ -ར་ གྱུར་ ཅིང་ །

source: “At that time, the gods might call out to all the men, women, boys, and girls of Jambūdvīpa,
bo: དེ་ནས་ དེ་ -འི་ ཚེ་ ལྷ་ རྣམས་ ཀྱིས་ འཛམ་བུ་ -འི་ གླིང་ གི་ སྐྱེས་པ་ དང་ ། བུད་མེད་ དང་ ཁྱེའུ་ དང་ བུ་མོ་ ཐམས་ཅད་ ལ་ ཚིག་ འདི་སྐད་ ཅེས་ །

source: ‘Come here, men and women!
bo: ཀྱེ་ སྐྱེས་པ་ དང་ བུད་མེད་ དག་ ཚུར་ ཤོག་ །

source: Look at Śakra, lord of the gods, as he is playing, enjoying, and amusing himself with the five divine objects of pleasure in his Palace of Victory.
bo: ལྷ་ -འི་ དབང་པོ་ བརྒྱ་བྱིན་ འདི་ ཁང་ བཟངས་ རྣམ་པ་ -ར་ རྒྱལ་བྱེད་ ཀྱི་ ནང་ ན་ ། ལྷ་ -འི་ འདོད་པ་ -འི་ ཡོན་ཏན་ ལྔ་པོ་ དག་ གིས་ རྩེ་བ་ དང་ དགའ་བ་ དང་ དགའ་མགུ་ -ར་ སྤྱོད་པ་ -ར་ བྱེད་པ་ ལ་ ལྟོས་ །

source: Come, all men and women,
bo: ཀྱེ་ སྐྱེས་པ་ དང་ བུད་མེད་ ཀྱི་ ཚོགས་ དག་ ཚུར་ ཤེག་ །

source: offer gifts and make merits.
bo: སྦྱིན་པ་ དག་ བྱིན་ ཅིག་ ། བསོད་ནམས་ དག་ གྱིས་ ཤིག་ །

source: Take up discipline and abide by it.
bo: ཚུལ་ཁྲིམས་ ཡང་དག་པ་ -ར་ ལོང་ སྟེ་ འདུག་ ཤིག་ དང་ །

source: hen you shall also get to play, enjoy, and amuse yourself in such Palaces of Victory.
bo: ཁང་ བཟངས་ རྣམ་པ་ -ར་ རྒྱལ་བྱེད་ འདི་ ལྟ་བུ་ དག་ གི་ ནང་ ན་ རྩེ་བ་ -ར་ འགྱུར་ ། དགའ་བ་ -ར་ འགྱུར་ ། དགའ་མགུ་ -ར་ སྤྱོད་པ་ -ར་ འགྱུར་ ཞིང་ །

source: You will become like Śakra himself and will come to possess wealth like his. The lord of the gods, Śakra, has all divine enjoyments, and so shall you.’
bo: བརྒྱ་བྱིན་ ཉིད་ ཐོབ་པ་ -ར་ ཡང་ འགྱུར་ ལ་ ལྷ་ -འི་ དབང་པོ་ བརྒྱ་བྱིན་ ལྷ་ -འི་ ལོངས་སྤྱོད་ དག་ གིས་ འབྱོར་ ཅིང་ ལྡན་པ་ -ར་ གྱུར་པ་ ཅི་འདྲ་བ་ དེ་ འདྲ་བ་ -འི་ འབྱོར་པ་ དག་ དང་ ལྡན་པ་ -ར་ ཡང་ འགྱུར་ རོ་ །

source: “Then, Mañjuśrī, all those men, women, girls, and boys, who could see the abode of the Thirty-Three along with Śakra, lord of the gods, and his Palace of Victory reflected in the wide earth of beryl,
bo: འཇམ་དཔལ་ དེ་ནས་ སྐྱེས་པ་ དང་ ། བུད་མེད་ དང་ ཁྱེའུ་ དང་ བུ་མོ་ དེ་དག་ གིས་ བེེ་ དཱུཪྱ་ ཆེན་པོ་ -འི་ རང་བཞིན་ གྱི་ ས་གཞི་ ཆེན་པོ་ དེ་ ལ་ སུམ་ཅུ་རྩ་གསུམ་པ་ -འི་ གནས་ དང་ ། ཁང་ བཟངས་ རྣམ་པ་ -ར་ རྒྱལ་བྱེད་ དང་ ། ལྷ་ -འི་ དབང་པོ་ བརྒྱ་བྱིན་ གྱི་ གཟུགས་བརྙན་ མཐོང་ ནས་ །

source: would fold their hands toward this reflection. They would scatter flowers and offer perfumes toward it, saying,
bo: ཐལ་མོ་ སྦྱོར་ ཞིང་ མེ་ཏོག་ དག་ ཀྱང་ འཐོར་བ་ -ར་ བྱེད་ ། སྤོས་ དག་ ཀྱང་ འཐོར་བ་ -ར་ བྱེད་ ལ་ ། ཚིག་ འདི་སྐད་ ཅེས་

source: ‘May we also obtain such a body as that of Śakra, lord of the gods;
bo: བདག་ཅག་ ཀྱང་ ལྷ་ -འི་ དབང་པོ་ བརྒྱ་བྱིན་ ཅི་འདྲ་བ་ དེ་ འདྲ་བ་ -འི་ ལུས་ ཐོབ་པ་ -ར་ གྱུར་ཅིག་ །
