Repository: OpenPecha-Data/0fbd31ce377b49a79da3bbcf2402ad48
Catalog: *.po
Languages: bo

source: I salute you, who are free from a point of reference and crossed the great stream.
bo: དམིགས་མེད་ ཆུ་བོ་ རྒལ་བ་ ཁྱོད་ ལ་ ཕྱག་ འཚལ་ ལོ་ ། །

source: “Isolation is the unexcelled state of the Teacher;
bo: སྟོན་པ་ -འི་ གོ་འཕང་ བླ་མེད་ དབེན་པ་ ཉིད་ ལགས་ ཏེ་ ། །

source: “I salute the inconceivable Buddha of great power, Who is the same as space and without abode.
bo: སངས་རྒྱས་ མཐུ་ཆེན་ བསམ་ གྱིས་ ཁྱབ་པ་ མ་ ལགས་ ཏེ་ ། ། མི་ གནས་ ནམ་མཁའ་ མཉམ་པ་ཉིད་ ལ་ ཕྱག་ འཚལ་ ལོ་ ། །

source: You have thoroughly eliminated all signs, And you wish for nothing whatsoever.
bo: མཚན་མ་ ཐམས་ཅད་ རྣམ་པ་ ཀུན་ ཏུ་ རྣམ་པ་ -ར་ བཤིག་ ། ཁྱོད་ ལ་ག་ -ར་ ཡང་ སྨོན་པ་ -ར་ མཛད་པ་ མཆིས་ མ་ ལགས་ ། །

source: I salute you, supreme holder of all good qualities.
bo: ཡོན་ཏན་ ཀུན་ གྱི་ མཆོག་ མངའ་ ཁྱོད་ ལ་ ཕྱག་ འཚལ་ ལོ་ ། །

source: I salute you, whose glory rises up like Meru.”
bo: དཔལ་ འཕགས་ ལྷུན་པོ་ འདྲ་བ་ ཁྱོད་ ལ་ ཕྱག་ འཚལ་ ལོ་ ། །

source: Then the Bhagavat praised the youthful Mañjuśrī:
bo: དེ་ནས་ བཅོམ་ལྡན་འདས་ ཀྱིས་ འཇམ་དཔལ་ གཞོན་ནུ་ -ར་ གྱུར་པ་ ལ་ ལེགས་ སོ་ ཞེས་ བྱ་བ་ བྱིན་ ཏེ་ །

source: “Good, Mañjuśrī, that is good!
bo: འཇམ་དཔལ་ ལེགས་ སོ་ ལེགས་ སོ་ ། །

source: You have spoken well, Mañjuśrī.
bo: འཇམ་དཔལ་ ཁྱོད་ ཀྱིས་ ལེགས་པ་ -ར་ སྨྲ་ -ས་ སོ་ ། །

source: It is just as you said.
bo: འཇམ་དཔལ་ དེ་དེ་ བཞིན་ ཏེ་ །

source: Mañjuśrī, the buddhas should not be seen through form, through dharmas, through characteristics, or through the dharmadhātu.
bo: འཇམ་དཔལ་ སངས་རྒྱས་ རྣམས་ ནི་ གཟུགས་ ལས་ བལྟ་བ་ -ར་ མི་ བྱ་ སྟེ་ ། ཆོས་ ལས་མ་ ཡིན་ ། མཚན་མ་ ལས་མ་ ཡིན་ ། ཆོས་ ཀྱི་ དབྱིངས་ ལས་ ཀྱང་ མ་ ཡིན་ ནོ་ ། །

source: The buddhas do not stay by themselves
bo: སངས་རྒྱས་ རྣམས་ ནི་ ཉག་གཅིག་ བཞུགས་པ་ མ་ ཡིན་ །

source: nor do they reside among many people.
bo: སྐྱེ་བོ་ མང་པོ་ -འི་ ནང་ ན་ བཞུགས་པ་ མ་ ཡིན་ ནོ་ ། །

source: The buddhas have not been seen by anyone, nor heard, nor worshipped, nor are they being worshipped now.
bo: སངས་རྒྱས་ རྣམས་ ནི་ སུ་ -ས་ ཀྱང་ མཐོང་བ་ མ་ ཡིན་ ། ཐོས་པ་ མ་ ཡིན་ ། མཆོད་པ་ མ་ ཡིན་ ཏེ་ ། མཆོད་པ་ -ར་ བྱེད་པ་ ཡང་ མ་ ཡིན་ ནོ་ ། །

source: “The buddhas did not obtain awakening.
bo: སངས་རྒྱས་ རྣམས་ ཀྱི་ བྱང་ཆུབ་ བརྙེས་པ་ མེད་ དོ་ ། །

source: The buddhas do not make oneness or plurality out of any dharma.
bo: སངས་རྒྱས་ རྣམས་ ནི་ ཆོས་ འགའ་ཡང་ གཅིག་པ་ ཉིད་ དམ་ ། མང་པོ་ ཉིད་ དུ་ མི་ མཛད་པ་ ཡིན་ ནོ་ ། །

source: The buddhas are not increased by any dharma.
bo: སངས་རྒྱས་ རྣམས་ ནི་ ཆོས་ གང་ གིས་ ཀྱང་ རབ་ཏུ་ འབྱེད་པ་ -ར་ མི་ བྱེད་ དོ་ ། །

source: No dharma has been seen by the buddhas, nor has it been heard, recollected, cognized, or known.
bo: སངས་རྒྱས་ རྣམས་ ཀྱིས་ ནི་ ཆོས་ འགའ་ཡང་ མ་ གཟིགས་ ། ། མ་ གསན་ མ་ དགོངས་ ། རྣམ་པ་ -ར་ མི་ མཁྱེན་ ། ཀུན་ ཏུ་ མི་ མཁྱེན་ ཏོ་ ། །

source: No dharma has been seen by the buddhas, nor has it been heard, recollected, cognized, or known.
bo: སངས་རྒྱས་ རྣམས་ ཀྱིས་ ནི་ ཆོས་ འགའ་ཡང་ མ་ གཟིགས་ ། ། མ་ གསན་ མ་ དགོངས་ ། རྣམ་པ་ -ར་ མི་ མཁྱེན་ ། ཀུན་ ཏུ་ མི་ མཁྱེན་ ཏོ་ ། །

source: The buddhas have not spoken or expressed anything.
bo: སངས་རྒྱས་ རྣམས་ ཀྱིས་ ནི་ མ་ གསུངས་ ། མ་ བརྗོད་ དོ་ །

source: They do not speak or express anything.
bo: མི་ གསུང་ མི་ བརྗོད་ དོ་ །

source: They will not speak or express anything.
bo: གསུང་བ་ -ར་ མི་ འགྱུར་ བརྗོད་པ་ -ར་ མི་ འགྱུར་ རོ་ ། །

source: The buddhas do not gain supreme realization.
bo: སངས་རྒྱས་ རྣམས་ ནི་ མངོན་པར་ རྫོགས་པ་ -ར་ འཚང་རྒྱ་བ་ -ར་ མི་ མཛད་ དོ་ ། །

source: The buddhas do not supremely realize any dharma.
bo: སངས་རྒྱས་ རྣམས་ ཀྱིས་ ནི་ ཆོས་ གང་ཡང་ མངོན་པར་ རྫོགས་པ་ -ར་ འཚང་ མ་ རྒྱས་ སོ་ ། །

source: The buddhas’ afflictions have not been destroyed.
bo: སངས་རྒྱས་ རྣམས་ ནི་ ཉོན་མོངས་པ་ མ་ སྤངས་ སོ་ ། །

source: Buddhas have not directly realized purification.
bo: སངས་རྒྱས་ རྣམས་ ཀྱིས་ ནི་ རྣམ་པ་ -ར་ བྱང་བ་ མངོན་སུམ་ དུ་མ་ མཛད་ དོ་ ། །

source: Buddhas have not seen any dharma, nor heard it, smelt it, tasted it, touched it, or cognized it.
bo: སངས་རྒྱས་ རྣམས་ ཀྱིས་ ནི་ ཆོས་ གང་ཡང་ མ་ གཟིགས་ ། མ་ གསན་ ། མ་ མྱངས་ ། མ་ མནམས་ ། མ་ རེག་ ། མི་ མཁྱེན་ ཏོ་ ། །

source: And why?
bo: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན་ །

source: Because of the primordial purity of all dharmas.
bo: འཇམ་དཔལ་ ཆོས་ ཐམས་ཅད་ ནི་ གཟོད་མ་ ནས་ ཡོངས་སུ་ དག་པ་ ཡིན་པ་ -འི་ ཕྱིར་ རོ་ །

source: such a person engenders even more merit.
bo: དེ་ ནི་ དེ་བ་ -ས་ ཆེས་ བསོད་ནམས་ མང་ དུ་ བསྐྱེད་པ་ -ར་ འགྱུར་ རོ་ །

source: All the more so for one who writes down this Dharma teaching or makes others write it
bo: གང་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ འདི་ ཡི་གེ་ -ར་ འདྲི་ འམ་ ། ཡི་གེ་ -ར་ འདྲིར་ འཇུག་པ་ ལྟ་ སྨོས་ ཀྱང་ ཅི་ དགོས་ ཏེ་ ། །

source: “Mañjuśrī, there are many sentient beings to be found in the great trichiliocosm, whether born from an egg,
bo: འཇམ་དཔལ་ ཡོངས་སུ་ བརྟག་པ་ ཉེ་བར་ བཟུང་ ན་ ། སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་པོ་ -འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ ན་ སེམས་ཅན་ སྒོ་ང་ ལས་ སྐྱེས་པ་ དང་ །

source: born from a womb,
bo: མངལ་ ནས་ སྐྱེས་པ་ དང་ །

source: born from moisture,
bo: དྲོད་གཤེར་ ལས་ སྐྱེས་པ་ དང་ །

source: born suddenly;
bo: རྫུས་ ཏེ་ སྐྱེས་པ་ དང་ །

source: some with form, others formless;
bo: གཟུགས་ཅན་ དང་ ། གཟུགས་ མེད་པ་ དང་ །

source: some with notions, others without notions;
bo: འདུ་ཤེས་ ཅན་ དང་ ། འདུ་ཤེས་ མེད་པ་ དང་ །

source: some without feet, others with two feet,
bo: རྐང་པ་ མེད་པ་ དང་ ། རྐང་གཉིས་པ་ དང་ །

source: some with four feet, or with many feet. Now, imagine that all of them obtain a human body, without precedent, but not their last.
bo: རྐང་བཞི་པ་ དང་ རྐང་ མངའ་ -ས་ གང་ ཇི་སྙེད་ ཡོད་པ་ དེ་དག་ ཐམས་ཅད་ སྔ་ཕྱི་ མེད་པ་ -ར་ མི་ -འི་ ལུས་ ཐོབ་པ་ -ར་ གྱུར་ ལ་ །

source: Once they obtain a human body, they give rise to bodhicitta.
bo: མི་ -འི་ ལུས་ ཐོབ་ ནས་ ཀྱང་ བྱང་ཆུབ་ ཏུ་ སེམས་བསྐྱེད་པ་ -ར་ གྱུར་ ལ་ །

source: Having given rise to bodhicitta,
bo: བྱང་ཆུབ་ ཏུ་ སེམས་བསྐྱེད་ ནས་ ཀྱང་ །

source: each and every one of those bodhisattvas attends as many buddhas, together with bodhisattvas and hearers,
bo: བྱང་ཆུབ་ སེམས་དཔའ་ རེ་རེ་ -ས་ ཀྱང་ སངས་རྒྱས་ བྱང་ཆུབ་ སེམས་དཔའ་ དང་ བཅས་ ། ཉན་ཐོས་ དང་ བཅས་པ་ །

source: as there are atomic particles in buddhafields as numerous as the grains of sand in the Ganges.
bo: སངས་རྒྱས་ ཀྱི་ ཞིང་ གང་ གཱའི་ བྱེ་མ་ ལྟར་ གྲངས་མེད་པ་ -འི་ རྡུལ་ ཕྲ་རབ་ ཀྱི་ རྡུལ་ སྙེད་ དག་ ལ་ །

source: he collects all the necessities for their happiness.
bo: བདེ་བ་ -འི་ ཡོ་བྱད་ ཐམས་ཅད་ ཀྱང་ ཉེ་བར་ སྒྲུབ་པ་ -ར་ བྱེད་ ལ་ །

source: offers robes, alms-food, bedding, seats, herbs that counteract illness, and provisions,
bo: ན་བཟའ་ དང་ ། ཞལ་ཟས་ དང་ ། གཟིམས་ ཆ་ དང་ ། གདན་ དང་ ། སྙུན་ གྱི་ གསོས་ སྨན་ དང་ ། ཡོ་བྱད་ རྣམས་ ཀྱིས་ བསྙེན་བཀུར་ བྱེད་ ཅིང་ །

source: for as many eons as the number of grains of sand in the Ganges.
bo: བསྐལ་པ་ གང་ གཱའི་ བྱེ་མ་ ལྟར་ གྲངས་མེད་པ་ སྙེད་ དུ

source: pearls,
bo: མུ་ཏིག་ དང་ །

source: with raised umbrellas, standards, and flags,
bo: གདུགས་ དང་ རྒྱལ་མཚན་ དང་ ། བ་དན་ སྒྲེང་བ་ །

source: “Now imagine another bodhisattva, with the right inclination, who listens to this Dharma teaching, The Ornament of the Light of Awareness That Enters the Domain of All Buddhas, and then believes in it, engages with it, trusts it,
bo: བྱང་ཆུབ་ སེམས་དཔའ་ བསམ་པ་ ཕུན་སུམ་ ཚོགས་པ་ གཞན་ གང་ཞིག་ གིས་ སངས་རྒྱས་ ཐམས་ཅད་ ཀྱི་ ཡུལ་ ལ་ འཇུག་པ་ ཡེ་ཤེས་ སྣང་བ་ -འི་ རྒྱན་ ཞེས་ བྱ་བ་ -འི་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ འདི་ ཐོས་ ནས་ མོས་པ་ -ར་ བྱེད་ ། འཇུག་པ་ -ར་ བྱེད་ ། ཡིད་ཆེས་པ་ -ར་ བྱེད་ ཅིང་ །

source: realizes it, or teaches at least one of its stanzas. Compared to the bodhisattvas first mentioned, he would engender even more uncountable merit that would lead him to follow the awareness of a buddha.
bo: ཡོངས་སུ་ རྟོགས་པ་ -ར་ བྱས་ ནས་ ཀྱང་ ཐ་ན་ ཚིག་ བཞི་པ་ -འི་ ཚིགས་ སུ་ བཅད་པ་ གཅིག་ ཙམ་ ཞིག་ ལུང་ འབོགས་པ་ -ར་ བྱེད་ ན་ དེ་ ནི་ དེ་བ་ -ས་ ཆེས་ སངས་རྒྱས་ ཀྱི་ ཡེ་ཤེས་ རྗེས་སུ་ རྟོགས་པ་ -ར་ འགྱུར་བ་ -འི་ བསོད་ནམས་ གྲངས་མེད་པ་ བསྐྱེད་པ་ -ར་ འགྱུར་ ཏེ་ །

source: Compared to the merit he would produce, the production of merit in the first instance, consisting of the bodhisattvas’ acts of giving, would not even amount to a hundredth part.
bo: བསོད་ནམས་ མངོན་པར་ འདུ་བྱེད་པ་ དེ་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ དེ་དག་ གི་ སྦྱིན་པ་ ལས་ བྱུང་བ་ -འི་ བསོད་ནམས་ མངོན་པར་ འདུ་ བྱ་བ་ སྔ་མ་ དེ་ -ས་ ནི་ བརྒྱ་ -འི་ ཆ་ -ར་ ཡང་ ཉེ་བར་ མི་ འགྲོ་ -འོ་ ། །

source: It would not even count for one thousandth or one-billionth of it. It would not even count as any part, any number worthy of consideration, simile or approximation of any kind.
bo: སྟོང་ གི་ ཆ་ དང་ ། འབུམ་ གྱི་ ཆ་ དང་ ། བྱེ་བ་ ཕྲག་ འབུམ་ གྱི་ ཆ་ དང་ ། གྲངས་ དང་ ཆ་ དང་ བགྲང་བ་ དང་ དཔེ་ དང་ ། རྒྱུ་ -ར་ ཡང་ ཉེ་བར་ མི་ འགྲོ་ -འོ་ ། །

source: “Mañjuśrī, imagine a householder bodhisattva who attends as many buddhas and bodhisattvas,
bo: འཇམ་དཔལ་ བྱང་ཆུབ་ སེམས་དཔའ་ ཁྱིམ་པ་ གང་ལ་ལ་ ཞིག་ གིས་ སངས་རྒྱས་ དང་ བྱང་ཆུབ་ སེམས་དཔའ་ དང་ བཅས་པ་ །

source: together with their saṅgha of hearers, as there are grains of sand in the Ganges, for eons as numerous as the grains of sand in the Ganges.
bo: ཉན་ཐོས་ ཀྱི་ དགེ་འདུན་ དང་ བཅས་པ་ གང་ གཱའི་ བྱེ་མ་ ལྟར་ གྲངས་མེད་པ་ སྙེད་ ཅིག་ ལ་ བསྐལ་པ་ གང་ གཱའི་ བྱེ་མ་ ལྟར་ གྲངས་མེད་པ་ སྙེད་ དུ་ ། །

source: He would offer them robes, alms-food, bedding, seats, remedies for exhaustion, medicinal herbs, and provisions.
bo: ན་བཟའ་ དང་ ། ཞལ་ཟས་ དང་ ། གཟིམས་ ཆ་ དང་ ། གདན་ དང་ སྙུན་ གྱི་ གསོས་ སྨན་ དང་ ། ཡོ་བྱད་ རྣམས་ ཀྱིས་ བསྙེན་བཀུར་ བྱེད་པ་ བས་ ནི་ །

source: another ordained bodhisattva, disciplined and with the right inclination, may give a morsel of food to a single sentient being born as an animal.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ རབ་ཏུ་ བྱུང་བ་ ཚུལ་ཁྲིམས་ དང་ ལྡན་པ་ ། བསམ་པ་ ཕུན་སུམ་ ཚོགས་པ་ གཞན་ གང་ གིས་ ཐ་ན་ དུད་འགྲོ་ -འི་ སྐྱེ་གནས་ སུ་ སྐྱེས་པ་ -འི་ སེམས་ཅན་ ལ་ སྦྱིན་པ་ ཁམ་ གཅིག་ ཙམ་ ཞིག་ བྱིན་པ་ -ར་ གྱུར་ ན་ །

source: another ordained bodhisattva, disciplined and with the right inclination, may give a morsel of food to a single sentient being born as an animal.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ རབ་ཏུ་ བྱུང་བ་ ཚུལ་ཁྲིམས་ དང་ ལྡན་པ་ ། བསམ་པ་ ཕུན་སུམ་ ཚོགས་པ་ གཞན་ གང་ གིས་ ཐ་ན་ དུད་འགྲོ་ -འི་ སྐྱེ་གནས་ སུ་ སྐྱེས་པ་ -འི་ སེམས་ཅན་ ལ་ སྦྱིན་པ་ ཁམ་ གཅིག་ ཙམ་ ཞིག་ བྱིན་པ་ -ར་ གྱུར་ ན་ །

source: Compared to the merit he would produce, the production of merit in the first instance would not even amount to a hundredth part.
bo: བསོད་ནམས་ མངོན་པར་ འདུ་ བྱ་བ་ དེ་ ལ་ བསོད་ནམས་ མངོན་པར་ འདུ་ བྱ་བ་ སྔ་མ་ དེ་ -ས་ བརྒྱ་ -འི་ ཆ་ -ར་ ཡང་ ཉེ་བར་ མི་ འགྲོ་ -འོ་ །

source: together with their saṅgha of hearers, as there are grains of sand in the Ganges. He would offer robes, alms-food, bedding, seats, remedies for exhaustion, medicinal herbs, and provisions, for eons as numerous as the grains of sand in the Ganges.
bo: ཉན་ཐོས་ དང་ བཅས་པ་ གང་ གཱིའི་ བྱེ་མ་ ལྟར་ གྲངས་མེད་པ་ སྙེད་ དག་ ལ་ བསྐལ་པ་ གང་ གཱའི་ བྱེ་མ་ ལྟར་ གྲངས་མེད་པ་ སྙེད་ དུ་ ན་བཟའ་ དང་ ། ཞལ་ཟས་ དང་ ། གཟིམས་ ཆ་ དང་ ། གདན་ དང་ སྙུན་ གྱི་ གསོས་ སྨན་ དང་ ། ཡོ་བྱད་ རྣམས་ ཀྱིས་ བསྙེན་བཀུར་ བྱེད་པ་ -ར་ གྱུར་ ན་ ། །

source: “Mañjuśrī, imagine as many bodhisattvas as there are atomic particles in the great trichiliocosm, all of them ordained, disciplined, and pure in their inclinations. Each bodhisattva would attend as many buddhas and bodhisattvas,
bo: འཇམ་དཔལ་ གལ་ཏེ་ བྱང་ཆུབ་ སེམས་དཔའ་ རབ་ཏུ་ བྱུང་བ་ ཚུལ་ཁྲིམས་ དང་ ལྡན་པ་ སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་པོ་ -འི་ རྡུལ་ ཕྲ་རབ་ ཀྱི་ རྡུལ་ སྙེད་ དག་ ལས་བྱང་ ཆུབ་ སེམས་དཔའ་ རེ་རེ་ -ས་ ཀྱང་ ཕྱོགས་ བཅུ་ -འི་ སངས་རྒྱས་ བྱང་ཆུབ་ སེམས་དཔའ་ དང་ བཅས་ །

source: Compared to the merit he would produce, the production of merit in the first instance, consisting of the bodhisattvas’ acts of giving, would not even amount to a hundredth part.
bo: ཡི་གེ་ -ར་ འདྲིར་ འཇུག་པ་ -ར་ བྱེད་ ན་ བསོད་ནམས་ མངོན་པར་ འདུ་ བྱ་བ་ དེ་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ དེ་དག་ གི་ སྦྱིན་པ་ ལས་ བྱུང་བ་ -འི་ བསོད་ནམས་ མངོན་པར་ འདུ་ བྱ་བ་ སྔ་མ་ དེ་ -ས་ ནི་ བརྒྱ་ -འི་ ཆ་ -ར་ ཡང་ ཉེ་བར་ མི་ འགྲོ་ -འོ་ །

source: It would not even bear approximation of any kind.
bo: དཔེ་ དང་ རྒྱུ་ -ར་ ཡང་ ཉེ་བར་ མི་ འགྲོ་ -འོ་ ། །

source: It would not even count for one thousandth or one-billionth of it,
bo: སྟོང་ གི་ ཆ་ དང་ ། འབུམ་ གྱི་ ཆ་ དང་ ། བྱེ་བ་ ཕྲག་ འབུམ་ གྱི་ ཆ་ དང་ ། གྲངས་ དང་ ། ཆ་ དང་ ། བགྲང་བ་ དང་ ། །

source: It would not even count for one thousandth or one-billionth of it.
bo: སྟོང་ གི་ ཆ་ དང་ ། འབུམ་ གྱི་ ཆ་ དང་ ། བྱེ་བ་ ཕྲག་ འབུམ་ གྱི་ ཆ་ དང་ ། གྲངས་ དང་ ཆ་ དང་ བགྲང་བ་ དང་ །

source: offer it as a gift to the buddhas, the bhagavats.
bo: སངས་རྒྱས་ རྣམས་ ལ་ དབུལ་བ་ -ར་ འབུལ་ ཞིང་ ། །

source: “Mañjuśrī, imagine that a bodhisattva great being were to fill the great trichiliocosm with seven precious substances and
bo: འཇམ་དཔལ་ གལ་ཏེ་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ ཞིག་ གིས་ སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་པོ་ -འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ རིན་པོ་ཆེ་ སྣ་ བདུན་ གྱིས་ ཡོངས་སུ་ བཀང་ སྟེ་ །

source: But another bodhisattva may teach just a four-line stanza from this Dharma method to another bodhisattva.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ གཞན་ གང་ཞིག་ གི་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ འདི་ ལས་ ཐ་ན་ ཚིག་ བཞི་པ་ -འི་ ཚིགས་ སུ་ བཅད་པ་ གཅིག་ ཙམ་ ཞིག་ བྱང་ཆུབ་ སེམས་དཔའ་ གཞན་ ལ་ བསྟན་པ་ -ར་ གྱུར་ ན་ །

source: Compared to the merit he would produce, the production of merit in the first instance would not even amount to a hundredth part.
bo: བསོད་ནམས་ མངོན་པར་ འདུ་ བྱ་བ་ དེ་ ལ་ བསོད་ནམས་ མངོན་པར་ འདུ་ བྱ་བ་ སྔ་མ་ དེ་ -ས་ ནི་ བརྒྱ་ -འི་ ཆ་ -ར་ ཡང་ ཉེ་བར་ མི་ འགྲོ་ -འོ་ ། །

source: It would not even count for one thousandth or one-billionth of it
bo: སྟོང་ གི་ ཆ་ དང་ ། འབུམ་ གྱི་ ཆ་ དང་ ། བྱེ་བ་ ཕྲག་ འབུམ་ གྱི་ ཆ་ དང་ ། གྲངས་ དང་ ། ཆ་ དང་ ། བགྲང་བ་ དང་ །

source: It would not even bear approximation of any kind.
bo: དཔེ་ དང་ རྒྱུ་ -ར་ ཡང་ ཉེ་བར་ མི་ འགྲོ་ -འོ་ ། །

source: “Mañjuśrī, consider that the production of merit of someone giving offerings were to continue for as many eons as there are atomic particles in a great trichiliocosm.
bo: འཇམ་དཔལ་ བསྐལ་པ་ སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་པོ་ -འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཀྱི་ རྡུལ་ ཕྲ་རབ་ ཀྱི་ རྡུལ་ སྙེད་ དུ་ སྦྱིན་པ་ -འི་ བསོད་ནམས་ མངོན་པར་ འདུ་ བྱ་བ་ ལྟ་ཞོག་ གི

source: Mañjuśrī, bodhisattvas as numerous as the grains of sand in the Ganges would be there;
bo: འཇམ་དཔལ་ གལ་ཏེ་ བྱང་ཆུབ་ སེམས་དཔའ་ གང་ གཱའི་ བྱེ་མ་ ལྟར་ གྲངས་མེད་པ་ སྙེད་ ཅིག་ བྱུང་བ་ -ར་ གྱུར་ ལ་ །

source: each bodhisattva would cover as many golden buddhafields as the number of grains of sand in the Ganges,
bo: དེ་དག་ ལས་བྱང་ ཆུབ་ སེམས་དཔའ་ རེ་རེ་ -ས་ ཀྱང་ ། སངས་རྒྱས་ ཀྱི་ ཞིང་ འཛམ་བུ་ ཆུ་བོ་ -འི་ གསེར་ ལས་ བྱས་པ་ །

source: all their trees, with divine clothes, and then cover them in nets of gems and jewels shining in all possible ways.
bo: ཤིང་ ལྗོན་པ་ ཐམས་ཅད་ ཀྱང་ ལྷ་ -འི་ གོས་ རྣམས་ ཀྱིས་ ཡོངས་སུ་ དཀྲིས་པ་ ནོར་བུ་ རིན་པོ་ཆེ་ འོད་ ཐམས་ཅད་ ཡང་དག་པ་ -ར་ འདུས་པ་ -འི་ དྲ་བ་ -ས་ ཀུན་ ནས་ གཡོགས་པ་ །

source: He would then fill them with high palaces made of precious vaśirāja gems
bo: ནོར་བུ་ རིན་པོ་ཆེ་ དབང་ གི་ རྒྱལ་པོ་ ལས་ བྱས་པ་ -འི་ ཁང་པ་ བརྩེགས་པ་ །

source: surrounded with vedikās of the precious vidyutpradīpa gems. Once filled, he would give them as a gift, with raised parasols, standards, and flags, to as many buddhas as there are grains of sand in the Ganges, each and every day.
bo: ནོར་བུ་ རིན་པོ་ཆེ་ གློག་ གི་ སྒྲོན་མ་ -འི་ ལན་ཀན་ གྱིས་ ཡོངས་སུ་ བསྐོར་བ་ དག་ གིས་ ཡོངས་སུ་ གང་བ་ -ར་ བྱས་པ་ གདུགས་ དང་ ། རྒྱལ་མཚན་ དང་ ། བ་དན་ བསྒྲེང་བ་ ། གང་ གཱའི་ བྱེ་མ་ ལྟར་ གྲངས་མེད་པ་ ཇི་སྙེད་ ཅིག་ སངས་རྒྱས་ གང་ གཱའི་ བྱེ་མ་ ལྟར་ གྲངས་མེད་པ་ སྙེད་ དག་ ལ་ ཉིན་ གཅིག་ བཞིན་ དུ་ དབུལ་བ་ -ར་ འབུལ་ ཞིང་ ། །

source: “It is as follows: Mañjuśrī, if all sentient beings included in the three world spheres were to be born in the hells, or as animals, or as pretas in the world of Yama,
bo: འཇམ་དཔལ་ འདི་ལྟ་སྟེ་ དཔེར་ན་ ཁམས་ གསུམ་ དུ་ གཏོགས་པ་ -འི་ སེམས་ཅན་ ཐམས་ཅད་ སེམས་ཅན་ དམྱལ་བ་ དང་ ། དུད་འགྲོ་ དང་ ། ཡི་དགས་ དང་ ། གཤིན་རྗེ་ -འི་ འཇིག་རྟེན་ དུ་ སྐྱེས་པ་ -ར་ འགྱུར་ ལ་ ། །

source: “It is as follows: Mañjuśrī, if all sentient beings included in the three world spheres were to be born in the hells, or as animals, or as pretas in the world of Yama,
bo: འཇམ་དཔལ་ འདི་ལྟ་སྟེ་ དཔེར་ན་ ཁམས་ གསུམ་ དུ་ གཏོགས་པ་ -འི་ སེམས་ཅན་ ཐམས་ཅད་ སེམས་ཅན་ དམྱལ་བ་ དང་ ། དུད་འགྲོ་ དང་ ། ཡི་དགས་ དང་ ། གཤིན་རྗེ་ -འི་ འཇིག་རྟེན་ དུ་ སྐྱེས་པ་ -ར་ འགྱུར་ ལ་ །

source: a householder bodhisattva may pull all of them out from those hells, the animal realm, and the preta world of Yama and establish them in the state of a pratyekabuddha.
bo: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ ཁྱིམ་པ་ ཞིག་ གིས་ སེམས་ཅན་ དེ་དག་ ཐམས་ཅད་ སེམས་ཅན་ དམྱལ་བ་ དང་ ། དུད་འགྲོ་ དང་ ། ཡི་དགས་ དང་ ། གཤིན་རྗེ་ -འི་ འཇིག་རྟེན་ ནས་ བཏོན་ ཏེ་ ། རང་ སངས་རྒྱས་ ཉིད་ ལ་ བཀོད་པ་ བས་

source: But another ordained bodhisattva may just give a morsel of food to one sentient being born as an animal.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ རབ་ཏུ་ བྱུང་བ་ གཞན་ གང་ཞིག་ གིས་ ཐ་ན་ དུད་འགྲོ་ -འི་ སྐྱེ་གནས་ སུ་ སྐྱེས་པ་ -འི་ སེམས་ཅན་ ལ་ སྦྱིན་པ་ ཁམ་ གཅིག་ ཙམ་ ཞིག་ བྱིན་པ་ -ར་ གྱུར་ ན་ །

source: Compared to the first, the second would engender a greater merit, an uncountably greater merit.
bo: དེ་ ནི་ དེ་བ་ -ས་ ཆེས་ བསོད་ནམས་ མང་བ་ དང་ ། ཆེས་ བསོད་ནམས་ གྲངས་མེད་པ་ སྐྱེད་པ་ -ར་ འགྱུར་ རོ་ །

source: by not grasping at the eye and not perceiving form,
bo: མིག་ གཟུང་ དུ་ མེད་པ་ དང་ ། གཟུགས་ དམིགས་ སུ་ མེད་པ་ -འི་ ཕྱིར་ །

source: the form-base, and
bo: གཟུགས་ ཀྱི་ ཁམས་ དང་ ། །

source: Mañjuśrī, a bodhisattva may establish as many sentient beings as there are atomic particles in a great trichiliocosm into the state of a pratyekabuddha, but he may still have no belief in this Dharma teaching.
bo: འཇམ་དཔལ་ བྱང་ཆུབ་ སེམས་དཔའ་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ འདི་ ལ་མོ་ -ས་པ་ གང་ལ་ལ་ ཞིག་ གིས་ སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་པོ་ -འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཀྱི་ རྡུལ་ ཕྲ་རབ་ ཀྱི་ རྡུལ་ སྙེད་ ཀྱི་ སེམས་ཅན་ རང་རྒྱལ་བ་ ཉིད་ ལ་ བཀོད་པ་ བས་ ནི་

source: Another bodhisattva, Mañjuśrī, who believes in this Dharma teaching
bo: འཇམ་དཔལ་ བྱང་ཆུབ་ སེམས་དཔའ་ གཞན་ གང་ཞིག་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ འདི་ ལ་མོ་ -ས་པ་ -ར་ གྱུར་ ན་ ། །

source: engenders much more merit than the first.
bo: དེ་ ནི་ དེ་བ་ -ས་ ཆེས་ བསོད་ནམས་ མང་ དུ་ སྐྱེད་པ་ -ར་ གྱུར་ ན་ །

source: All those bodhisattvas would thus produce merit through their acts of giving.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ དེ་དག་ གི་ སྦྱིན་པ་ ལས་ བྱུང་བ་ -འི་ བསོད་ནམས་ མངོན་པར་ འདུ་ བྱ་བ་

source: But another bodhisattva, pure in his inclinations and disciplined, whether householder or ordained,
bo: བྱང་ཆུབ་ སེམས་དཔའ་ ཁྱིམ་པ་ -འམ་ ། རབ་ཏུ་ བྱུང་བ་ བསམ་པ་ དག་པ་ ། ཚུལ་ཁྲིམས་ དང་ ལྡན་པ་ གཞན་ གང་ཞིག་

source: Offering in this way, he would give this gift for as many eons as there are atomic particles of dust in a great trichiliocosm.
bo: དེ་ལྟར་ ཕུལ་བ་ -ས་ བསྐལ་པ་ སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་པོ་ -འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཀྱི་ རྡུལ་ ཕྲ་རབ་ ཀྱི་ རྡུལ་ སྙེད་ དུ་ འབུལ་བ་ -ར་ ཕུལ་བ་ བས་ ནི་ །

source: But another bodhisattva may teach just a four-line stanza from this Dharma method to another bodhisattva.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ གཞན་ གང་ཞིག་ གི་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ འདི་ ལས་ ཐ་ན་ ཚིག་ བཞི་པ་ -འི་ ཚིགས་ སུ་ བཅད་པ་ གཅིག་ ཙམ་ ཞིག་ བྱང་ཆུབ་ སེམས་དཔའ་ གཞན་ ལ་ བསྟན་པ་ -ར་ གྱུར་ ན་ །

source: In this way, he would offer such gifts for eons as numerous as the grains of sand in the Ganges.
bo: དེ་ལྟར་ ཕུལ་བ་ -ས་ བསྐལ་པ་ གང་ གཱའི་ བྱེ་མ་ ལྟར་ གྲངས་མེད་པ་ སྙེད་ དུ་ འབུལ་བ་ -ར་ ཕུལ་བ་ བས་ ནི་

source: But another bodhisattva may believe in this Dharma teaching and
bo: བྱང་ཆུབ་ སེམས་དཔའ་ གཞན་ གང་ཞིག་ གིས་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ འདི་ ལ་མོ་ -ས་པ་ -ར་ བྱས་ ན་ །

source: teach just a single four-foot stanza from it to another bodhisattva.
bo: འདི་ ལས་ ཐ་ན་ ཚིག་ བཞི་པ་ -འི་ ཚིགས་ སུ་ བཅད་པ་ གཅིག་ ཙམ་ ཞིག་ བྱང་ཆུབ་ སེམས་དཔའ་ གཞན་ ལ་ བསྟན་ ཏམ་ །

source: Compared to the merit he would produce, the production of merit in the first instance, consisting of the bodhisattvas’ acts of giving, would not even amount to a hundredth part.
bo: བསོད་ནམས་ མངོན་པར་ འདུ་ བྱ་བ་ དེ་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ དེ་དག་ གི་ སྦྱིན་པ་ ལས་ བྱུང་བ་ -འི་ བསོད་ནམས་ མངོན་པར་ འདུ་ བྱ་བ་ སྔ་མ་ དེ་ -ས་ ནི་ བརྒྱ་ -འི་ ཆ་ -ར་ ཡང་ ཉེ་བར་ མི་ འགྲོ་ -འོ་ །

source: He would then attend upon each tathāgata, and the corresponding bodhisattvas and hearers, for as many eons as there are atomic particles in inexpressibly numerous, tens of quintillions of buddhafields.
bo: དེ་བཞིན་ གཤེགས་པ་ བྱང་ཆུབ་ སེམས་དཔའ་ དང་ བཅས་ ། ཉན་ཐོས་ དང་ བཅས་པ་ རེ་རེ་ ལ་ ཡང་ བསྐལ་པ་ སངས་རྒྱས་ ཀྱི་ ཞིང་ བརྗོད་ དུ་ མེད་པ་ བྱེ་བ་ ཁྲག་ཁྲིག་ འབུམ་ཕྲག་ བཅུ་ -འི་ རྡུལ་ ཕྲ་རབ་ ཀྱི་ རྡུལ་ སྙེད་ དུ་

source: He would offer robes, alms-food, bedding, seats, remedies for exhaustion, medicinal herbs, and provisions.
bo: ན་བཟའ་ དང་ ། ཞལ་ཟས་ དང་ ། གཟིམས་ ཆ་ དང་ ། གདན་ དང་ ། སྙུན་ གྱི་ གསོས་ སྨན་ དང་ ། ཡོ་བྱད་ རྣམས་ ཀྱིས་ ཀྱང་ བསྙེན་བཀུར་ བྱེད་ ལ་ །

source: Compared to the merit he would produce, the production of merit in the first instance, consisting of the bodhisattvas’ acts of giving, would not even amount to a hundredth part.
bo: བསོད་ནམས་ མངོན་པར་ འདུ་ བྱ་བ་ དེ་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ དེ་དག་ གི་ སྦྱིན་པ་ ལས་ བྱུང་བ་ -འི་ བསོད་ནམས་ མངོན་པར་ འདུ་ བྱ་བ་ སྔ་མ་ དེ་ -ས་ ནི་ བརྒྱ་ -འི་ ཆ་ -ར་ ཡང་ ཉེ་བར་ མི་ འགྲོ་ -འོ་ ། །

source: And why?
bo: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན་ ། །

source: It would not even count for one thousandth or one-billionth of it. It would not even count as any part, any number worthy of consideration, simile or approximation of any kind.
bo: སྟོང་ གི་ ཆ་ དང་ ། འབུམ་ གྱི་ ཆ་ དང་ ། བྱེ་བ་ ཕྲག་ འབུམ་ གྱི་ ཆ་ དང་ ། གྲངས་ དང་ ཆ་ དང་ ། བགྲང་བ་ དང་ ། དཔེ་ དང་ ། རྒྱུ་ -ར་ ཡང་ ཉེ་བར་ མི་ འགྲོ་ -འོ་ །

source: The seal of non-returning bodhisattvas is to hear this Dharma teaching.
bo: ཆོས་ ཀྱི་ རྣམ་ གྲངས་ འདི་ ཐོས་པ་ ནི་ བྱང་ཆུབ་ སེམས་དཔའ་ ཕྱིར་ མི་ ལྡོག་པ་ རྣམས་ ཀྱི་ ཕྱག་རྒྱ་ ཡིན་པ་ -འི་ ཕྱིར་ རོ་ ། །

source: “Mañjuśrī, a bodhisattva might establish the sentient beings of all the world spheres in the ten directions in the state of one who follows out of conviction.
bo: འཇམ་དཔལ་ གལ་ཏེ་ བྱང་ཆུབ་ སེམས་དཔའ་ ལ་ལ་ ཞིག་ གིས་ ཕྱོགས་ བཅུ་ -འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཀྱི་ སེམས་ཅན་ ཐམས་ཅད་ དད་པ་ -ས་ རྗེས་སུ་ འབྲང་བ་ ཉིད་ ལ་ བཀོད་པ་ བས་ ནི་ །

source: another bodhisattva might establish a single sentient being in the state of one who follows the meaning.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ གཞན་ གང་ཞིག་ གིས་ སེམས་ཅན་ གཅིག་ཅིག་ དོན་ གྱི་ རྗེས་སུ་ འབྲང་བ་ ཉིད་ ལ་ བཀོད་པ་ -ར་ གྱུར་ ན་ །

source: In that case, the latter would engender incalculably greater merit.
bo: དེ་ ནི་ དེ་བ་ -ས་ ཆེས་ བསོད་ནམས་ གྲངས་མེད་པ་ སྐྱེད་པ་ -ར་ འགྱུར་ རོ་ ། །

source: “Mañjuśrī, a bodhisattva might establish the sentient beings of all the world spheres in the ten directions in the state of one who follows the meaning.
bo: འཇམ་དཔལ་ གལ་ཏེ་ བྱང་ཆུབ་ སེམས་དཔའ་ ལ་ལ་ ཞིག་ གིས་ ཕྱོགས་ བཅུ་ -འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཀྱི་ སེམས་ཅན་ ཐམས་ཅད་ དོན་ གྱི་ རྗེས་སུ་ འབྲང་བ་ ཉིད་ ལ་ བཀོད་པ་ བས་

source: another bodhisattva might establish a single sentient being in the state of one who follows the Dharma.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ གཞན་ གང་ཞིག་ གིས་ སེམས་ཅན་ གཅིག་ཅིག་ ཆོས་ ཀྱི་ རྗེས་སུ་ འབྲང་བ་ ཉིད་ ལ་ བཀོད་པ་ -ར་ གྱུར་

source: “Mañjuśrī, a bodhisattva might establish the sentient beings of all the world spheres in the ten directions in the state of one who follows the Dharma.
bo: འཇམ་དཔལ་ གལ་ཏེ་ བྱང་ཆུབ་ སེམས་དཔའ་ ལ་ལ་ ཞིག་ གིས་ ཕྱོགས་ བཅུ་ -འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཀྱི་ སེམས་ཅན་ ཐམས་ཅད་ ཆོས་ ཀྱི་ རྗེས་སུ་ འབྲང་བ་ ཉིད་ ལ་ བཀོད་པ་ བས་

source: another bodhisattva might establish a single sentient being in the result of attaining the stream.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ གཞན་ གང་ཞིག་ གིས་ སེམས་ཅན་ གཅིག་ཅིག་ རྒྱུན་ དུ་ ཞུགས་པ་ -འི་ འབྲས་བུ་ ལ་ བཀོད་པ་ -ར་ གྱུར་ ན་ ། །

source: “Mañjuśrī, a bodhisattva might establish the sentient beings of all the world spheres in the ten directions in the result of attaining the stream.
bo: འཇམ་དཔལ་ གལ་ཏེ་ བྱང་ཆུབ་ སེམས་དཔའ་ ལ་ལ་ ཞིག་ གིས་ ཕྱོགས་ བཅུ་ -འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཀྱི་ སེམས་ཅན་ ཐམས་ཅད་ རྒྱུན་ དུ་ ཞུགས་པ་ -འི་ འབྲས་བུ་ ལ་ བཀོད་པ་ བས

source: another bodhisattva might establish a single sentient being in the result of a once-returner.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ གཞན་ གང་ཞིག་ གིས་ སེམས་ཅན་ གཅིག་ཅིག་ ལན་ཅིག་ ཕྱིར་ འོང་བ་ -འི་ འབྲས་བུ་ ལ་ བཀོད་པ་ -ར་ གྱུར་པ

source: “Mañjuśrī, a bodhisattva might establish the sentient beings of all the world spheres in the ten directions in the result of a once-returner.
bo: འཇམ་དཔལ་ གལ་ཏེ་ བྱང་ཆུབ་ སེམས་དཔའ་ ལ་ལ་ ཞིག་ གིས་ ཕྱོགས་ བཅུ་ -འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཀྱི་ སེམས་ཅན་ ཐམས་ཅད་ ལན་ཅིག་ ཕྱིར་ འོང་བ་ -འི་ འབྲས་བུ་ ལ་ བཀོད་པ་ བས་
