Repository: OpenPecha-Data/0fbd31ce377b49a79da3bbcf2402ad48
Catalog: *.po
Languages: bo

source: “It is as follows: Mañjuśrī,
bo: འཇམ་དཔལ་ འདི་ལྟ་སྟེ་ དཔེར་ན་ །

source: in the great ocean there is a great, precious jewel called Fulfilling All Wishes.
bo: རྒྱ་མཚོ་ ཆེན་པོ་ -འི་ ནང་ ན་ ནོར་བུ་ རིན་པོ་ཆེ་ ཆེན་པོ་ བསམ་པ་ ཐམས་ཅད་ ཡོངས་སུ་ རྫོགས་པ་ -ར་ བྱེད་པ་ ཞེས་ བྱ་བ་ ཞིག་ ཡོད་ དེ་ །

source: I shall teach a fitting dharma.
bo: ཇི་ལྟར་ རྗེས་སུ་ འཐུན་པ་ -འི་ ཆོས་ བསྟན་པ་ -ར་ བྱ་ -འོ་ །

source: Mañjuśrī, when the teaching of the Dharma is taken as a point of reference for an unreal tathāgata who has not arisen nor ceased, and who is non-existent and primordially unborn,
bo: འཇམ་དཔལ་ ཆོས་སྟོན་པ་ -ར་ དམིགས་པ་ ལས་ ། དེ་བཞིན་ གཤེགས་པ་ མ་བྱུང་བ་ ། མ་ སྐྱེས་པ་ ། མ་ འགགས་པ་ ། ཡོད་པ་ མ་ཡིན་པ་ ། གཟོད་མ་ ཉིད་ ནས་ མ་ སྐྱེས་པ་

source: the designation ‘the Tathāgata, the Arhat, the Perfect and Complete Buddha’ becomes established in the world.
bo: འཇིག་རྟེན་ ན་ ། དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་པ་ -ར་ རྫོགས་པ་ -འི་ སངས་རྒྱས་ ཞེས་ བྱ་བ་ -ར་ འདོགས་པ་ འབྱུང་ ངོ་ ། །

source: “In the very same way, Mañjuśrī, the Tathāgata, the Arhat, the Perfect and Complete Buddha does not form mental constructs
bo: འཇམ་དཔལ་ དེ་བཞིན་ དུ་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་པ་ -ར་ རྫོགས་པ་ -འི་ སངས་རྒྱས་ ཀྱང་ རྟོག་པ་ -ར་ མི་ བྱེད་ །

source: It is inconceivable, free from what can be conceived, and free from mind, mentality, and consciousness.
bo: སེམས་ མེད་པ་ སེམས་ དང་ ཡིད་ དང་ རྣམ་པ་ -ར་ ཤེས་པ་ དང་ བྲལ་བ་ ཡིན་ ནོ་ །

source: He does not think or ponder.
bo: རྣམ་པ་ -ར་ རྟོག་པ་ -ར་ མི་ བྱེད་ ། སེམས་པ་ -ར་ མི་ བྱེད་ །

source: He is not obtained, not obtainable.
bo: མ་ ཐོབ་པ་ ཐོབ་པ་ -ར་ བྱ་བ་ མ་ ཡིན་ །

source: He is inconceivable, free from what can be conceived, and free from mind, mentality, and consciousness.
bo: རྣམ་པ་ -ར་ སེམས་པ་ -ར་ མི་ བྱེད་ ཅིང་ ། སེམས་པ་ མེད་པ་ ། སེམས་ དང་ ། ཡིད་ དང་ ། རྣམ་པ་ -ར་ ཤེས་པ་ དང་ བྲལ་བ་ །

source: He is non-grasping, the act of not holding on.
bo: མ་ བཟུང་བ་ ། ཡོངས་སུ་ གཟུང་བ་ -ར་ བྱ་བ་ མ་ཡིན་པ་ །

source: He has eliminated arbitrary truths as well as attachment, aversion, and delusion.
bo: སོ་སོ་ -འི་ བདེན་པ་ བསལ་བ་ ། འདོད་ཆགས་ བསལ་བ་ ། ཞེ་སྡང་ བསལ་བ་ ། གཏི་མུག་ བསལ་བ་ །

source: He is neither true nor false,
bo: བདེན་པ་ མ་ ཡིན་ ། བརྫུན་པ་ མ་ ཡིན་ །

source: neither permanent nor impermanent,
bo: རྟག་པ་ མ་ ཡིན་ ། མི་རྟག་པ་ མ་ ཡིན་ །

source: neither shining nor not shining,
bo: འོད་མ་ ཡིན་ འོད་ མེད་པ་ མ་ ཡིན་ །

source: neither worldly nor non-worldly.
bo: འཇིག་རྟེན་ མ་ ཡིན་ ། འཇིག་རྟེན་ མེད་པ་ མ་ ཡིན་ །

source: He is without deliberation or analysis. He is non-arisen and unceasing.
bo: རྟོག་པ་ མེད་པ་ དཔྱོད་པ་ མེད་པ་ མ་ སྐྱེས་པ་ མ་ འགགས་པ་ །

source: “He is inconceivable, imponderable, essence-less, and not possibly an essence.
bo: བསམ་ དུ་ མེད་པ་ རབ་ཏུ་ བསམ་ དུ་ མེད་པ་ ། རང་བཞིན་ མེད་པ་ རང་བཞིན་ གྱི་ གཞི་མེད་པ་ །

source: He is empty of non-existence;
bo: རང་བཞིན་ སྟོང་པ་ བླང་བ་ མེད་པ་ །

source: He is not bliss,
bo: ཀུན་ ཏུ་ དགའ་བ་ མེད་པ་ །

source: he is free from bliss;
bo: ཀུན་ ཏུ་ དགའ་བ་ དང་ བྲལ་བ་ །

source: he is the destruction of bliss.
bo: ཀུན་ ཏུ་ དགའ་བ་ -ས་ ངེས་པར་ བཅོམ་པ་ །

source: When it is attached to the top of a banner
bo: དེ་ རྒྱལ་མཚན་ གྱི་ རྩེ་མོ་ ལ་བཏགས་ ན་

source: and a sentient being makes a wish, sentient beings will perceive corresponding words coming forth from the jewel. However, that great, precious jewel does not form mental constructs or concepts.
bo: དེ་ལས་ སེམས་ཅན་ གང་ གིས་ བསམ་པ་ ཅི་འདྲ་བ་ དེ་ལྟ་ བུ་ -འི་ སྒྲ་ འབྱུང་བ་ -ར་ སེམས་ཅན་ རྣམས་ ཀྱིས་ ཀུན་ ཏུ་ ཤེས་ ཀྱང་ ནོར་བུ་ རིན་པོ་ཆེ་ ཆེན་པོ་ དེ་ ནི་ རྟོག་པ་ -ར་ མི་ བྱེད

source: He is not a conventional expression;
bo: བརྗོད་ དུ་ མེད་པ་ །

source: he is the cutting off of conventional expressions.
bo: བརྗོད་པ་ ཡང་དག་པ་ -ར་ རྒྱུན་ ཆད་པ་ །

source: He cannot be clung to.
bo: མངོན་པར་ ཞེན་པ་ -ར་ བྱ་བ་ མེད་པ་ །

source: he is free from striving or giving anything up.
bo: དོར་བ་ མེད་པ་ །

source: It does not think or ponder.
bo: རྣམ་པ་ -ར་ སེམས་པ་ -ར་ མི་ བྱེད་ ཅིང་ །

source: He cannot be counted;
bo: གྲངས་ སུ་ བགྲང་བ་ མ་ཡིན་པ་ དང་ །

source: he is free from counting.
bo: གྲངས་ སུ་ བགྲང་བ་ དང་ །

source: and has cut off all conventional expressions.
bo: བརྗོད་པ་ ཐམས་ཅད་ ཡང་དག་པ་ -ར་ རྒྱུན་ ཆད་པ་ །

source: he has cut off all movement
bo: འགྲོ་བ་ ཐམས་ཅད་ ཡང་དག་པ་ -ར་ རྒྱུན་ ཆད་པ་ །

source: He is not movement, he has reached non-movement;
bo: འགྲོ་བ་ མེད་པ་ འགྲོ་བ་ -ར་ འགྲོ་བ་ མེད་པ་ །

source: He is not space,
bo: ནམ་མཁའ་ མ་ ཡིན་ །

source: he is ungraspable.
bo: ཐ་སྙད་ མེད་པ་ །

source: “He cannot be seen or beholden,
bo: བལྟ་ -ར་ མི་སྣང་བ་ ། མི་ མཐོང་བ་ གཟུང་ དུ་ མེད་པ་ །

source: not lack of space.
bo: བླ་གབ་ མེད་པ་ མ་ ཡིན་ །

source: not an assemblage,
bo: ཚོགས་པ་ མ་ ཡིན་ །

source: and not a non-assemblage.
bo: ཚོགས་པ་ མེད་པ་ མ་ ཡིན་ །

source: He is neither mentally constructed nor not mentally constructed.
bo: རྣམ་པ་ -ར་ བརྟགས་པ་ མ་ ཡིན་ ། རྣམ་པ་ -ར་ བསྒྲུབས་པ་ མ་ ཡིན་ །

source: He is not visible,
bo: བལྟ་ -ར་ སྣང་བ་ མ་ ཡིན་ །

source: not to be described,
bo: བསྟན་པ་ -ར་ བྱ་བ་ མ་ ཡིན་ །

source: He is not established, shown, afflicted, or purified.
bo: ཀུན་ ཏུ་ བསྟན་པ་ མ་ ཡིན་ ། ཀུན་ ནས་ ཉོན་མོངས་པ་ ཅན་ མ་ ཡིན་ ། ཡོངས་སུ་ སྦྱང་བ་ -ར་ འོས་པ་ མ་ ཡིན་ །

source: He is not established, shown, afflicted, or purified.
bo: ཀུན་ ཏུ་ བསྟན་པ་ མ་ ཡིན་ ། ཀུན་ ནས་ ཉོན་མོངས་པ་ ཅན་ མ་ ཡིན་ ། ཡོངས་སུ་ སྦྱང་བ་ -ར་ འོས་པ་ མ་ ཡིན་ །

source: He is not name,
bo: མིང་མེད་པ་ །

source: not form,
bo: གཟུགས་ མེད་པ་ །

source: not sign;
bo: མཚན་མ་ མེད་པ་ །

source: not karma,
bo: ལས་ མེད་པ་ །

source: not the maturation of karma.
bo: ལས་ ཀྱི་ རྣམ་པ་ -ར་ སྨིན་པ་ མེད་པ་ །

source: He is not past,
bo: འདས་པ་ མ་ ཡིན་ །

source: not future,
bo: མ་འོངས་པ་ མ་ ཡིན་ །

source: not present.
bo: ད་ལྟར་ བྱུང་བ་ མ་ ཡིན་ །

source: He is nothing whatsoever.
bo: ཅི་ཡང་ མ་ ཡིན་ །

source: He is without impurity,
bo: ཉོན་མོངས་པ་ མེད་པ

source: without syllables,
bo: ཡི་གེ་ མེད་པ་ །

source: without voice,
bo: སྒྲ་ སྐད་ མེད་པ་ །

source: not speech.
bo: སྒྲ་མེད་པ་ །

source: beyond a voice,
bo: སྒྲ་ སྐད་ ཐམས་ཅད་ ལས་ ཡང་དག་པ་ -ར་ འདས་པ་ །

source: He is not a characteristic,
bo: མཚན་ཉིད་ མེད་པ་ །

source: he is free from all characteristics;
bo: མཚན་ཉིད་ ཐམས་ཅད་ དང་ བྲལ་བ་ །

source: not perceived inside, outside, or in between.
bo: ནང་ ན་ མི་ དམིགས་ ། ཕྱི་རོལ་ ན་ མི་ དམིགས་ ། གཉི་ག་ མེད་པ་ -ར་ ཡང་ མི་ དམིགས་པ་ ཡིན་མོད་ ཀྱི་ །

source: “And Mañjuśrī, the awareness jewel of the Tathāgata is completely pure in its intent, and is fixed at the top of the banner of great compassion.
bo: འཇམ་དཔལ་ འོན་ཀྱང་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ལྷག་པ་ -འི་ བསམ་པ་ ཡོངས་སུ་ དག་པ་ -འི་ ཡེ་ཤེས་ རིན་པོ་ཆེ་ སྙིང་རྗེ་ ཆེན་པོ་ -འི་ རྒྱལ་མཚན་ གྱི་ རྩེ་མོ་ ལ་བཏགས་ ན་ །

source: According to his or her inclinations and beliefs, a sentient being perceives a Dharma teaching issuing forth from that jewel.
bo: དེ་ལས་ སེམས་ཅན་ གང་ཡིན་པ་ དེ་ -འི་ བསམ་པ་ དང་ མོས་པ་ ཇི་ལྟ་བ་ དེ་ལྟ་ བུ་ -འི་ ཆོས་ བསྟན་པ་ འབྱུང་བ་ -ར་ སེམས་ཅན་ རྣམས་ ཀྱིས་ ཀུན་ ཏུ་ ཤེས་ ཀྱང་ །

source: And in this respect, Mañjuśrī, the Tathāgata is the same, neutral, without concepts, and does not make any distinctions.
bo: དེ་བཞིན་ གཤེགས་པ་ ནི་ དེ་དག་ ལ་ ཡང་ ཐམས་ཅད་ དུ་ མཉམ་ ཞིང་ བཏང་སྙོམས་ ལ་ རྣམ་པ་ -ར་ མི་ རྟོག་ ཅིང་ བྱེ་བྲག་ མི་ འབྱེད་ དོ་ ། །

source: “It is as follows: Mañjuśrī,
bo: འཇམ་དཔལ་ འདི་ལྟ་སྟེ་ དཔེར་ན་ །

source: sentient beings perceive an echo issuing forth as the intimation of someone else’s speech.
bo: བྲག་ཅ་ ནི་ གཞན་ གྱི་ རྣམ་པ་ -ར་ རིག་པ་ ལས་ འབྱུང་བ་ -ར་ སེམས་ཅན་ རྣམས་ ཀྱིས་ ཀུན་ ཏུ་ ཤེས་

source: “But that echo is not past, future, or present.
bo: ཀྱང་ དེ་ ནི་ འདས་པ་ མ་ ཡིན་ ། མ་འོངས་པ་ མ་ ཡིན་ ། ད་ལྟར་ བྱུང་བ་ མ་ ཡིན་ །

source: It cannot be perceived inside, outside, or in between.
bo: ནང་ ན་མ་ ཡིན་ ། ཕྱི་རོལ་ མ་ ཡིན་ ། གཉི་ག་ མེད་པ་ -ར་ ཡང་ མི་ དམིགས་ ཏེ་ །

source: It is non-arisen
bo: མ་ སྐྱེས་པ་ །

source: and unceasing.
bo: མ་ འགགས་པ་ །

source: It is not cut off,
bo: ཆད་པ་ མ་ ཡིན་ །

source: not permanent;
bo: རྟག་པ་ མ་ ཡིན་ །

source: it is not endowed with awareness,
bo: ཤེས་པ་ དང་ ལྡན་པ་ མ་ ཡིན་ །

source: nor is it without awareness.
bo: ཤེས་པ་ དང་ མི་ ལྡན་པ་ མ་ ཡིན་ །

source: It is neither wisdom
bo: ཤེས་རབ་ མ་ ཡིན་ །

source: nor not wisdom,
bo: ཤེས་རབ་ མེད་པ་ མ་ ཡིན་ །

source: neither knowledge
bo: རིག་པ་ མ་ ཡིན་ །

source: nor ignorance,
bo: རིག་པ་ མེད་པ་ མ་ ཡིན་ །

source: neither liberation
bo: རྣམ་པ་ -ར་ གྲོལ་བ་ མ་ ཡིན་ །

source: nor not liberation.
bo: རྣམ་པ་ -ར་ གྲོལ་བ་ མེད་པ་ མ་ ཡིན་ །

source: “It is neither blameworthy
bo: ཁ་ན་མ་ཐོ་བ་ དང་ བཅས་པ་ མ་ ཡིན་ །

source: nor free from blame,
bo: ཁ་ན་མ་ཐོ་བ་ མེད་པ་ མ་ ཡིན་ །

source: neither recollection
bo: དྲན་པ་ དང་ ལྡན་པ་ མ་ ཡིན་ །

source: nor non-recollection,
bo: དྲན་པ་ དང་ མི་ ལྡན་པ་ མ་ ཡིན་ །

source: neither placed
bo: གནས་པ་ དང་ ལྡན་པ་ མ་ ཡིན་ །

source: nor unplaced,
bo: གནས་པ་ དང་ མི་ ལྡན་པ་ མ་ ཡིན་ །

source: nor not sitting.
bo: མི་ འདུག་པ་ མ་ ཡིན་ །

source: neither sitting
bo: འདུག་པ་ མ་ ཡིན་ །

source: It is not the earth element,
bo: ས་ -འི་ ཁམས་ མ་ ཡིན་ །

source: not the water element,
bo: ཆུ་ -འི་ ཁམས་ མ་ ཡིན་ །

source: not the fire element,
bo: མེ་ -འི་ ཁམས་ མ་ ཡིན་ །

source: and not the wind element.
bo: རླུང་ གི་ ཁམས་ མ་ ཡིན་ །

source: It is neither co-produced
bo: འདུས་བྱས་ མ་ ཡིན་ །

source: nor unproduced,
bo: འདུས་མ་བྱས་ མ་ ཡིན་ །

source: neither free from elaboration
bo: སྤྲོས་པ་ ཡོད་པ་ མ་ ཡིན་ །

source: nor with elaboration,
bo: སྤྲོས་པ་ མེད་པ་ མ་ ཡིན་ །

source: neither speech
bo: སྒྲ་ མ་ ཡིན་ །

source: nor not speech,
bo: སྒྲ་མེད་པ་ མ་ ཡིན་ །

source: and neither visible
bo: བལྟ་ -ར་ སྣང་བ་ མ་ ཡིན་ །

source: nor invisible.
bo: བལྟ་ -ར་ མི་སྣང་བ་ མ་ ཡིན་ །

source: “It is without syllables,
bo: ཡི་གེ་ མེད་པ་ །

source: without voice,
bo: སྒྲ་མེད་པ་ །

source: beyond voice
bo: སྒྲ་ ལས་ ཡང་དག་པ་ -ར་ འདས་པ་ །

source: without comparison,
bo: གཞལ་ དུ་ མེད་པ་ །

source: beyond comparison,
bo: གཞལ་བ་ ལས་ ཡང་དག་པ་ -ར་ འདས་པ་ །

source: not a characteristic,
bo: མཚན་ཉིད་ མེད་པ་ །

source: free from characteristics.
bo: མཚན་ཉིད་ དང་ བྲལ་བ་ །

source: It is neither peace nor not peace,
bo: ཞི་བ་ མ་ ཡིན་ ། མ་ ཞི་བ་ མ་ ཡིན་ །

source: neither long nor short,
bo: རིང་པོ་ མ་ ཡིན་ ། ཐུང་ངུ་མ་ ཡིན་ །

source: neither sentient nor insentient,
bo: སེམས་པ་ ཡོད་པ་ མ་ ཡིན་ ། སེམས་པ་ མེད་པ་ མ་ ཡིན་ །

source: neither mental nor not mental.
bo: སེམས་ ཡོད་པ་ མ་ ཡིན་ ། སེམས་ མེད་པ་ མ་ ཡིན་ །

source: It is neither to be beheld, nor not to be beheld.
bo: སྣང་བ་ མ་ ཡིན་ ། མི་སྣང་བ་ མ་ ཡིན་ །

source: free from mind, mentality, and consciousness.
bo: སེམས་ དང་ ། ཡིད་ དང་ ། རྣམ་པ་ -ར་ ཤེས་པ་ དང་ བྲལ་བ་ །

source: not analysis,
bo: དཔྱོད་པ་ མེད་པ་ །

source: It is not deliberation,
bo: རྟོག་པ་ མེད་པ་ །

source: It is empty of the nature of seeing.
bo: བསྟན་ དུ་ཡོད་པ་ མ་ ཡིན་ ། བསྟན་ དུ་ མེད་པ་ མ་ ཡིན་ །

source: It is non-recollection,
bo: དྲན་པ་ མེད་པ་ །

source: non-mental-placement.
bo: ཡིད་ ལ་ བྱེད་པ་ མེད་པ་ །

source: In all regards it is the same, neutral, without concepts, and does not make any distinctions.
bo: ཐམས་ཅད་ དུ་ མཉམ་ ཞིང་ བཏང་སྙོམས་ ལ་ རྣམ་པ་ -ར་ མི་ རྟོག་ ཅིང་ བྱེ་བྲག་ མི་ འབྱེད་པ་ །

source: It is beyond the three times.
bo: དུས་གསུམ་ ལས་ ཡང་དག་པ་ -ར་ འདས་པ་ ཡིན་

source: However,
bo: མོད་ ཀྱི་ །

source: “In the very same way, Mañjuśrī, the Tathāgata, the Arhat, the Perfect and Complete Buddha is not past, future, or present.
bo: འཇམ་དཔལ་ དེ་བཞིན་ དུ་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་པ་ -ར་ རྫོགས་པ་ -འི་ སངས་རྒྱས་ ཀྱང་ འདས་པ་ མ་ ཡིན་ ། མ་འོངས་པ་ མ་ ཡིན་ ། ད་ལྟར་ བྱུང་བ་ མ་ ཡིན་ །

source: He cannot be perceived inside, outside, or in between.
bo: ནང་ ན་མ་ ཡིན་ ཕྱི་རོལ་ ན་མ་ ཡིན་ ཞིང་ ། གཉི་ག་ མེད་པ་ -ར་ ཡང་ མི་ དམིགས་ ཏེ་ །

source: He is non-arisen
bo: མ་ སྐྱེས་པ་ །

source: unceasing.
bo: མ་ འགགས་པ་ །

source: He is not cut off,
bo: ཆད་པ་ མ་ ཡིན་ །

source: not permanent;
bo: རྟག་པ་ མ་ ཡིན་ །

source: he is not endowed with awareness, nor is he without awareness.
bo: ཤེས་པ་ དང་ ལྡན་པ་ མ་ ཡིན་ ། ཤེས་པ་ དང་ མི་ ལྡན་པ་ མ་ ཡིན་ །

source: He is neither with wisdom nor without wisdom.
bo: ཤེས་རབ་ མ་ ཡིན་ ། ཤེས་རབ་ མེད་པ་ མ་ ཡིན་ །

source: He is neither knowledge nor ignorance,
bo: རིག་པ་ མ་ ཡིན་ ། རིག་པ་ མེད་པ་ མ་ ཡིན་ །

source: neither liberation nor not liberation.
bo: རྣམ་པ་ -ར་ གྲོལ་བ་ མ་ ཡིན་ ། རྣམ་པ་ -ར་ གྲོལ་བ་ མེད་པ་ མ་ ཡིན་ །

source: “He is neither blameworthy nor free from blame,
bo: ཁ་ན་མ་ཐོ་བ་ དང་ བཅས་པ་ མ་ ཡིན་ ། ཁ་ན་མ་ཐོ་བ་ མེད་པ་ མ་ ཡིན་ །

source: neither with recollection nor without recollection,
bo: དྲན་པ་ དང་ ལྡན་པ་ མ་ ཡིན་ ། དྲན་པ་ དང་ མི་ ལྡན་པ་ མ་ ཡིན་ །

source: neither placed nor unplaced,
bo: གནས་ དང་ ལྡན་པ་ མ་ ཡིན་ ། གནས་ དང་ མི་ ལྡན་པ་ མ་ ཡིན་ །

source: neither sitting nor not sitting.
bo: འདུག་པ་ མ་ ཡིན་ ། མི་ འདུག་པ་ མ་ ཡིན་ །

source: He is not the earth element,
bo: ས་ -འི་ ཁམས་ མ་ ཡིན་ །

source: not the water element,
bo: ཆུ་ -འི་ ཁམས་ མ་ ཡིན་ །

source: not the fire element,
bo: མེ་ -འི་ ཁམས་ མ་ ཡིན་ །

source: and not the wind element.
bo: རླུང་ གི་ ཁམས་ མ་ ཡིན་ །

source: and sentient beings perceive it to be just that way.
bo: དེ་དག་ ནི་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱིས་ དེ་ ཁོ་ན་ བཞིན་ དུ་ ཀུན་ ཏུ་ ཤེས་པ་ -ར་ འགྱུར་ རོ་ །

source: Mañjuśrī, the echo, the voice of many sounds, comes forth for sentient beings with varied inclinations, as the intimation of the voice of many sounds,
bo: འཇམ་དཔལ་ འོན་ཀྱང་ སེམས་ཅན་ ལྷག་པ་ -འི་ བསམ་པ་ ཐ་དད་པ་ རྣམས་ ཀྱི་ སྒྲ་ སྐད་ དང་ རྣམ་པ་ -ར་ རིག་པ་ སྣ་ཚོགས་ དག་ ལས་ བྲག་ཅ་ -འི་ སྒྲ་ སྐད་ སྣ་ཚོགས་ དག་ འབྱུང་བ་ -ར་ འགྱུར་ ཞིང་ །

source: not the water element,
bo: ཆུ་ -འི་ ཁམས་ མ་ ཡིན་ །

source: not the fire element,
bo: མེ་ -འི་ ཁམས་ མ་ ཡིན་ །

source: and not the wind element.
bo: རླུང་ གི་ ཁམས་ མ་ ཡིན་ །

source: He is neither co-produced nor unproduced,
bo: འདུས་བྱས་ མ་ ཡིན་ ། འདུས་མ་བྱས་ མ་ ཡིན་ །

source: neither elaboration nor non-elaboration,
bo: སྤྲོས་པ་ ཡོད་པ་ མ་ ཡིན་ ། སྤྲོས་པ་ མེད་པ་ མ་ ཡིན་ །

source: neither speech nor not speech,
bo: སྒྲ་ མ་ ཡིན་ ། སྒྲ་མེད་པ་ མ་ ཡིན་ །

source: and neither visible nor invisible.
bo: བལྟ་ -ར་ སྣང་བ་ མ་ ཡིན་ ། བལྟ་ -ར་ མི་སྣང་བ་ མ་ ཡིན་ །

source: “He is without syllables,
bo: ཡི་གེ་ མེད་པ་ །

source: without voice,
bo: སྒྲ་མེད་པ་ །

source: beyond voice,
bo: སྒྲ་ ལས་ ཡང་དག་པ་ -ར་ འདས་པ་ །

source: without comparison,
bo: གཞལ་ དུ་ མེད་པ་ །

source: beyond comparison,
bo: གཞལ་བ་ ལས་ ཡང་དག་པ་ -ར་ འདས་པ་ །

source: not a characteristic,
bo: མཚན་ཉིད་ མེད་པ་ །

source: free from characteristics.
bo: མཚན་ཉིད་ དང་ བྲལ་བ་ །

source: He is neither peaceful nor not peaceful,
bo: ཞི་བ་ མ་ ཡིན་ ། མ་ ཞི་བ་ མ་ ཡིན་ །

source: neither long nor short,
bo: རིང་པོ་ མ་ ཡིན་ ། ཐུང་ངུ་མ་ ཡིན་ །

source: neither mental nor not mental.
bo: སེམས་ ཡོད་པ་ མ་ ཡིན་ ། སེམས་ མེད་པ་ མ་ ཡིན་ །

source: He is neither to be beheld, nor not to be beheld.
bo: སྣང་བ་ མ་ ཡིན་ ། མི་སྣང་བ་ མ་ ཡིན་ །

source: He is non-recollection
bo: དྲན་པ་ མེད་པ་ །

source: He is empty of the nature of seeing.
bo: བསྟན་ ཏུ་ ཡོད་པ་ མ་ ཡིན་ ། བསྟན་ དུ་ མེད་པ་ མ་ ཡིན་ ། རང་བཞིན་ སྟོང་པ་ །

source: and non-mental-placement.
bo: ཡིད་ ལ་ བྱེད་པ་ མེད་པ་ །

source: He is not deliberation,
bo: རྟོག་པ་ མེད་པ་ །

source: not analysis,
bo: དཔྱོད་པ་ མེད་པ་ །

source: and free from mind, mentality, and consciousness.
bo: སེམས་ དང་ ། ཡིད་ དང་ ། རྣམ་པ་ -ར་ ཤེས་པ་ དང་ བྲལ་བ་ །

source: He is beyond the three times.
bo: དུས་གསུམ་ ལས་ ཡང་དག་པ་ -ར་ འདས་པ་ ཡིན་མོད་ ཀྱི་ །

source: In all regards he is the same, neutral, without concepts, and does not make any distinctions.
bo: ཐམས་ཅད་ དུ་ མཉམ་ ཞིང་ བཏང་སྙོམས་ ལ་ རྣམ་པ་ -ར་ མི་ རྟོག་ ཅིང་ བྱེ་བྲག་ མི་ འབྱེད་ ལ་ །

source: Yet, Mañjuśrī, sentient beings with varied beliefs perceive
bo: འཇམ་དཔལ་ འོན་ཀྱང་ སེམས་ཅན་ མོས་པ་ ཐ་དད་པ་ རྣམས་ ཀྱིས་ ལྷག་པ་ -འི་ བསམ་པ་ དང་ །

source: Yet, Mañjuśrī, sentient beings with varied beliefs perceive the speech of the Tathāgata, issuing forth in accordance with their manifold inclinations.
bo: འཇམ་དཔལ་ འོན་ཀྱང་ སེམས་ཅན་ མོས་པ་ ཐ་དད་པ་ རྣམས་ ཀྱིས་ ལྷག་པ་ -འི་ བསམ་པ་ དང་ ། རྣམ་པ་ -ར་ རིག་པ་ སྣ་ཚོགས་ དག་ ལས་ དེ་བཞིན་ གཤེགས་པ་ -འི་ གསུང་ འབྱུང་བ་ -ར་ ཀུན་ ཏུ་ ཤེས་པ་ -ར་ འགྱུར་ རོ་ །

source: the speech of the Tathāgata, issuing forth in accordance with their manifold inclinations.
bo: རྣམ་པ་ -ར་ རིག་པ་ སྣ་ཚོགས་ དག་ ལས་ དེ་བཞིན་ གཤེགས་པ་ -འི་ གསུང་ འབྱུང་བ་ -ར་ ཀུན་ ཏུ་ ཤེས་པ་ -ར་ འགྱུར་ རོ་ ། །

source: “It is as follows: Mañjuśrī,
bo: འཇམ་དཔལ་ འདི་ལྟ་སྟེ་ དཔེར་ན

source: it is through having the earth as their basis and support that all grass, thickets, herbs, and trees grow to become sizeable.
bo: ས་ ལ་ བསྟེན་ ཅིང་ ས་ ལ་ གནས་ ནས་ རྩྭ་ དང་ ཤིང་ གེལ་བ་ དང་ ། རྩི་ དང་ ནགས་ཚལ་ ཐམས་ཅད་ འཕེལ་ ཞིང་ རྒྱས་པ་ དང་ ། ཡངས་པ་ -ར་ འགྱུར་

source: But, Mañjuśrī, the earth does not form mental constructs or concepts.
bo: ཡང་ འཇམ་དཔལ་ ས་ ནི་ རྟོག་པ་ -ར་ མི་ བྱེད་ ། རྣམ་པ་ -ར་ རྟོག་པ་ -ར་ མི་ བྱེད་ དེ་ །

source: With respect to everything it is the same, free from concepts,
bo: ཐམས་ཅད་ དུ་ མཉམ་ ཞིང་ རྣམ་པ་ -ར་ མི་ རྟོག་པ་ །

source: and free from mind, mentality, and consciousness.
bo: སེམས་ དང་ ། ཡིད་ དང་ ། རྣམ་པ་ -ར་ ཤེས་པ་ དང་ བྲལ་བ་ ཡིན་ ནོ་ །

source: and free from mind, mentality, and consciousness.
bo: སེམས་ དང་ ། ཡིད་ དང་ ། རྣམ་པ་ -ར་ ཤེས་པ་ དང་ བྲལ་བ་ །

source: free from distinctions.
bo: བྱེ་བྲག་ མི་ འབྱེད་ ཅིང

source: It is free from speculations
bo: སེམས་པ་ -ར་ མི་ བྱེད་ དེ་ ། །

source: “In the same way, Mañjuśrī, it is through having the Tathāgata as their basis and support
bo: འཇམ་དཔལ་ དེ་བཞིན་ དུ་ དེ་བཞིན་ གཤེགས་པ་ ལ་ བརྟེན་ ཅིང་ དེ་བཞིན་ གཤེགས་པ་ ལ་ གནས་ ནས་

source: or of all tīrthikas such as the Carakas, Parivrājakas, and Nirgranthas, and so forth; or of any others, down to the roots of what is wholesome of those stuck in what is wrong; it is through having the Tathāgata as their basis and support that they grow and become sizeable.
bo: དེ་བཞིན་ གཤེགས་པ་ ལ་ བརྟེན་ ཅིང་ དེ་བཞིན་ གཤེགས་པ་ ལ་ གནས་ ནས་ སྤྱོད་པ་པ་ དང་ ། ཀུན་ ཏུ་ རྒྱུ་ དང་ ། གཅེར་བུ་པ་ ལ་སོགས་པ་ མུ་སྟེགས་ ཀྱི་ གནས་ གཞན་ ཐམས་ཅད་ ཀྱི་ དགེ་བ་ -འི་ རྩ་བ་ ཐམས་ཅད་ དང་ །

source: that all the roots of what is wholesome of all sentient beings grow and become sizeable. Whether it is the roots of what is wholesome of those on the Vehicle of the Hearers, on the Pratyekabuddha Vehicle, or on the Great Vehicle;
bo: སེམས་ཅན་ ཉན་ཐོས་ ཀྱི་ ཐེག་པ་པ་ -འམ་ ། རང་ སངས་རྒྱས་ ཀྱི་ ཐེག་པ་ -འམ་ ། ཐེག་པ་ ཆེན་པོ་པ་ ཐམས་ཅད་ ཀྱི་ དགེ་བ་ -འི་ རྩ་བ་ ཐམས་ཅད་ ཀྱང་ འཕེལ་ ཞིང་ རྒྱས་པ་ དང་ ཡངས་པ་ -ར་ འགྱུར་ ལ་ །

source: “However, Mañjuśrī, the Tathāgata does not form mental constructs or concepts.
bo: འཇམ་དཔལ་ འོན་ཀྱང་ དེ་བཞིན་ གཤེགས་པ་ ནི་ རྟོག་པ་ -ར་ མི་ བྱེད་ ། རྣམ་པ་ -ར་ རྟོག་པ་ -ར་ མི་ བྱེད་ དེ་ །

source: or of all tīrthikas such as the Carakas, Parivrājakas, and Nirgranthas, and so forth; or of any others, down to the roots of what is wholesome of those stuck in what is wrong; it is through having the Tathāgata as their basis and support that they grow and become sizeable.
bo: དེ་བཞིན་ གཤེགས་པ་ ལ་ བརྟེན་ ཅིང་ དེ་བཞིན་ གཤེགས་པ་ ལ་ གནས་ ནས་ སྤྱོད་པ་པ་ དང་ ། ཀུན་ ཏུ་ རྒྱུ་ དང་ ། གཅེར་བུ་པ་ ལ་སོགས་པ་ མུ་སྟེགས་ ཀྱི་ གནས་ གཞན་ ཐམས་ཅད་ ཀྱི་ དགེ་བ་ -འི་ རྩ་བ་ ཐམས་ཅད་ དང་ ། ཐ་ན་ ལོག་པ་ ཉིད་ དུ་ ངེས་པ་ རྣམས་ ཀྱི་ དགེ་བ་ -འི་ རྩ་བ་ གཞན་ གང་དག་ ཡིན་པ་ དེ་དག་ ཐམས་ཅད་ ཀྱང་ འཕེལ་ ཞིང་ རྒྱས་པ་ དང་ ཡངས་པ་ -ར་ འགྱུར་ མོད་ ཀྱི་ །

source: Mañjuśrī, the Tathāgata, the Arhat, the Perfect and Complete Buddha has cut off all mental constructs, concepts, points of reference, and mental engagement.
bo: འཇམ་དཔལ་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་པ་ -ར་ རྫོགས་པ་ -འི་ སངས་རྒྱས་ ནི་ རྟོག་པ་ དང་ ། རྣམ་པ་ -ར་ རྟོག་པ་ དང་ ། དམིགས་པ་ དང་ ། ཡིད་ ལ་ བྱེད་པ་ ཐམས་ཅད་ རྒྱུན་ ཆད་པ་ །

source: He is free from mind, mentality, and consciousness;
bo: སེམས་ དང་ ཡིད་ དང་ རྣམ་པ་ -ར་ ཤེས་པ་ དང་ བྲལ་བ་ །

source: he is neither speculation nor the domain of speculation.
bo: རྟོག་གེ་ མ་ ཡིན་ ། རྟོག་གེ་ -འི་ སྤྱོད་ཡུལ་ མ་ ཡིན་ །

source: He is invisible,
bo: མི་སྣང་བ་ །

source: not to be beheld,
bo: མི་ མཐོང་བ་ །

source: not an object of thought or deliberation.
bo: བསམ་ དུ་ མེད་པ་ ། བསམ་པ་ -ར་ བྱ་བ་ མ་ཡིན་པ་ །

source: free from thought,
bo: སེམས་པ་ མེད་པ་ །

source: It is free from mind, mentality, and consciousness.
bo: སེམས་ དང་ ། ཡིད་ དང་ ། རྣམ་པ་ -ར་ ཤེས་པ་ དང་ བྲལ་བ་ །

source: With respect to all, he is the same, neutral, without concepts, and he does not make any distinctions.
bo: ཐམས་ཅད་ དུ་ མཉམ་ ཞིང་ བཏང་སྙོམས་ ལ་ རྣམ་པ་ -ར་ མི་ རྟོག་ ཅིང་ བྱེ་བྲག་ མི་ འབྱེད་ དོ་ ། །

source: “It is as follows: Mañjuśrī,
bo: འཇམ་དཔལ་ འདི་ལྟ་སྟེ་ དཔེར་ན་ །

source: space is everywhere the same,
bo: ནམ་མཁའ་ ནི་ ཐམས་ཅད་ དུ་ མཉམ་ ཞིང་ རྣམ་པ་ -ར

source: free from concepts
bo: མི་ རྟོག་ ལ་ །

source: and distinctions.
bo: བྱེ་བྲག་ མི་ འབྱེད་ དེ་ །

source: It is non-arisen
bo: མ་ སྐྱེས་པ

source: and unceasing;
bo: མ་ འགགས་པ་ །

source: it is not past, future, or present.
bo: འདས་པ་ མ་ ཡིན་ ། མ་འོངས་པ་ མ་ ཡིན་ ། ད་ལྟར་ བྱུང་བ་ མ་ ཡིན་ །

source: It is indefinable,
bo: མཚན་གཞི་ མེད་པ་ །

source: non-elaborate,
bo: སྤྲོས་པ་ མེད་པ་ །

source: and formless;
bo: གཟུགས་ མེད་པ་ །

source: it cannot be shown
bo: བསྟན་ དུ་ མེད་པ་ །

source: or made known.
bo: རྣམ་པ་ -ར་ རིག་པ་ མེད་པ་ །

source: It is without contact,
bo: རེག་པ་ མེད་པ་ །

source: without dwelling,
bo: གནས་ མེད་པ་ །

source: not comparable,
bo: གཞལ་ དུ་ མེད་པ་ །

source: and beyond compare.
bo: གཞལ་བ་ ལས་ ཡང་དག་པ་ -ར་ འདས་པ་ །

source: It has no simile
bo: དཔེ་མེད་པ་ །

source: and is beyond all similes.
bo: དཔེ་ ལས་ ཡང་དག་པ་ -ར་ འདས་པ་ །

source: It has no basis;
bo: མི་ གནས་པ་ །

source: it is ungraspable
bo: གཟུང་བ་ མེད་པ་ །

source: and beyond visible range.
bo: མིག་ གི་ ལམ་ ལས་ ཡང་དག་པ་ -ར་ འདས་པ་

source: It has no characteristic;
bo: མཚན་ཉིད་ མེད་པ

source: it is without syllables, voice, and mental engagement.
bo: ཡི་གེ་ མེད་པ་ ། སྒྲ་མེད་པ་ ། ཡིད་ ལ་ བྱེད་པ་ མེད་པ་ །

source: Mañjuśrī, sentient beings experience space as being low or high, according to whether the place is low, middling, or high.
bo: འཇམ་དཔལ་ འོན་ཀྱང་ སེམས་ཅན་ རྣམས་ ཀྱིས་ དབྱིབས་ ཆུང་ངུ་ དང་ ། འབྲིང་ དང་ ། ཆེན་པོ་ དག་ གིས་ ནམ་མཁའ་ ཡང་ ཆུང་ངུ་ དང་ ། འབྲིང་ དང་ ཆེན་པོ་ -ར་ ཀུན་ ཏུ་ ཤེས་པ་ -ར་ འགྱུར་ རོ་ ། །

source: It is beyond the realm of words.
bo: ཚིག་ གི་ ལམ་ ལས་ ཡང་དག་པ་ -ར་ འདས་པ་ །

source: It reaches and enters everywhere. And still,
bo: ཐམས་ཅད་ ཀྱི་ རྗེས་སུ་ སོང་ ཞིང་ རྗེས་སུ་ ཞུགས་པ་ ཡིན་མོད་ ཀྱི་ །

source: It has no striving or giving up;
bo: བླང་བ་ མེད་པ་ ། དོར་བ་ མེད་པ་ །

source: no removal,
bo: འདེགས་པ་ མེད་པ་ །

source: no addition.
bo: གཞག་པ་ མེད་པ་ །

source: He is without mental engagement,
bo: ཡིད་ ལ་ བྱེད་པ་ མེད་པ་ ། །

source: “In the same way, Mañjuśrī, the Tathāgata, the Arhat, the Perfect and Complete Buddha is everywhere the same, free from concepts and distinctions.
bo: འཇམ་དཔལ་ དེ་བཞིན་ དུ་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་པ་ -ར་ རྫོགས་པ་ -འི་ སངས་རྒྱས་ ཀྱང་ ཐམས་ཅད་ དུ་ མཉམ་ ཞིང་ རྣམ་པ་ -ར་ མི་ རྟོག་ ལ་ ། བྱེ་བྲག་ མི་ འབྱེད་ །

source: Mañjuśrī, sentient beings experience space as being low or high, according to whether the place is low, middling, or high.
bo: འཇམ་དཔལ་ འོན་ཀྱང་ སེམས་ཅན་ རྣམས་ ཀྱིས་ དབྱིབས་ ཆུང་ངུ་ དང་ ། འབྲིང་ དང་ ། ཆེན་པོ་ དག་ གིས་ ནམ་མཁའ་ ཡང་ ཆུང་ངུ་ དང་ ། འབྲིང་ དང་ ཆེན་པོ་ -ར་ ཀུན་ ཏུ་ ཤེས་པ་ -ར་ འགྱུར་ རོ་ །

source: He is non-arisen
bo: མ་ སྐྱེས་པ་ །

source: and unceasing,
bo: མ་ འགགས་པ་ །

source: he is not past, future, or present.
bo: འདས་པ་ མ་ ཡིན་ ། མ་འོངས་པ་ མ་ ཡིན་ ། ད་ལྟར་ བྱུང་བ་ མ་ ཡིན་ །

source: He is indefinable,
bo: མཚན་གཞི་ མེད་པ་ །

source: non-elaborate,
bo: སྤྲོས་པ་ མེད་པ་ །

source: and formless;
bo: གཟུགས་ མེད་པ་ །

source: he cannot be shown or made known.
bo: བསྟན་ དུ་ མེད་པ་ ། རྣམ་པ་ -ར་ རིག་པ་ མེད་པ་ །

source: He is without contact,
bo: རེག་པ་ མེད་པ་ །

source: without dwelling,
bo: གནས་ མེད་པ་ །

source: not comparable,
bo: གཞལ་ དུ་ མེད་པ་ །

source: and beyond compare.
bo: གཞལ་བ་ ལས་ ཡང་དག་པ་ -ར་ འདས་པ་ །

source: He has no simile
bo: དཔེ་མེད་པ་ །

source: and is beyond all similes.
bo: དཔེ་ ལས་ ཡང་དག་པ་ -ར་ འདས་པ་ །

source: He has no basis,
bo: མི་ གནས་པ་ །

source: he is ungraspable
bo: གཟུང་བ་ མེད་པ་ །

source: and beyond visible range.
bo: མིག་ གི་ ལམ་ ལས་ ཡང་དག་པ་ -ར་ འདས་པ་ །
