Repository: OpenPecha-Data/0fbd31ce377b49a79da3bbcf2402ad48
Catalog: *.po
Languages: bo

source: He is free from mind, mentality, and consciousness.
bo: སེམས་ དང་ ། ཡིད་ དང་ ། རྣམ་པ་ -ར་ ཤེས་པ་ དང་ བྲལ་བ་

source: He has no characteristic;
bo: མཚན་ཉིད་ མེད་པ་ །

source: he is without syllables, voice, and mental engagement.
bo: ཡི་གེ་ མེད་པ་ ། སྒྲ་མེད་པ་ ། ཡིད་ ལ་ བྱེད་པ་ མེད་པ་ །

source: He reaches and enters everywhere.
bo: ཐམས་ཅད་ ཀྱི་ རྗེས་སུ་ སོང་ ཞིང་ རྗེས་སུ་ ཞུགས་པ་ ཡིན་མོད་ ཀྱི་ །

source: He is beyond the realm of words.
bo: གཞག་པ་ མེད་པ་ ཚིག་ གི་ ལམ་ ལས་ ཡང་དག་པ་ -ར་ འདས་པ་ །

source: And still, Mañjuśrī, according to whether sentient beings are low, middling, or high,
bo: འཇམ་དཔལ་ འོན་ཀྱང་ སེམས་ཅན་ དམན་པ་ དང་ ། འབྲིང་ དང་ ། མཆོག་ གང་དག་ ཡིན་པ་

source: they see the Tathāgata as low, middling, or high.
bo: དེ་དག་ གིས་ དེ་བཞིན་ གཤེགས་པ་ ཡང་ དམན་པ་ དང་ ། འབྲིང་ དང་ ། མཆོག་ ཏུ་ མཐོང་ ངོ་ ། །

source: “Mañjuśrī, the Tathāgata does not think,
bo: འཇམ་དཔལ་ དེ་བཞིན་ གཤེགས་པ་ ནི་ འདི་ སྙམ་ དུ་ སེམས་ཅན་ འདི་ ནི་ བསམ་པ་ དང་ །

source: ‘This sentient being has low inclinations and beliefs, so I will show him a low perfection of the form body.
bo: མོས་པ་ དམན་པ་ ཡིན་ གྱིས་ སེམས་ཅན་ འདི་ ལ་ ནི་ གཟུགས་ ཀྱི་ སྐུ་ -འི་ ཁ་དོག་ ཡོངས་སུ་ འགྲུབ་པ་ དམན་པ་ བསྟན་པ་ -ར་ བྱ་ -འོ་ ། །

source: This sentient being has middling inclinations and beliefs, so I will show him a middling perfection of the form body.
bo: སེམས་ཅན་ འདི་ ནི་ བསམ་པ་ དང་ མོས་པ་ འབྲིང་ ཡིན་ གྱིས་ སེམས་ཅན་ འདི་ ལ་ ནི་ གཟུགས་ ཀྱི་ སྐུ་ -འི་ ཁ་དོག་ ཡོངས་སུ་ འགྲུབ་པ་ འབྲིང་ བསྟན་པ་ -ར་ བྱ་ -འོ་ ། །

source: This sentient being has vast inclinations and beliefs,
bo: སེམས་ཅན་ འདི་ ནི་ བསམ་པ་ དང་ མོས་པ་ རྒྱ་ཆེ་བ་ ཡིན་ གྱིས་ །

source: so I will show him a vast perfection of the form body.’
bo: སེམས་ཅན་ འདི་ ལ་ ནི་ གཟུགས་ ཀྱི་ སྐུ་ -འི་ ཁ་དོག་ ཡོངས་སུ་ འགྲུབ་པ་ རྒྱ་ཆེན་པོ་ བསྟན་པ་ -ར་ བྱ་ -འོ་ སྙམ་ དུ་ མི་ སེམས་ སོ་ ། །

source: “Mañjuśrī, this is also what you should understand regarding how the Dharma is taught.
bo: འཇམ་དཔལ་ ཆོས་སྟོན་པ་ ཡང་ དེ་བཞིན་ དུ་ རྟོགས་པ་ -ར་ བྱ་ སྟེ་ །

source: so for him I shall make a speech relating to the Hearers’ Vehicle.
bo: སེམས་ཅན་ འདི་ ལ་ ནི་ ཉན་ཐོས་ ཀྱི་ ཐེག་པ་ -འི་ གཏམ་ དམན་པ་ བརྗོད་པ་ -ར་ བྱ་ -འོ་ །

source: Mañjuśrī, the Tathāgata does not think, ‘This sentient being has low beliefs,
bo: འཇམ་དཔལ་ དེ་བཞིན་ གཤེགས་པ་ ནི་ འདི་ སྙམ་ དུ་ སེམས་ཅན་ འདི་ ནི་ དམན་པ་ ལ་མོ་ -ས་པ་ ཡིན་ གྱིས་ ། །

source: This sentient being has middling beliefs,
bo: སེམས་ཅན་ འདི་ ནི་ བར་མ་ ལ་མོ་ -ས་པ་ ཡིན་ གྱིས་ །

source: so for him I shall make a speech relating to the Pratyekabuddha Vehicle.
bo: སེམས་ཅན་ འདི་ ལ་ ནི་ རང་ སངས་རྒྱས་ ཀྱི་ ཐེག་པ་ -འི་ གཏམ་པ་ -ར་ མ་ བརྗོད་པ་ -ར་ བྱ་ -འོ་ །

source: no removal,
bo: དོར་བ་ མེད་པ་ །

source: no addition.
bo: གདེག་པ་ མེད་པ་ །

source: He has no striving or giving up;
bo: བླང་བ་ མེད་པ་ །

source: so for him I shall make a speech relating to the Pratyekabuddha Vehicle.
bo: སེམས་ཅན་ འདི་ ལ་ ནི་ རང་ སངས་རྒྱས་ ཀྱི་ ཐེག་པ་ -འི་ གཏམ་པ་ -ར་ མ་ བརྗོད་པ་ -ར་ བྱ་ -འོ་ ། །

source: This sentient being has vast beliefs,
bo: སེམས་ཅན་ འདི་ ནི་ རྒྱ་ཆེན་པོ་ ལ་མོ་ -ས་པ་ ཡིན་ གྱིས་ །

source: so for him I shall make a speech relating to the Great Vehicle.’
bo: སེམས་ཅན་ འདི་ ལ་ ནི་ ཐེག་པ་ ཆེན་པོ་ -འི་ གཏམ་ རྒྱ་ཆེན་པོ་ བརྗོད་པ་ -ར་ བྱ་ -འོ་ སྙམ་ དུ་ མི་ སེམས་ སོ་ ། །

source: “Mañjuśrī, the Tathāgata does not think, ‘This sentient being has belief in giving,
bo: འཇམ་དཔལ་ དེ་བཞིན་ གཤེགས་པ་ ནི་ འདི་ སྙམ་ དུ་ སེམས་ཅན་ འདི་ ནི་ སྦྱིན་པ་ ལ་མོ་ -ས་པ་ ཡིན་ གྱིས་ །

source: so for him I shall make a speech related to giving.’
bo: སེམས་ཅན་ འདི་ ལ་ ནི་ སྦྱིན་པ་ -འི་ གཏམ་ བརྗོད་པ་ -ར་ བྱ་ -འོ་ ། །

source: Nor does he think so for discipline, forbearance, diligence, or concentration.
bo: སེམས་ཅན་ འདི་ ནི་ ཚུལ་ཁྲིམས་ དང་ ། བཟོད་པ་ དང་ ། བརྩོན་འགྲུས་ དང་ ། བསམ་གཏན་ ལ་མོ་ -ས་པ་ ཡིན་ གྱིས་ །

source: Mañjuśrī, the Tathāgata is the dharmakāya.
bo: འཇམ་དཔལ་ དེ་བཞིན་ གཤེགས་པ་ ནི་ ཆོས་ ཀྱི་ སྐུ་ ཡིན་པ་ -འི་ ཕྱིར་ ཏེ་ །

source: Mañjuśrī, the Tathāgata is utterly non-arisen.
bo: འཇམ་དཔལ་ དེ་བཞིན་ གཤེགས་པ་ ནི་ ཤིན་ཏུ་ མ་ སྐྱེས་པ་ དང་ ། མ་ འགགས་པ་ ཡིན་ ནོ་ །

source: “Mañjuśrī, for the Tathāgata, a consciousness chasing after names, forms, and etymological explanations does not occur.
bo: འཇམ་དཔལ་ དེ་བཞིན་ གཤེགས་པ་ -འི་ རྣམ་པ་ -ར་ ཤེས་པ་ ནི་ མིང་ དང་ གཟུགས་ དང་ ངེས་པ་ -འི་ ཚིག་ གི་ རྗེས་སུ་ འབྲང་ ཞིང་ འབྱུང་བ་ མ་ ཡིན་ ཏེ་ །

source: Mañjuśrī, the Tathāgata does not form mental constructs or concepts.
bo: འཇམ་དཔལ་ དེ་བཞིན་ གཤེགས་པ་ ནི་ རྟོག་པ་ -ར་ མི་ བྱེད་ ། རྣམ་པ་ -ར་ རྟོག་པ་ -ར་ མི་ བྱེད་པ་ ཡིན་ ནོ་ ། །

source: Mañjuśrī, the Tathāgata is momentary,
bo: འཇམ་དཔལ་ དེ་བཞིན་ གཤེགས་པ་ ནི་ སྐད་ཅིག་པ་ ཡིན་ ཏེ་ ། །

source: “Mañjuśrī, the Tathāgata does not think, ‘This sentient being has belief in the perfection of wisdom, so for him I shall make a speech related to the perfection of wisdom.’
bo: འཇམ་དཔལ་ དེ་བཞིན་ དུ་ དེ་བཞིན་ གཤེགས་པ་ ནི་ འདི་ སྙམ་ དུ་ སེམས་ཅན་ འདི་ ནི་ ཤེས་རབ་ ཀྱི་ ཕ་རོལ་ ཏུ་ ཕྱིན་པ་ ལ་མོ་ -ས་པ་ ཡིན་ གྱིས་ ། སེམས་ཅན་ འདི་ ལ་ ནི་ ཤེས་རབ་ ཀྱི་ ཕ་རོལ་ ཏུ་ ཕྱིན་པ་ -འི་ གཏམ་ བརྗོད་པ་ -ར་ བྱ་ -འོ་ སྙམ་ དུ་ ཡང་ མི་ སེམས་ ཏེ་ །

source: Mañjuśrī, the Tathāgata does not think in that way.
bo: འཇམ་དཔལ་ དེ་བཞིན་ གཤེགས་པ་ ལ་ ནི་ རྣམ་པ་ -ར་ རྟོགས་པ་ དེ་ལྟ་ བུ་ དག་ མེད་ དོ་ །

source: and his characteristic is to be inexhaustible.
bo: མི་ཟད་པ་ -འི་ མཚན་ཉིད་ དང་ །

source: He is fixed at the pinnacle of non-exhaustion, the pinnacle of reality.
bo: མི་ཟད་པ་ -འི་ མཐའ་ དང་ ། ཡང་དག་པ་ -འི་ མཐའ་ -ར་ ངེས་པ་ ཡིན་ ནོ་ ། །

source: Mañjuśrī, the Tathāgata, the Arhat, the Perfect and Complete Buddha
bo: འཇམ་དཔལ་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་པ་ -ར་ རྫོགས་པ་ -འི་ སངས་རྒྱས་ ནི་ །

source: is the pinnacle of the sameness of all dharmas, the pinnacle of their non-duality, and the pinnacle of their utter non-arising.
bo: ཆོས་ ཐམས་ཅད་ ཀྱི་ མཉམ་པ་ཉིད་ ཀྱི་ མཐའ་ དང་ ། གཉིས་ སུ་ མེད་པ་ -འི་ མཐའ་ དང་ ། ཤིན་ཏུ་ འབྱུང་བ་ མེད་པ་ -འི་ མཐའ་ ཡིན་ ཏེ་ །

source: He is not low, nor middling, nor high.
bo: དམན་པ་ མ་ ཡིན་ ། བར་མ་ མ་ ཡིན་ ། མཆོག་མ་ ཡིན་ ནོ་ །

source: In all regards he is the same, free from concepts, and free from distinctions.
bo: ཐམས་ཅད་ དུ་ མཉམ་ ཞིང་ རྣམ་པ་ -ར་ མི་ རྟོག་ ལ་ བྱེ་བྲག་ མི་ འབྱེད་ དེ་ །

source: They are not low, nor middling, nor high.
bo: དམན་པ་ མ་ ཡིན་ ། བར་མ་ ཡིན་ ། མཆོག་མ་ ཡིན་ ནོ་ །

source: It is because no dharmas are perceived.
bo: འཇམ་དཔལ་ ཆོས་ ཐམས་ཅད་ ནི་ དམིགས་ སུ་ མེད་པ་ -འི་ ཕྱིར་ ཏེ་ ། །

source: “Mañjuśrī, just in the same way, all dharmas are same free from concepts, and free from distinctions.
bo: འཇམ་དཔལ་ དེ་བཞིན་ དུ་ ཆོས་ ཐམས་ཅད་ ཀྱང་ མཉམ་ ཞིང་ རྣམ་པ་ -ར་ མི་ རྟོག་ ལ་ བྱེ་བྲག་ མི་ མི་ འབྱེད་ དེ་ ། །

source: And why is that?
bo: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན་ །

source: Mañjuśrī, this non-perception of all dharmas is their sameness.
bo: འཇམ་དཔལ་ ཆོས་ ཐམས་ཅད་ ནི་ དམིགས་ སུ་ མེད་པ་ གང་ཡིན་པ་ དེ་ ནི་ མཉམ་པ་ཉིད་ ཡིན་ ནོ་ །

source: Mañjuśrī, this non-perception of all dharmas is their sameness.
bo: འཇམ་དཔལ་ ཆོས་ ཐམས་ཅད་ ནི་ དམིགས་ སུ་ མེད་པ་ གང་ཡིན་པ་ དེ་ ནི་ མཉམ་པ་ཉིད་ ཡིན་ ནོ་ ། །

source: Their sameness is their remaining fixed.
bo: མཉམ་པ་ཉིད་ གང་ཡིན་པ་ དེ་ ནི་ གནས་པ་ ཉིད་ ཡིན་ ནོ་ ། །

source: Remaining fixed means that they do not move;
bo: གནས་པ་ ཉིད་ གང་ཡིན་པ་ དེ་ ནི་ མི་གཡོ་བ་ ཉིད་ ཡིན་ ནོ་ ། །

source: not moving means being without any abode.
bo: མི་གཡོ་བ་ ཉིད་ གང་ཡིན་པ་ དེ་ ནི་ མི་ རྟེན་པ་ ཡིད་ ཡིན་ ནོ་ ། །

source: “For someone with no abode in any dharma, the mind has no place to stand.
bo: ཆོས་ ཐམས་ཅད་ ལ་ མི་ རྟེན་པ་ -འི་ སེམས་ ཀྱི་ གནས་ མེད་ དོ་ ། །

source: For a mind that stands nowhere, there will be non-arising.
bo: སེམས་ མི་ གནས་པ་ ནི་ སྐྱེ་བ་ མེད་པ་ -ར་ གྱུར་ ཏེ་ །

source: And for someone who sees in this way, no distorted mind and mental states come about;
bo: དེ་ལྟར་ མཐོང་བ་ -འི་ སེམས་ དང་སེམས་ ལས་ བྱུང་བ་ རྣམས་ ནི་ ཕྱིན་ ཅི་ མ་ ལོག་པ་ -ར་ འཇུག་པ་ -ར་ འགྱུར་ རོ་ །

source: someone whose mind is undistorted will have authentic attainment.
bo: གང་ གི་ སེམས་ ཕྱིན་ ཅི་ མ་ ལོག་པ་ དེ་ -ས་ ནི་ ཇི་ལྟ་བ་ བཞིན་ ཐོབ་པ་ -ར་ འགྱུར་ རོ་ ། །

source: “Whoever has authentic attainment will not form elaborations.
bo: ཇི་ལྟ་བ་ བཞིན་ ཐོབ་པ་ ནི་ འཕྲོ་བ་ -ར་ མི་ བྱེད་ དོ་ ། །

source: Someone who does not form elaborations does not move about.
bo: སྤྲོས་པ་ མེད་པ་ ལ་ ནི་ སྤྱོད་པ་ ཡང་ མེད་ དོ་ ། །

source: When one does not move about, one does not wander.
bo: གང་ གི་ ཚེ་ སྤྱོད་པ་ -ར་ མི་ བྱེད་པ་ དེ་ -འི་ ཚེ་ མི་ འཁོར་ རོ་ ། །

source: When one does not wander, one does not become distracted.
bo: གང་ གི་ ཚེ་ མི་ འཁོར་བ་ དེ་ -འི་ ཚེ་ རྣམ་པ་ -ར་ མི་ འཕྲོ་ སྟེ་ །

source: One who does not become distracted does not oppose the dharmatā.
bo: རྣམ་པ་ -ར་ འཕྲོ་བ་ མེད་པ་ ནི་ ཆོས་ཉིད་ དང་ འགལ་བ་ -ར་ མི་ བྱེད་ དོ་ ། །

source: One who does not oppose the dharmatā is in conformity with everything.
bo: ཆོས་ཉིད་ དང་ མི་འགལ་བ་ ནི་ ཐམས་ཅད་ དང་ རྗེས་སུ་ འཐུན་པ་ -ར་ འགྱུར་ རོ་ ། །

source: One who is in conformity with everything does not move from the nature of the dharmas.
bo: ཐམས་ཅད་ དང་ རྗེས་སུ་ འཐུན་པ་ ནི་ ཆོས་ ཀྱི་ རང་བཞིན་ ལས་མི་ གཡོ་ -འོ་ ། །

source: One who does not move from the nature of the dharmas obtains the nature of the dharmas.
bo: ཆོས་ ཀྱི་ རང་བཞིན་ ལས་མི་ གཡོ་ བས་ ནི་ ཆོས་ ཀྱི་ རང་བཞིན་ ཐོབ་པ་ -ར་ འགྱུར་ རོ་ ། །

source: One who obtains the nature of the dharmas does not form any elaboration.
bo: ཆོས་ ཀྱི་ རང་བཞིན་ ཐོབ་པ་ ནི་ ཅུང་ཟད་ ཀྱང་ འཕྲོ་བ་ -ར་ མི་ བྱེད་ དོ་ ། །

source: Why is that?
bo: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན་ །

source: “Whoever is born from conditions and causes is utterly unborn.
bo: རྒྱུ་ དང་ རྐྱེན་ གྱིས་ བསྐྱེད་པ་ གང་ཡིན་པ་ དེ་ ནི་ ཤིན་ཏུ་ མ་ སྐྱེས་པ་ ཡིན་ ནོ་ ། །

source: Someone utterly unborn has gained certainty.
bo: ཤིན་ཏུ་ མ་ སྐྱེས་པ་ གང་ཡིན་པ་ དེ་ -ས་ ནི་ ངེས་པ་ འཐོབ་བོ་ ། །

source: Whoever has gained certainty does not dwell with any mental engagement in the dharmas.
bo: ངེས་པ་ ཐོབ་པ་ གང་ཡིན་པ་ དེ་ ནི་ ཆོས་ ཐམས་ཅད་ ཡིད་ ལ་ བྱེད་པ་ དང་ ལྷན་ཅིག་ མི་ གནས་ ཏེ་ །

source: When one does not dwell with any mental engagement in the dharmas, one does not dwell with the dharmas.
bo: གང་ གི་ ཆོས་ ཐམས་ཅད་ ཡིད་ ལ་ བྱེད་པ་ དང་ ལྷན་ཅིག་ མི་ གནས་པ་ དེ་ -འི་ ཚེ་ གནས་པ་ -ར་ བྱ་བ་ མེད་པ་ ཡིན་ ནོ་ །

source: When one does not dwell with the dharmas, one does not come into existence or go out of existence.
bo: གང་ གི་ ཚེ་ གནས་པ་ -ར་ བྱ་བ་ མེད་པ་ དེ་ -འི་ ཚེ་ མི་ འབྱུང་ མི་ འཇིག་ གོ་ ། །

source: When one does not come into existence or go out of existence, one becomes fixed and has obtained the Dharma.
bo: གང་ གི་ ཚེ་ མི་ འབྱུང་ མི་ འཇིག་པ་ དེ་ -འི་ ཚེ་ གནས་ ཤིང་ ཆོས་ ཐོབ་པ་ -ར་ འགྱུར་ རོ་ ། །

source: “When one becomes fixed and has obtained the Dharma, one applies oneself to the proper dharma.
bo: གང་ གི་ ཚེ་ གནས་ ཤིང་ ཆོས་ ཐོབ་པ་ དེ་ -འི་ ཚེ་ ཚུལ་བཞིན་ གྱི་ ཆོས་ ལ་ ཞུགས་པ་ -ར་ འགྱུར་ རོ་ ། །

source: When one applies oneself to the proper dharma, no dharma whatsoever is not a buddhadharma.
bo: ཚུལ་བཞིན་ གྱི་ ཆོས་ ལ་ ཞུགས་པ་ ལ་ ནི་ གང་ སངས་རྒྱས་ ཀྱི་ ཆོས་མ་ ཡིན་པ་ -འི་ ཆོས་ དེ་ དགའ་ ཡང་ མེད་ དོ་ །

source: Due to the realization of emptiness.
bo: འཇམ་དཔལ་ སྟོང་པ་ཉིད་ རྗེས་སུ་ རྟོགས་པ་ -འི་ ཕྱིར་ ཏེ་ །

source: The realization of emptiness is awakening.
bo: སྟོང་པ་ཉིད་ རྗེས་སུ་ རྟོགས་པ་ གང་ཡིན་པ་ དེ་ ནི་ བྱང་ཆུབ་བོ་ །

source: no-sign,
bo: མཚན་མ་ མེད་པ་ དང་ །

source: no-wish;
bo: སྨོན་པ་ མེད་པ་ དང་ །

source: no-dwelling,
bo: གནས་ མེད་པ་ དང་ །

source: no-effort,
bo: མངོན་པར་ འདུ་ བྱ་བ་ མེད་པ་ དང་ ། །

source: “It is awakening, because in this way one realizes emptiness, no-sign, no-wish; no-effort, no-dwelling, no coming about; no object of apprehension and no-abode.
bo: དེ་ -ས་ དེ་ལྟར་ སྟོང་པ་ཉིད་ དང་ ། མཚན་མ་ མེད་པ་ དང་ ། སྨོན་པ་ མེད་པ་ དང་ ། མངོན་པར་ འདུ་ བྱ་བ་ མེད་པ་ དང་ ། གནས་ མེད་པ་ དང་ ། འབྱུང་བ་ མེད་པ་ དང་ ། གཟུང་བ་ མེད་པ་ དང་ ། གཞི་མེད་པ་ རྗེས་སུ་ རྟོགས་པ་ -འི་ ཕྱིར་ བྱང་ཆུབ་ སྟེ་ །

source: Awakening is proper application.
bo: བྱང་ཆུབ་ ནི་ ཚུལ་བཞིན་ ལ་ སྦྱོར་བ་ -འོ་ ། །

source: “What is called proper application is to neither remove nor add.
bo: ཚུལ་བཞིན་ དུ་ སྦྱོར་བ་ ནི་ འདེགས་པ་ མེད་པ་ དང་ ། གཞག་པ་ མེད་པ་ དང་ ། །

source: And why?
bo: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན་ །

source: and the application of what has yet to come.
bo: འོངས་པ་ མ་ཡིན་པ་ ལ་ སྦྱོར་བ་ དང་ །

source: This is proper application.
bo: ཚུལ་བཞིན་ ལ་ སྦྱོར་བ་ ཡིན་ ནོ་ །

source: It is the non-liberated application,
bo: གྲོལ་བ་ མེད་པ་ ལ་ སྦྱོར་བ་ དང་ །

source: and it is not connected.
bo: ཆགས་པ་ མེད་པ་ དང་ །

source: It is the application of not doing and not changing,
bo: བྱ་བ་ མེད་པ་ དང་ ། རྣམ་པ་ -ར་ བྱ་བ་ མེད་པ་ ལ་ སྦྱོར་བ་ དང་ །

source: the application of neither oneness nor plurality,
bo: གཅིག་པ་ ཉིད་ མ་ཡིན་པ་ དང་ ། ཐ་དད་པ་ ཉིད་ མ་ཡིན་པ་ ལ་ སྦྱོར་བ་ དང་ །

source: Because mind is by nature luminous.
bo: འཇམ་དཔལ་ སེམས་ ནི་ རང་བཞིན་ གྱིས་ འོད་གསལ་བ་ -འི་ ཕྱིར་ ཏེ་ ། །

source: “In that respect, there is no application,
bo: ཚུལ་བཞིན་ གང་ཡིན་པ་ དེ་ ལ་ ནི་ སྦྱོར་བ་ ཡང་ མེད་ །

source: no measure
bo: སྤོངས་པ་ ཡང་ མེད་ ། །

source: and no direct realization of a result.
bo: འབྲས་བུ་ མངོན་སུམ་ དུ་ བྱ་བ་ ཡང་ མེད་ དོ་ །

source: It is afflicted by adventitious afflictions,
bo: དེ་ ནི་ གློ་བུར་ གྱི་ ཉེ་བ་ -འི་ ཉོན་མོངས་པ་ ཐམས་ཅད་ ཀྱིས་ ཉེ་བར་ ཉོན་མོངས་པ་ -ར་ ཟད་ ཀྱི་ །

source: but its nature is not afflicted.
bo: རང་བཞིན་ གྱིས་ ཀུན་ ནས་ ཉོན་མོངས་པ་ ཉིད་ མ་ ཡིན་ ནོ་ ། །

source: “Luminosity by nature is non-affliction.
bo: རང་བཞིན་ གྱིས་ འོད་གསལ་བ་ ཉིད་ གང་ཡིན་པ་ དེ་ ནི་ ཀུན་ ནས་ ཉོན་མོངས་པ་ མེད་པ་ ཉིད་ ཡིན་ ནོ་ ། །

source: With respect to non-affliction there is no counteragent—a counteragent by which the destruction of the afflictions may occur.
bo: ཀུན་ ནས་ ཉོན་མོངས་པ་ མེད་པ་ གང་ཡིན་པ་ དེ་ ལ་ ནི་ གཉེན་པོ་ གང་ གིས་ ཉོན་མོངས་པ་ སྤོང་བ་ -ར་ འགྱུར་བ་ -འི་ གཉེན་པོ་ མེད་ དོ་ །

source: Because what is pure does not become pure; it just is pure.
bo: འཇམ་དཔལ་ དེ་ ནི་ དག་པ་ ཉིད་ ཡིན་པ་ -ས་ དག་པ་ ནི་ དག་པ་ -ར་ མི་འགྱུར་བ་ -འི་ ཕྱིར་ ཏེ་ །

source: “That which is pure is non-arising.
bo: དག་པ་ གང་ཡིན་པ་ དེ་ ནི་ སྐྱེ་བ་ མེད་པ་ -འོ་ ། །

source: Non-arising is faultless.
bo: སྐྱེ་བ་ མེད་པ་ གང་ཡིན་པ་ དེ་ ནི་ མ་སྨད་པ་ -འོ་ ། །

source: What is faultless is the destruction of joys,
bo: མ་སྨད་པ་ གང་ཡིན་པ་ དེ་ ནི་ འདོད་པ་ སྤངས་པ་ -འོ་ ། །

source: whereby all attachments cease.
bo: འདོད་པ་ སྤངས་པ་ གང་ཡིན་པ་ དེ་ ལ་ ནི་ སྲེད་པ་ ཐམས་ཅད་ འགག་ གོ་ ། །

source: Where all attachments cease, that is non-arising.
bo: གང་ ལ་ སྲེད་པ་ ཐམས་ཅད་ འགགས་པ་ དེ་ ནི་ མི་ སྐྱེ་ -འོ་ ། །

source: And non-arising is awakening.
bo: མི་ སྐྱེ་བ་ གང་ཡིན་པ་ དེ་ ནི་ བྱང་ཆུབ་བོ་ ། །

source: “Awakening is sameness.
bo: བྱང་ཆུབ་ གང་ཡིན་པ་ དེ་ ནི་ མཉམ་པ་ཉིད་ དོ་ ། །

source: Sameness is the tathatā.
bo: མཉམ་པ་ཉིད་ གང་ཡིན་པ་ དེ་ ནི་ དེ་བཞིན་ཉིད་ དོ་ ། །

source: All dharmas, co-produced and unproduced, abide in the tathatā.
bo: དེ་བཞིན་ཉིད་ ལ་ ནི་ འདུས་བྱས་ དང་ ། འདུས་མ་བྱས་ ཀྱི་ ཆོས་ ཐམས་ཅད་ གནས་ སོ་ །

source: there is no designation of duality.
bo: གཉིས་ སུ་ གདགས་པ་ ཡང་ མེད་ དོ་ ། །

source: With respect to the tathatā there is neither something co-produced
bo: དེ་བཞིན་ཉིད་ གང་ཡིན་པ་ དེ་ ལ་ ནི་ འདུས་བྱས་ ཀྱང་ མེད་ ། །

source: Where there is nothing co-produced or unproduced, and no designation of duality, that is the tathatā.
bo: གང་ ལ་ འདུས་བྱས་ ཀྱང་ མེད་ ། འདུས་མ་བྱས་ ཀྱང་ མེད་ ། གཉིས་ སུ་ གདགས་པ་ ཡང་ མེད་པ་ དེ་ ནི་ དེ་བཞིན་ཉིད་ དོ་ །

source: nor something unproduced;
bo: འདུས་མ་བྱས་ ཀྱང་ མེད་ ། །

source: “The tathatā is nothing else but the tathatā.
bo: དེ་བཞིན་ཉིད་ གང་ཡིན་པ་ དེ་ ནི་ གཞན་མ་ ཡིན་པ་ དེ་བཞིན་ཉིད་ དོ་ ། །

source: Nothing else but the tathatā is the unchanging tathatā.
bo: གཞན་མ་ ཡིན་པ་ དེ་བཞིན་ཉིད་ གང་ཡིན་པ་ དེ་ ནི་ འགྱུར་བ་ མེད་པ་ དེ་བཞིན་ཉིད་ དོ་ ། །

source: The unchanging tathatā is the non-coming tathatā.
bo: འགྱུར་བ་ མེད་པ་ དེ་བཞིན་ཉིད་ གང་ཡིན་པ་ དེ་ ནི་ འོང་བ་ མེད་པ་ དེ་བཞིན་ཉིད་ དོ་ ། །

source: The unchanging tathatā is the non-coming tathatā.
bo: འགྱུར་བ་ མེད་པ་ དེ་བཞིན་ཉིད་ གང་ཡིན་པ་ དེ་ ནི་ འོང་བ་ མེད་པ་ དེ་བཞིན་ཉིད་ དོ་ །

source: The non-coming tathatā is the tathatā that does not go.
bo: འོང་བ་ མེད་པ་ དེ་བཞིན་ཉིད་ གང་ཡིན་པ་ དེ་ ནི་ འགྲོ་བ་ མེད་པ་ དེ་བཞིན་ཉིད་ དོ་ ། །

source: The tathatā that does not go is the authentic tathatā.
bo: འགྲོ་བ་ མེད་པ་ དེ་བཞིན་ཉིད་ གང་ཡིན་པ་ དེ་ ནི་ ཇི་ལྟ་བ་ བཞིན་ དེ་བཞིན་ཉིད་ དོ་ ། །

source: The authentic tathatā is the not-at-all-tathatā.
bo: ཇི་ལྟ་བ་ བཞིན་ དེ་བཞིན་ཉིད་ གང་ཡིན་པ་ དེ་ ནི་ ནམ་ཡང་ དེ་བཞིན་ཉིད་ མ་ཡིན་པ་ མ་ ཡིན་ ནོ་ ། །

source: The not-at-all-tathatā is not afflicted
bo: ནམ་ཡང་ དེ་བཞིན་ཉིད་ མ་ཡིན་པ་ མ་ཡིན་པ་ གང་ཡིན་པ་ དེ་ ནི་ ཀུན་ ནས་ ཉོན་མོངས་པ་ -ར་ མི་ འགྱུར་ །

source: and is not purified.
bo: རྣམ་པ་ -ར་ བྱང་བ་ -ར་ མི་ འགྱུར་ རོ་ ། །

source: That which is neither afflicted nor purified neither arises nor ceases.
bo: གང་ ཀུན་ ནས་ ཉོན་མོངས་པ་ -ར་ མི་ འགྱུར་ ། རྣམ་པ་ -ར་ བྱང་བ་ -ར་ མི་འགྱུར་བ་ དེ་ ནི་ སྐྱེ་བ་ -ར་ མི་ འགྱུར་ ། འགག་པ་ -ར་ མི་ འགྱུར་ རོ་ །

source: That which neither arises nor ceases is the same as nirvāṇa.
bo: གང་ སྐྱེ་བ་ -ར་ མི་ འགྱུར་ ། འགག་པ་ -ར་ མི་འགྱུར་བ་ དེ་ ནི་ མྱ་ངན་ ལས་ འདས་པ་ དང་ མཉམ་ མོ་ ། །

source: That which is the same as nirvāṇa neither roams within saṃsāra nor passes into complete nirvāṇa.
bo: གང་ མྱ་ངན་ ལས་ འདས་པ་ དང་ མཉམ་པ་ དེ་ ནི་ འཁོར་བ་ -ར་ མི་ འགྱུར་ ། ཡོངས་སུ་ མྱ་ངན་ ལས་ འདའ་བ་ -ར་ མི་ འགྱུར་ རོ་ ། །

source: That which neither roams within saṃsāra nor passes into complete nirvāṇa is not past, future, or present.
bo: གང་ འཁོར་བ་ -ར་ མི་ འགྱུར་ ཡོངས་སུ་ མྱ་ངན་ ལས་ འདའ་བ་ -ར་ མི་འགྱུར་བ་ དེ་ ནི་ འདས་པ་ མ་ ཡིན་ ། མ་འོངས་པ་ མ་ ཡིན་ ། ད་ལྟར་ བྱུང་བ་ མ་ ཡིན་ ནོ་ ། །

source: That which is not past, future, or present is not low, middling, or high.
bo: གང་ འདས་པ་ མ་ ཡིན་ ། མ་འོངས་པ་ མ་ ཡིན་ ། ད་ལྟར་ བྱུང་བ་ མ་ཡིན་པ་ དེ་ ནི་ དམན་པ་ མ་ ཡིན་ ། བར་མ་ མ་ ཡིན་ ། མཆོག་མ་ ཡིན་ ནོ་ ། །

source: That which is not low, middling, or high is the tathatā.
bo: གང་ དམན་པ་ མ་ ཡིན་ ། བར་མ་ མ་ ཡིན་ ། མཆོག་མ་ ཡིན་པ་ དེ་ ནི་ དེ་བཞིན་ཉིད་ དེ་ །

source: “What we call tathathā is an expression meaning tattva.
bo: དེ་བཞིན་ཉིད་ ཅེས་བྱ་བ་ དེ་ ནི་ དེ་ ཁོ་ན་ -འི་ དོན་ གྱི་ ཚིག་ བླ་དགས་ ཡིན་ ནོ་ ། །

source: What we call tattva is tathatā itself.
bo: དེ་ ཁོ་ན་ ཞེས་ བྱ་བ་ ནི་ དེ་བཞིན་ཉིད་ ཁོ་ན་ -འོ་ ། །

source: Tathatā being the same as tattva is called tathatva.
bo: དེ་བཞིན་ཉིད་ དེ་ ཁོ་ན་ ནི་ དེ་བཞིན་ཉིད་ དོ་ ། །

source: Thus, the tathatā and the self are not two, they are non-dual.
bo: དེ་བཞིན་ཉིད་ དང་ བདག་ དེ་ ནི་ གཉིས་ སུ་ མེད་ དེ་ གཉིས་ སུ་ བྱར་མེད་ དོ་ ། །

source: The meaning of non-duality is awakening, in the sense of becoming awake.
bo: གཉིས་ སུ་ བྱར་མེད་པ་ -འི་ དོན་ གང་ཡིན་པ་ དེ་ ནི་ བྱང་ཆུབ་ སྟེ་ ། བྱང་ཆུབ་ ནི་ དོན་ རྟོགས་པ་ -འོ་ ། །

source: The meaning is explained as the awareness that enters the three gates of liberation with respect to all the Dharma teachings.
bo: དོན་ ཅེས་བྱ་བ་ ནི་ ཆོས་ བསྟན་པ་ ཐམས་ཅད་ ལ་ རྣམ་པ་ -ར་ ཐར་བ་ -འི་ སྒོ་གསུམ་ དུ་ འཇུག་པ་ ཤེས་པ་ -འོ་ ། །

source: The awareness is explained as engaging in the sameness of the three times with respect to all dharmas.
bo: ཤེས་པ་ ཞེས་ བྱ་བ་ ནི་ ཆོས་ ཐམས་ཅད་ ལ་དུ་ -ས་ གསུམ་ མཉམ་པ་ཉིད་ དུ་ འཇུག་པ་ -འོ་ ། །

source: The meaning of the inseparability of all dharmas is what is explained as the meaning.
bo: ཆོས་ ཐམས་ཅད་ ཀྱི་ དབྱེ་ -ར་ མེད་པ་ -འི་ དོན་ དེ་ ནི་ དོན་ ཅེས་ བྱ་ སྟེ་ །

source: It is voiceless,
bo: དོན་ ནི་སྒྲ་ མེད་པ་ །

source: ineffable,
bo: བརྗོད་ དུ་ མེད་པ་ །

source: inexpressible,
bo: ཐ་སྙད་ མེད་པ་

source: and cut off from any expressions.
bo: ཐ་སྙད་ ཡང་དག་པ་ -ར་ ཆད་པ་ ཡིན་ ནོ་ ། །

source: Awareness is explained as the awareness that understands the meaning and understands consciousness;
bo: ཤེས་པ་ ཞེས་ བྱ་བ་ ནི་ དོན་ རྗེས་སུ་ རྟོགས་པ་ -འི་ ཤེས་པ་ དང་ ། རྣམ་པ་ -ར་ ཤེས་པ་ རྗེས་སུ་ རྟོགས་པ་ -འི་ ཤེས་པ་ གང་ཡིན་པ་ སྟེ་ །

source: this is explained as awareness.
bo: དེ་ ནི་ ཤེས་པ་ ཞེས་ བྱ་ -འོ་ ། །

source: The meaning is explained as the meaning that is established by the awareness that understands the meaning of tattva, and by the awareness that understands consciousness.
bo: དོན་ ཅེས་བྱ་བ་ ནི་ དེ་ ཁོ་ན་ -འི་ དོན་ ཤེས་པ་ དང་ ། རྣམ་པ་ -ར་ ཤེས་པ་ རྗེས་སུ་ རྟོགས་པ་ -འི་ ཤེས་པ་ -ས་ ངེས་པར་ རྟོགས་པ་ གང་ཡིན་པ་ སྟེ་ །

source: That itself is the dharmatā.
bo: དེ་ཉིད་ ཆོས་ཉིད་ ཡིན་ ནོ་ ། །

source: And the dharmatā is the meaning.
bo: ཆོས་ཉིད་ གང་ཡིན་པ་ དེ་ ནི་ དོན་ ཡིན་ ནོ་ །

source: Sameness is the meaning.
bo: མཉམ་པ་ཉིད་ གང་ཡིན་པ་ དེ་ ནི་ དོན་ ཡིན་ ནོ་ ། །

source: “Mañjuśrī, for those who have attachment to form, the eye is attachment.
bo: འཇམ་དཔལ་ གཟུགས་ ལ་ ཆགས་པ་ -ས་ ཆགས་པ་ -ར་ གྱུར་པ་ རྣམས་ ཀྱིས་ མིག་ ནི་ ཆགས་པ་ ཡིན་ ནོ་ ། །

source: Knowing the nature of form and of the eye is non-attachment.
bo: གཟུགས་ དང་ མིག་ གི་ རང་བཞིན་ ཤེས་པ་ ནི་ ཆགས་པ་ མེད་པ་ ཡིན་ ནོ་ ། །

source: “For those who have attachment to views, one’s own body is attachment.
bo: ལྟ་བ་ ལ་ ཆགས་པ་ -ས་ ཆགས་པ་ -ར་ གྱུར་པ་ རྣམས་ ཀྱི་ རང་ གི་ ལུས་ ནི་ ཆགས་པ་ ཡིན་ ནོ་ ། །

source: For those who have done away with all views, the awareness of one’s body’s natural emptiness is non-attachment.
bo: ལྟ་བ་ -ར་ གྱུར་པ་ ཐམས་ཅད་ ཀྱི་ རང་ གི་ ལུས་ ཀྱི་ རང་བཞིན་ སྟོང་པ་ཉིད་ དུ་ ཤེས་པ་ ནི་ ཆགས་པ་ མེད་པ་ ཡིན་ ནོ་ ། །

source: “For those who are stuck in their attachment to improper mental placement, the appearance of dharmas is attachment.
bo: ཚུལ་བཞིན་ མ་ཡིན་པ་ ཡིད་ ལ་ བྱེད་པ་ ལ་ ཆགས་པ་ -ས་ ཆགས་པ་ -ར་ གྱུར་པ་ རྣམས་ ཀྱི་ ཆོས་ ཀྱི་ སྣང་བ་ ནི་ ཆགས་པ་ ཡིན་ ནོ་ ། །

source: Discerning the dharmas through proper mental placement, the awareness of emptiness by nature and emptiness of essence is non-attachment.
bo: ཚུལ་བཞིན་ ཡིད་ ལ་ བྱེད་པ་ -འི་ ཆོས་ ལ་སོ་ སོ་ -ར་ རྟོག་ ཅིང་ ངོ་བོ་ ཉིད་ ཀྱིས་ རང་བཞིན་ སྟོང་པ་ཉིད་ དུ་ ཤེས་པ་ ནི་ ཆགས་པ་ མེད་པ་ ཡིན་ ནོ་ ། །

source: “For those who are stuck in their attachment to the stain of doubt, liberation is attachment.
bo: ཐེ་ཚོམ་ གྱི་ དྲི་མ་ ལ་ ཆགས་པ་ -ས་ ཆགས་པ་ -ར་ གྱུར་པ་ རྣམས་ ཀྱི་ ཐར་པ་ ནི་ ཆགས་པ་ ཡིན་ ནོ་ ། །

source: The authentic awareness of belief and liberation is non-attachment.
bo: མོས་པ་ དང་ རྣམ་པ་ -ར་ གྲོལ་བ་ ཡང་དག་པ་ ཇི་ལྟ་བ་ བཞིན་ དུ་ ཤེས་པ་ ནི་ ཆགས་པ་ མེད་པ་ ཡིན་ ནོ་ ། །

source: “For those who are stuck in their attachment to the stain of laziness, having present diligence toward realization is attachment.
bo: ལེ་ལོ་ -འི་ དྲི་མ་ ལ་ ཆགས་པ་ -ས་ ཆགས་པ་ -ར་ གྱུར་པ་ རྣམས་ ཀྱི་ རྟོགས་པ་ -ར་ བྱ་བ་ ལ་ བརྩོན་འགྲུས་ བརྟན་པ་ ཉིད་ ནི་ ཆགས་པ་ ཡིན་ ནོ་ ། །

source: The realization of dharmas as they are is non-attachment.
bo: ཆོས་ ཇི་ལྟ་བ་ བཞིན་ དུ་ རྟོགས་པ་ ནི་ ཆགས་པ་ མེད་པ་ ཡིན་ ནོ་ ། །

source: The realization of dharmas as they are is non-attachment.
bo: ཆོས་ ཇི་ལྟ་བ་ བཞིན་ དུ་ རྟོགས་པ་ ནི་ ཆགས་པ་ མེད་པ་ ཡིན་ ནོ་ །

source: “For those who are stuck in their attachment to the hindrances, the limbs of awakening are attachment.
bo: སྒྲིབ་པ་ ལ་ ཆགས་པ་ -ས་ ཆགས་པ་ -ར་ གྱུར་པ་ རྣམས་ ཀྱི་ བྱང་ཆུབ་ ཀྱི་ བྱང་ཆུབ་ ཀྱི་ ཡན་ལག་ རྣམས་ ནི་ ཆགས་པ་ ཡིན་ ནོ་ ། །

source: Liberation through unobstructed awareness is non-attachment.
bo: སྒྲིབ་པ་ མེད་པ་ -འི་ རྣམ་པ་ -ར་ ཐར་པ་ ཤེས་པ་ ནི་ ཆགས་པ་ མེད་པ་ ཡིན་ ནོ་ ། །

source: “Being by nature completely pure, all dharmas occur due to an assemblage of causes and conditions.
bo: རང་བཞིན་ གྱིས་ ཡོངས་སུ་ དག་པ་ -འི་ ཆོས་ ཐམས་ཅད་ ནི་ རྒྱུ་ དང་ རྐྱེན་ ཚོགས་པ་ ལས་ འབྱུང་ སྟེ་ ། །

source: “The sameness of the interpretable meaning and the definitive meaning is their common meaning, which is emptiness.
bo: ངེས་པ་ -འི་ དོན་ དང་ དྲང་བ་ -འི་ དོན་ མཉམ་པ་ཉིད་ ཀྱིས་ དོན་ མཉམ་པ་ དེ་ ནི་ སྟོང་པ་ཉིད་ དོ་ །

source: Because he is born due to conditions and causes.
bo: རྒྱུ་ དང་ རྐྱེན་ གྱིས་ བསྐྱེད་པ་ -འི་ ཕྱིར་ ཏེ་ ། །

source: The sameness of liberation is the same as the sameness of the dharmas.
bo: ཆོས་ མཉམ་པ་ཉིད་ ཀྱིས་ རྣམ་པ་ -ར་ གྲོལ་བ་ མཉམ་པ་ཉིད་ མཉམ་ སྟེ་ །

source: Realization according to the sameness of liberation is awakening.
bo: རྣམ་པ་ -ར་ གྲོལ་བ་ མཉམ་པ་ཉིད་ རྗེས་སུ་ རྟོགས་པ་ ནི་ བྱང་ཆུབ་བོ་ ། །

source: The sameness of the person is the same as the common meaning.
bo: སྟོང་པ་ཉིད་ དུ་ དོན་ མཉམ་པ་ -ས་ གང་ཟག་ མཉམ་པ་ཉིད་ མཉམ་ མོ་ ། །

source: The sameness of the dharmas is the same as the sameness of persons.
bo: གང་ཟག་ མཉམ་པ་ཉིད་ ཀྱིས་ ཆོས་ མཉམ་པ་ཉིད་ མཉམ་ མོ་ ། །
