Repository: OpenPecha-Data/0fbd31ce377b49a79da3bbcf2402ad48
Catalog: *.po
Languages: bo

source: another bodhisattva might establish a single sentient being in the result of a non-returner.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ གཞན་ གང་ཞིག་ གིས་ སེམས་ཅན་ གཅིག་ཅིག་ ཕྱིར་ མི་ འོང་བ་ -འི་ འབྲས་བུ་ ལ་ བཀོད་པ་ -ར་ གྱུར་ ན་ ། །

source: “Mañjuśrī, a bodhisattva might establish the sentient beings of all the world spheres in the ten directions in the result of a non-returner.
bo: འཇམ་དཔལ་ གལ་ཏེ་ བྱང་ཆུབ་ སེམས་དཔའ་ ལ་ལ་ ཞིག་ གིས་ ཕྱོགས་ བཅུ་ -འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཀྱི་ སེམས་ཅན་ ཐམས་ཅད་ ཕྱིར་ མི་ འོང་བ་ -འི་ འབྲས་བུ་ ལ་ བཀོད་པ་ བས་ ནི་ །

source: another bodhisattva might establish a single sentient being in the result of an arhat.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ གཞན་ གང་ཞིག་ གིས་ སེམས་ཅན་ གཅིག་ཅིག་ དགྲ་བཅོམ་པ་ ཉིད་ ལ་ བཀོད་པ་ -ར་ གྱུར་ ན

source: another bodhisattva might establish a single sentient being in the result of an arhat.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ གཞན་ གང་ཞིག་ གིས་ སེམས་ཅན་ གཅིག་ཅིག་ དགྲ་བཅོམ་པ་ ཉིད་ ལ་ བཀོད་པ་ -ར་ གྱུར་

source: In that case, the latter would engender incalculably greater merit.
bo: དེ་ ནི་ དེ་བ་ -ས་ ཆེས་ བསོད་ནམས་ གྲངས་མེད་པ་ སྐྱེད་པ་ -ར་ འགྱུར་ རོ་ ། །

source: “Mañjuśrī, a bodhisattva might establish the sentient beings of all the world spheres in the ten directions in the result of an arhat.
bo: འཇམ་དཔལ་ གལ་ཏེ་ བྱང་ཆུབ་ སེམས་དཔའ་ ལ་ལ་ ཞིག་ གིས་ ཕྱོགས་ བཅུ་ -འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཀྱི་ སེམས་ཅན་ ཐམས་ཅད་ དགྲ་བཅོམ་པ་ ཉིད་ ལ་ བཀོད་པ་ བས་

source: another bodhisattva might establish a single sentient being in the result of a pratyekabuddha.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ གཞན་ གང་ཞིག་ གིས་ སེམས་ཅན་ གཅིག་ཅིག་ རང་ སངས་རྒྱས་ ཉིད་ ལ་ བཀོད་པ་ -ར་ གྱུར་ ན་

source: “Mañjuśrī, a bodhisattva might establish the sentient beings of all the world spheres in the ten directions in the result of a pratyekabuddha.
bo: འཇམ་དཔལ་ གལ་ཏེ་ བྱང་ཆུབ་ སེམས་དཔའ་ གང་ལ་ལ་ ཞིག་ གིས་ ཕྱོགས་ བཅུ་ -འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཀྱི་ སེམས་ཅན་ ཐམས་ཅད་ རང་ སངས་རྒྱས་ ཉིད་ ལ་ བཀོད་པ་ བས་

source: another bodhisattva might establish a single sentient being in bodhicitta.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ གཞན་ གང་ཞིག་ གིས་ སེམས་ཅན་ གཅིག་ཅིག་ བྱང་ཆུབ་ ཀྱི་ སེམས་ ལ་ བཀོད་པ་ -ར་ གྱུར་ ན་

source: “Mañjuśrī, a bodhisattva might establish the sentient beings of all the world spheres in the ten directions in bodhicitta.
bo: འཇམ་དཔལ་ གལ་ཏེ་ བྱང་ཆུབ་ སེམས་དཔའ་ ལ་ལ་ ཞིག་ གིས་ ཕྱོགས་ བཅུ་ -འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཀྱི་ སེམས་ཅན་ ཐམས་ཅད་ བྱང་ཆུབ་ ཀྱི་ སེམས་ ལ་ བཀོད་པ་ བས་

source: another bodhisattva might establish a single sentient being in the state of irreversibility.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ གཞན་ གང་ཞིག་ གིས་ སེམས་ཅན་ གཅིག་ཅིག་ ཕྱིར་ མི་ ལྡོག་པ་ ཉིད་ ལ་ བཀོད་པ་ -ར་ གྱུར་ ན་

source: “Mañjuśrī, a bodhisattva might establish the sentient beings of all the world spheres in the ten directions in the state of irreversibility.
bo: འཇམ་དཔལ་ གལ་ཏེ་ བྱང་ཆུབ་ སེམས་དཔའ་ ལ་ལ་ ཞིག་ གིས་ ཕྱོགས་ བཅུ་ -འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཀྱི་ སེམས་ཅན་ ཐམས་ཅད་ ཕྱིར་ མི་ ལྡོག་པ་ ཉིད་ ལ་ བཀོད་པ་ བས་

source: at least cause a single sentient being to engage with this Dharma teaching.
bo: ཐ་ན་ སེམས་ཅན་ གཅིག་ཅིག་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ འདི་ ལ་ འཇུག་པ་ -ར་ བྱས་

source: another bodhisattva, believing in this Dharma teaching, might make others write it down, might shed light on it,
bo: བྱང་ཆུབ་ སེམས་དཔའ་ གཞན་ གང་ཞིག་ གིས་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ འདི་ ལ་མོ་ -ས་ ཤིང་ ཡི་གེ་ -ར་ འདྲིར་ བཅུག་ ནས་ གཞན་དག་ ལ་ རྒྱ་ ཆེ་ -ར་ ཡང་དག་པ་ -ར་ སྟོན་པ་ དང་ ། །

source: Then, at that time, the Bhagavat spoke the following verses:
bo: དེ་ནས་ དེ་ -འི་ ཚེ་ བཅོམ་ལྡན་འདས་ ཀྱིས་ ཚིགས་ སུ་ བཅད་པ་ འདི་དག་ བཀའ་ སྩལ་ ཏོ་ ། །

source: if another listens with reverence to this sūtra,
bo: གང་ཞིག་ མདོ་སྡེ་ འདི་ ནི་ ཉན་པ་ -ར་ བྱེད་ གྱུར་ ན་ ། །

source: “In the final times of decay, a bodhisattva May uphold the good Dharma of a hundred million buddhas.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ གང་ཞིག་ ཟད་པ་ -འི་ དུས་མཐའ་ -འི་ ཚེ་ ། ། སངས་རྒྱས་ བྱེ་བ་ ཕྲག་ བཅུ་ -འི་ དམ་ཆོས་ འཛིན་པ་ བས་ ། །

source: His merit will be great, and exceed the former.
bo: དེ་ ནི་ དེ་བ་ -ས་ བསོད་ནམས་ ཆེན་པོ་ ཁྱད་པར་ འཕགས་ ། །

source: Eliciting compassion, not craving for any pleasure,
bo: སྙིང་རྗེ་ བསྐྱེད་ དེ་ བདེ་བ་ ཀུན་ ལ་ ཆགས་ མེད་པ་ -ར་ ། །

source: He may then salute all of those sacred persons.
bo: སྐྱེས་བུ་ དམ་པ་ ཐམས་ཅད་ ཕྱག་ འཚལ་ བཙུད་པ་ བས་ །

source: if for just a brief moment, Another teaches others this sūtra,
bo: ཆོས་ རྣམས་ སྨོན་པ་ -ར་ བྱེད་པ་ -འི་ མདོ་སྡེ་ འདི་ ། ། གཞན་ ལ་ ཡུད་ཙམ་ གཅིག་ཅིག་ སྟོན་པ་ -ར་ བྱེད་ གྱུར་ ན་ ། །

source: Will have sharp wisdom and great strength
bo: དེ་ ནི་ ཤེས་རབ་ རྣོ་ ཞིང་ མཐུ་ཆེན་ ལྡན་ གྱུར་ ལ་ ། །

source: The fruit of his merit will exceed the former.
bo: དེ་ ནི་ དེ་བ་ -ས་ བསོད་ནམས་ འབྲས་བུ་ ཁྱད་པར་ འཕགས་ །

source: keeps his mind well disposed toward the Sugata’s teaching,
bo: གང་ཞིག་ བདེར་གཤེགས་ བསྟན་ ལ་ སེམས་ རབ་ དད་ གྱུར་ ཅིང་ ། །

source: quickly reach the level of the buddhas.
bo: སངས་རྒྱས་ རྣམས་ ཀྱིས་ ཡང་ མྱུར་ དུ་ འཐོབ་པ་ -ར་ འགྱུར་ ། །

source: Have attained complete nirvāṇa, Without any remainder.
bo: ཕུང་པོ་ ལྷག་མ་ མེད་པ་ -ར་ ཡོངས་སུ་ མྱ་ངན་ ལས་ ། །།

source: This was translated, edited, and finalized by the Indian scholar Surendrabodhi, the translator-editor Bhande Yeshe De, and others.
bo: རྒྱ་གར་ གྱི་ མཁན་པོ་ སུ་ རེན་ དྲ་བོ་ དྷི་ དང་ ། ཞུ་ཆེན་ གྱི་ ལོཙྪ་བ་ བན་དེ་ ཡེ་ཤེས་ སྡེ་ ལ་སོགས་པ་ -ས་ བསྒྱུར་ ཅིང་ ཞུས་ ཏེ་ གཏན་ ལ་ ཕབ་པ་ །། །

source: “He may establish tall and beautiful stūpas, Beautified with fine gems to the summit of existence;
bo: མཆོད་རྟེན་ གནམ་ འཕང་ མཐོ་བ་ སྲིད་རྩེ་ -འི་ མཐར་ཐུག་པ་ ། །

source: Thus spoke the Bhagavat
bo: བཅོམ་ལྡན་འདས་ གྱིས་ དེ་སྐད་ ཅེས་ བཀའ་ སྩལ་ ནས་ ། །

source: This completes the Noble Mahāyāna Sūtra The Ornament of the Light of Awareness That Enters the Domain of All Buddhas.
bo: འཕགས་པ་ སངས་རྒྱས་ ཐམས་ཅད་ ཀྱི་ ཡུལ་ ལ་ འཇུག་པ་ ཡེ་ཤེས་ སྣང་བ་ -འི་ རྒྱན་ ཅེས་བྱ་བ་ ཐེག་པ་ ཆེན་པོ་ -འི་ མདོ་ རྫོགས་ སོ་ །། །

source: Here the body of the tathāgatas, Like the space-element, is shown to all.”
bo: དེ་བཞིན་ གཤེགས་པ་ རྣམས་ ཀྱི་ སྐུ་ལུས་ ནམ་མཁའ་ ཡི་ ། ། ཁམས་ དང་ འདྲ་བ་ ཐམས་ཅད་ འདི་ -ར་ ནི་ བསྟན་པ་ ཡིན་ ། །

source: “This sūtra is extolled by the sugatas, And upheld by many bodhisattvas.
bo: མདོ་ འདི་ བདེ་བ་ -ར་ གཤེགས་པ་ རྣམས་ ཀྱིས་ རབ་ བསྔགས་ ཤིང་ ། ། བྱང་ཆུབ་ སེམས་དཔའ་ མང་པོ་ -ས་ ཡོངས་སུ་ བཟུང་བ་ ཡིན་ ། །

source: His merit will indeed be immeasurable, And he shall obtain awakening, in accordance with his wish.
bo: དེ་ ཡི་ བསོད་ནམས་ དཔག་ ཏུ་ ཡོད་པ་ -ར་ མི་ འགྱུར་ ཏེ་ ། ། ཇི་ལྟར་ འདོད་པ་ བཞིན་ དུ་ བྱང་ཆུབ་ ཐོབ་པ་ -ར་ འགྱུར་ ། །

source: Removing all stains of miserliness and being without fear,
bo: སེར་སྣ་ -འི་ དྲི་མ་ བསལ་བ་ -ར་ གྱུར་ ཅིང་ འཇིགས་མེད་པ་ -འི་ ། །

source: “If a bodhisattva upholds this Dharma,
bo: བྱང་ཆུབ་ སེམས་དཔའ་ གང་ཞིག་ ཆོས་ འདི་ འཛིན་བྱེད་ ན་ ། །

source: Then the fruit of his merit exceeds the former.
bo: དེ་ ནི་ དེ་ ཡི་ བསོད་ནམས་ འབྲས་བུ་ ཁྱད་པར་ འཕགས་ ། །

source: “Yet, when hearing this very sūtra, a bodhisattva May form the wish to establish it well, Either within his body or within a book.
bo: འདི་ ན་ བྱང་ཆུབ་ སེམས་དཔའ་ གང་ཞིག་ འདི་འདྲ་བ་ -འི་ ། ། མདོ་སྡེ་ འདི་ ཐོས་ ལུས་ ལ་ གནས་པ་ -ར་ འགྱུར་བ་ -འམ་ ། ། གླེགས་བམ་ བྲི་བ་ བྱས་ ཏེ་ གཞག་པ་ -ར་ བྱེད་ འདོད་ ན་ ། །

source: With parasols, standards, and the sound of bells, They would rise to the summit of existence.
bo: ཁྱོན་ དང་ ལྡན་པ་ -ར་ གྱུར་པ་ -འང་ སྲིད་རྩེ་ ཇི་བཞིན་པ་ ། ། རིན་ཆེན་ མཛེས་པ་ -ས་ སྤྲ་ -ས་ ཤིང་ གདུགས་ དང་བ་ དན་ དང་ ། ། དེ་བཞིན་ དྲིལ་སྒྲ་ -ས་ མཛེས་པ་ -ར་ བྱེད་ དུ་ བཅུག་ གྱུར་པ་ -ས་ ། །

source: “The Sugata taught this sūtra, a lamp for gods and men:
bo: བདེ་གཤེགས་ བསྟན་པ་ -འི་ མདོ་སྡེ་ སྒྲོན་མ་ -ར་ གྱུར་པ་ འདི་ ། ། གང་ གིས་ ལྷ་ དང་ མི་ལ་ ཡང་དག་ བསྟན་ བྱས་པ

source: Each bodhisattva, everywhere within the ten directions, would then see as many buddhas, as many bhagavats, as there are atomic particles in inexpressibly numerous, tens of quintillions of buddhafields.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ རེ་རེ་ -ས་ ཀྱང་ ཕྱོགས་ བཅུ་ -འི་ ཕྱོགས་ཆ་ རེ་རེ་ -ར་ སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ སངས་རྒྱས་ ཀྱི་ ཞིང་ བརྗོད་ དུ་ མེད་པ་ བྱེ་བ་ ཁྲག་ཁྲིག་ འབུམ་ཕྲག་ བཅུ་ -འི་ རྡུལ་ ཕྲ་རབ་ ཀྱི་ རྡུལ་ སྙེད་ དག་ མཐོང་བ་ -ར་ གྱུར་ ཅིང་ །

source: To each tathāgata, each and every day, he would offer as many world spheres as there are atomic particles in inexpressibly numerous, tens of trillions of buddhafields, after filling them with the precious vaśirāja gems.
bo: དེ་བཞིན་ གཤེགས་པ་ རེ་རེ་ ལ་ ཡང་ ཉིན་ གཅིག་ བཞིན་ དུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ སངས་རྒྱས་ ཀྱི་ ཞིང་ བརྗོད་ དུ་ མེད་པ་ བྱེ་བ་ ཁྲག་ཁྲིག་ འབུམ་ཕྲག་ བཅུ་ -འི་ རྡུལ་ ཕྲ་རབ་ ཀྱི་ རྡུལ་ སྙེད་ དག་ ནོར་བུ་ རིན་པོ་ཆེ་ དབང་ གི་ རྒྱལ་པོ་ -ས་ ཡོངས་སུ་ བཀང་ སྟེ་ ། དབུལ་བ་ -ར་ ཕུལ་བ་

source: But another bodhisattva, believing in this Dharma teaching, may give just one morsel of food to a sentient being born as an animal.
bo: བྱང་ཆུབ་ སེམས་དཔའ་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ འདི་ ལ་མོ་ -ས་པ་ -ར་ གྱུར་པ་ གཞན་ ཞིག་ གིས་ ཐ་ན་ དུད་འགྲོ་ -འི་ སྐྱེ་གནས་ སུ་ སྐྱེས་པ་ -འི་ སེམས་ཅན་ ལ་ སྦྱིན་པ་ ཁམ་ གཅིག་ ཙམ་ ཞིག་ བྱིན་པ་ -ར་ གྱུར་ ནས་ ། །

source: By using one’s own special powers, Someone may travel through the ten directions,
bo: གང་ཞིག་ རྫུ་འཕྲུལ་ སྟོབས་ ཀྱིས་ ཕྱོགས་ བཅུར་ སོང་ ནས་ ནི་ ། །

source: And worship a hundred million buddhas.
bo: སངས་རྒྱས་ བྱེ་བ་ ཕྲག་ བཅུ་ དག་ ལ་ མཆོད་ བྱེད་ ཅིང་ །
