Repository: OpenPecha-Data/0fbd31ce377b49a79da3bbcf2402ad48
Catalog: *.po
Languages: bo

source: the Tathāgata, the Arhat, the Perfect and Complete Buddha with unobstructed brilliance comes to be counted as arisen in the world.
bo: དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་པ་ -ར་ རྫོགས་པ་ -འི་ སངས་རྒྱས་ སྤོབས་པ་ ཐོགས་པ་ མི་ མངའ་བ་ དང་ ལྡན་པ་ འཇིག་རྟེན་ དུ་ བྱུང་ ངོ་ །

source: “Whatever he says is thus (tathā), undistorted, thus and not otherwise. Therefore,
bo: དེ་ གང་ཅི་ གསུང་བ་ དེ་དག་ ཐམས་ཅད་ ཀྱང་ དེ་བཞིན་པ་ མ་ ནོར་བ་ དེ་བཞིན་པ་ གཞན་མ་ ཡིན་པ་ དེ་བཞིན་པ་ ཡིན་པ་ -ས་ །

source: he was given the name Tathāgata among gods and men.
bo: དེ་ ལ་ ལྷ་ དང་ མི་ རྣམས་ ཀྱི་ ནང་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཞེས་ བྱ་བ་ -འི་ མཚན་ དུ་ བཏགས་པ་ ཡིན་ ཏེ་ །

source: Mañjuśrī, this word appears among gods and men: Tathāgata.
bo: འཇམ་དཔལ་ དེ་ལས་ ལྷ་ དང་ མི་ རྣམས་ ཀྱི་ ནང་ དུ་ དེ་བཞིན་ གཤེགས་པ་ ཞེས་ བྱ་བ་ -འི་ སྒྲ་ འབྱུང་བ་ -ར་ ཡང་ འགྱུར་ རོ་ ། །

source: However, Mañjuśrī, there is no Tathāgata to be found.
bo: འཇམ་དཔལ་ དེ་བཞིན་ གཤེགས་པ་ ནི་ ཡོད་པ་ མ་ཡིན་པ་ སྟེ་ །

source: The Tathāgata, Mañjuśrī, is not a sign,
bo: འཇམ་དཔལ་ དེ་བཞིན་ གཤེགས་པ་ ནི་ མཚན་མ་ མེད་པ་ །

source: and he is free from signs.
bo: མཚན་མ་ དང་ བྲལ་བ་ །

source: He is unreal, non-arisen, and non-ceasing.
bo: མ་བྱུང་བ་ ། མ་ སྐྱེས་པ་ ། མ་ འགགས་པ་ ཡིན་ ནོ་ ། །

source: “On the other hand, Mañjuśrī, the appearance of the Tathāgata satisfies and entertains this world, including the gods,
bo: འཇམ་དཔལ་ དེ་བཞིན་ གཤེགས་པ་ -འི་ སྤོབས་པ་ དེ་ -ས་ ལྷ་ དང་ བཅས་པ་ -འི་ འཇིག་རྟེན་ ཆོས་ ཀྱིས་ ཡང་དག་པ་ -ར་ ཚིམ་པ་ -ར་ མཛད་ ཅིང་ །

source: And then, due to the ripening of previous karma of beginner bodhisattvas and immature, ordinary people who are guided by means of nirvāṇa,
bo: བྱང་ཆུབ་ སེམས་དཔའ་ ལས་ དང་པོ་པ་ རྣམས་ དང་ ། བྱིས་པ་ སོ་སོ་ -འི་ སྐྱེ་བོ་ ཡོངས་སུ་ མྱ་ངན་ ལས་ འདའ་བ་ -ས་ འདུལ་བ་ གཞན་དག་ གི་ སྔོན་ གྱི་ ལས་ ཀྱི་ རྣམ་པ་ -ར་ སྨིན་པ་ -ས་ མི་སྣང་བ་ -ར་ གྱུར་པ་ ན་ །

source: They think, ‘The Tathāgata has passed into complete nirvāṇa.’
bo: དེ་ གཞི་ དེ་དག་ གིས་ འདི་ སྙམ་ དུ་ དེ་བཞིན་ གཤེགས་པ་ ཡོངས་སུ་ མྱ་ངན་ ལས་ འདས་ སོ་ སྙམ་ དུ་ ཡང་ སེམས་ ཏེ་ །

source: However, Mañjuśrī, the Tathāgata neither arises nor ceases.
bo: འཇམ་དཔལ་ དེ་བཞིན་ གཤེགས་པ་ ནི་ སྐྱེ་བ་ ཡང་ མེད་ ། འགག་པ་ ཡང་ མེད་ དོ་ ། །

source: The Tathāgata, Mañjuśrī, is non-arisen and non-ceasing.
bo: འཇམ་དཔལ་ དེ་བཞིན་ གཤེགས་པ་ ནི་ མ་ སྐྱེས་པ་ མ་ འགགས་པ་ སྟེ་ །

source: “Mañjuśrī, when some water is taken as a point of reference for an unreal cloud
bo: འཇམ་དཔལ་ ཇི་ལྟར་ ཆར་པ་ དམིགས་པ་ ལས་ སྤྲིན་ མ་བྱུང་བ་ །

source: that has not arisen nor ceased, and is non-existent,
bo: མ་ སྐྱེས་པ་ ། མ་ འགགས་པ་ ། ཡོད་པ་ མ་ཡིན་པ་ །

source: the designation ‘cloud’ is established in the world. In the very same way,
bo: དེ་ ལ་ འཇིག་རྟེན་ ན་ སྤྲིན་ སྤྲིན་ ཅེས་བྱ་བ་ -ར་ འདོགས་པ་ བྱུང་བ་ དེ་བཞིན་ དུ་ ། །

source: “It is as follows: Mañjuśrī,
bo: འཇམ་དཔལ་ འདི་ལྟ་སྟེ་ དཔེར་ན་ །

source: every day the great and unsurpassed Brahmā, who controls ten trichiliocosms, looks upon all the classes of gods, as far as the class of the gods of the Four Great Kings.
bo: སྟོང་གསུམ་ འབུམ་ཕྲག་ བཅུ་ ལ་ དབང་ སྒྱུར་བ་ -འི་ ཚངས་པ་ ཆེན་པོ་ ཟིལ་ གྱིས་ མི་ ནོན་ ཅིང་ ཟིལ་ གྱིས་ གནོན་པ་ -ར་ བྱེད་པ་ ནི་ ཉིན་ གཅིག་ བཞིན་ དུ་ རྒྱལ་ཆེན་ བཞི་ -འི་ ལྷ་ -འི་ རིས་ ཀྱི་ མཐར་ཐུག་པ་ -འི་ བར་ གྱི་ ལྷ་ -འི་ རིས་ ཐམས་ཅད་ ལ་ རྣམ་པ་ -ར་ ལྟ་བ་ -ར་ བྱེད་ དེ་ །

source: At that time, Mañjuśrī, while the great Brahmā, who controls ten trichiliocosms, looks upon all the classes of gods,
bo: འཇམ་དཔལ་ སྟོང་གསུམ་ འབུམ་ཕྲག་ བཅུ་ ལ་ དབང་ སྒྱུར་བ་ -འི་ ཚངས་པ་ ཆེན་པོ་ ཟིལ་ གྱིས་ མི་ ནོན་ ཅིང་ ། ཟིལ་ གྱིས་ གནོན་པ་ -ར་ བྱེད་པ་ སྟེ་ ། ལྷ་ -འི་ རིས་ ཐམས་ཅད་ ལ་ རྣམ་པ་ -ར་ ལྟ་བ་ -ར་ བྱེད་པ་ དེ་ -འི་ ཚེ་ ན་ །

source: they all abandon their games of pleasure, delights, and enjoyments.
bo: ལྷ་ -འི་ བུ་ ཐམས་ཅད་ རང་རང་ གི་ འདོད་པ་ -འི་ རྩེད་མོ་ དང་ ། དགའ་བ་ དང་ ལོངས་སྤྱོད་ དག་ སྤངས་ ཏེ་ །

source: they respectfully fold their hands
bo: གུས་པ་ དང་ བཅས་པ་ -ས་ ཐལ་མོ་ སྦྱར་ ནས་ །

source: and look toward the great Brahmā without blinking.
bo: ཚངས་པ་ ཆེན་པོ་ དེ་ ལ་ མིག་ མི་ འཛུམས་པ་ -ར་ ལྟ་བ་ -ར་ བྱེད་ དོ་ ། །

source: For a moment, the great Brahmā offers sight of himself to all the classes of gods.
bo: ཚངས་པ་ ཆེན་པོ་ དེ་ཡང་ གནས་ ནས་ མི་གཡོ་བ་ -ར་ ལྷ་ -འི་ བུ་ ཐམས་ཅད་ ཡུད་ཙམ་ ཞིག་ བདག་ ལྟར་ འཇུག་པ་ -ར་ བྱེད་ དེ་ །

source: At that time, the gods all long to be born in the world of the great Brahmā,
bo: དེ་ -འི་ ཚེ་ ན་ ལྷ་ -འི་ བུ་ དེ་དག་ ཚངས་པ་ -འི་ འཇིག་རྟེན་ དུ་ སྐྱེ་བ་ -ར་ འདོད་ ཅིང་ །

source: and they dedicate their roots of what is wholesome toward taking birth in the world of the great Brahmā.
bo: དགེ་བ་ -འི་ རྩ་བ་ རྣམས་ ཀྱང་ ཚངས་པ་ -འི་ འཇིག་རྟེན་ དུ་ སྐྱེ་བ་ -ར་ བྱ་བ་ -འི་ ཕྱིར་ ཡོངས་སུ་ སྔོ་བ་ -ར་ བྱེད་ དོ་ །

source: “Moreover, Mañjuśrī, that great Brahmā, without falling down from that Brahmā Palace,
bo: འཇམ་དཔལ་ ཚངས་པ་ ཆེན་པོ་ དེ་ཡང་ ཚངས་པ་ -འི་ གཞལ་མེད་ ཁང་ དེ་ནས་ འཆི་ འཕོ་བ་ -ར་ མི་ བྱེད་ བཞིན་ དུ་ །

source: thanks to the power of his previous aspirations and due to the prior accumulation of virtue on the part of the gods.
bo: སྔོན་ གྱི་ སྨོན་ལམ་ གྱི་ བྱིན་ གྱིས་ བརླབས་ དང་ ། ལྷ་ -འི་ བུ་ དེ་དག་ གི་ སྔོན་ གྱི་ དགེ་བ་ -འི་ རྩ་བ་ བསགས་པ་ -འི་ མཐུ་ -ས་ །

source: empowers another great Brahmā as the controller of ten trichiliocosms,
bo: སྟོང་གསུམ་ འབུམ་ཕྲག་ བཅུ་ ལ་ དབང་ སྒྱུར་བ་ -འི་ ཚངས་པ་ ཆེན་པོ་ ཟིལ་ གྱིས་ མི་ ནོན་ ཅིང་ ཟིལ་ གྱིས་ གནོན་པ་ -ར་ བྱེད་པ་ གཞན་ ཞིག་ བྱིན་ གྱིས་ རློབ་པ་ -ར་ བྱེད་ དོ་ ། །

source: “Mañjuśrī, that emanated great Brahmā looks upon all the classes of gods, as far as the class of the gods of the Four Great Kings.
bo: འཇམ་དཔལ་ སྤྲུལ་པ་ -འི་ ཚངས་པ་ ཆེན་པོ་ དེ་ཡང་ ཉིན་ གཅིག་ བཞིན་ དུ་ རྒྱལ་ཆེན་ བཞི་ -འི་ རིས་ ཀྱི་ མཐར་ཐུག་པ་ -འི་ བར་ གྱི་ ལྷ་ -འི་ རིས་ ཐམས་ཅད་ ལ་ རྣམ་པ་ -ར་ ལྟ་བ་ -ར་ བྱེད་ དེ་ །

source: At that time, Mañjuśrī,
bo: འཇམ་དཔལ་ དེ་ -འི་ ཚེ་ ན་ །

source: among all the classes of gods, all the scions of the gods abandon their games of pleasure, delights, and enjoyments.
bo: ལྷ་ -འི་ རིས་ ཐམས་ཅད་ ཀྱི་ ནང་ ན་ ལྷ་ -འི་ བུ་ ཐམས་ཅད་ རང་རང་ གི་ འདོད་པ་ -འི་ རྩེད་མོ་ དང་ ། དགའ་བ་ དང་ ། ལོངས་སྤྱོད་ དག་ སྤངས་ ཏེ་ །

source: They stop playing their percussion instruments and halt their singing.
bo: སིལ་སྙན་ དང་ ། ཕེག་ རྡོབ་པ་ དང་ ། གླུ་དབྱངས་ ཀྱི་ སྒྲ་ ཐམས་ཅད་ ཞི་བ་ -ར་ བྱས་ ནས་ །

source: Shifting their attention from their games of pleasure and delights,
bo: འདོད་པ་ -འི་ རྩེད་མོ་ དང་ ། དགའ་བ་ དང་ ། ལོངས་སྤྱོད་ ཡིད་ ལ་ བྱེད་པ་ བཏང་ སྟེ་ །

source: they respectfully fold their hands and look toward the great Brahmā without blinking.
bo: གུས་པ་ དང་ བཅས་པ་ -ས་ ཐལ་མོ་ སྦྱར་ ནས་ ། ཚངས་པ་ ཆེན་པོ་ དེ་ ལ་ མིག་ མི་ འཛུམས་པ་ -ར་ ལྟ་བ་ -ར་ བྱེད་ དོ་ །

source: At that time, the gods all long to be born in the world of the great Brahmā, and they dedicate their roots of what is wholesome toward taking birth in the world of the great Brahmā.
bo: དེ་ -འི་ ཚེ་ ན་ ལྷ་ -འི་ བུ་ དེ་དག་ ཀྱང་ ཚངས་པ་ -འི་ འཇིག་རྟེན་ དུ་ སྐྱེ་བ་ -ར་ འདོད་ ཅིང་ དགེ་བ་ -འི་ རྩ་བ་ རྣམས་ ཀྱང་ ཚངས་པ་ -འི་ འཇིག་རྟེན་ དུ་ སྐྱེ་བ་ -ར་ བྱ་བ་ -འི་ ཕྱིར་ ཡོངས་སུ་ སྔོ་བ་ -ར་ ཡང་ བྱེད་ དོ་ ། །

source: “Still, Mañjuśrī, no Brahmā is there to be found.
bo: འཇམ་དཔལ་ དེ་ ལ་ ནི་ ཚངས་པ་ ཡོད་པ་ མ་ ཡིན་ ཏེ་ །

source: Mañjuśrī, Brahmā is empty, dependent,
bo: འཇམ་དཔལ་ ཚངས་པ་ དེ་ ནི་ སྟོང་པ་ ཡ་མ་བརླ་ །

source: unreal, without syllables,
bo: མ་བྱུང་བ་ ཡི་གེ་ མེད་པ་ །

source: without voice, without place,
bo: སྒྲ་མེད་པ་ ཡུལ་མེད་པ་ །

source: and also not an existent thing. He is inconceivable,
bo: དངོས་པོ་ མེད་པ་ བསམ་ དུ་ མེད་པ་ །

source: without signs, and free from mentality, mind, and consciousness.
bo: མཚན་མ་ མེད་པ་ ། སེམས་ དང་ ། ཡིད་ དང་ ། རྣམ་པ་ -ར་ ཤེས་པ་ དང་ བྲལ་བ་ །

source: He is non-arisen and unceasing.
bo: མ་ སྐྱེས་པ་ མ་ འགགས་པ་ ཡིན་མོད་ ཀྱི་ །

source: And yet, Mañjuśrī, a semblance of him offering sight of himself appears among all the classes of gods, by the power of his own previous roots of what is wholesome and aspirations, and due to the previous accumulations of roots of what is wholesome on the part of those gods.
bo: འཇམ་དཔལ་ འོན་ཀྱང་ ཚངས་པ་ ཆེན་པོ་ དེ་ཉིད་ ཀྱི་ སྔོན་ གྱི་ དགེ་བ་ -འི་ རྩ་བ་ དང་ ། སྨོན་ལམ་ གྱི་ བྱིན་ གྱིས་ བརླབས་ དང་ ། ལྷ་ -འི་ བུ་ དེ་དག་ གིས་ སྔོན་ གྱི་ དགེ་བ་ -འི་ རྩ་བ་ བསགས་པ་ -འི་ མཐུ་ -ས་ ལྷ་ -འི་ རིས་ ཐམས་ཅད་ ལ་ བལྟ་ -ར་ སྣང་བ་ -ར་ ཡང་ འགྱུར་ རོ་ ། །

source: “Yet, Mañjuśrī, those gods do not think, ‘This Brahmā is an emanation.
bo: འཇམ་དཔལ་ འོན་ཀྱང་ ལྷ་ -འི་ བུ་ དེ་དག་ འདི་ སྙམ་ དུ་ ཚངས་པ་ ཆེན་པོ་ དེ་ ནི་ སྤྲུལ་པ་ །

source: empty, dependent,
bo: སྟོང་པ་ ཡ་མ་བརླ་ །

source: unreal, without syllables,
bo: མ་བྱུང་བ་ ཡི་གེ་ མེད་པ་ །

source: without voice, without place,
bo: སྒྲ་མེད་པ་ ། ཡུལ་མེད་པ་ །

source: not an existent thing.
bo: དངོས་པོ་ མེད་པ་ །

source: and free from mentality, mind, and consciousness.
bo: སེམས་ དང་ ཡིད་ དང་ རྣམ་པ་ -ར་ ཤེས་པ་ དང་ བྲལ་བ་ །

source: He is non-arisen and unceasing.’
bo: སྐྱེ་བ་ མེད་པ་ འགག་པ་ མེད་པ་ ཡིན་ ནོ་

source: “Mañjuśrī, in the same manner the Tathāgata, the Arhat, the Perfect and Complete Buddha is empty,
bo: འཇམ་དཔལ་ དེ་བཞིན་ དུ་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་པ་ -ར་ རྫོགས་པ་ -འི་ སངས་རྒྱས་ ཀྱང་ སྟོང་པ་ །

source: dependent, unreal, without syllables, without voice, without place, and also not an existent thing.
bo: ཡ་མ་བརླ་ མ་བྱུང་བ་ ། ཡི་གེ་ མེད་པ་ ། སྒྲ་མེད་པ་ ། ཡུལ་མེད་པ་ ། དངོས་པོ་ མེད་པ་ །

source: He is inconceivable, without signs, and free from mentality, mind, and consciousness.
bo: བསམ་ དུ་ མེད་པ་ ། མཚན་མ་ མེད་པ་ ། སེམས་ དང་ ། ཡིད་ དང་ ། རྣམ་པ་ -ར་ ཤེས་པ་ དང་ བྲལ་བ་

source: This is due to the power of his previous aspirations during his practice as a bodhisattva, and also due to the power of all the roots of what is wholesome of the beginner bodhisattvas, of those who set out on the vehicles of the hearers and the pratyekabuddhas, as well as of all the immature, ordinary people.
bo: སྔོན་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ སྤྱད་པ་ སྤྱོད་པ་ -འི་ སྨོན་ལམ་ གྱི་ བྱིན་ གྱིས་ བརླབས་ དང་ ། བྱང་ཆུབ་ སེམས་དཔའ་ ལས་ དང་པོ་པ་ རྣམས་ དང་ ། ཉན་ཐོས་ དང་ རང་ སངས་རྒྱས་ ཀྱི་ ཐེག་པ་ ལ་ ཡང་དག་པ་ -ར་ ཞུགས་པ་ རྣམས་ དང་ ། བྱིས་པ་ སོ་སོ་ -འི་ སྐྱེ་བོ་ ཐམས་ཅད་ ཀྱི་ དགེ་བ་ -འི་ རྩ་བ་ བསགས་པ་ -འི་ མཐུ་ -ས་ །

source: He is seen in the world as a tathāgata adorned with hundreds of thousands of marks, like a reflected image; and he does not move from his place.
bo: དེ་བཞིན་ གཤེགས་པ་ གནས་ ནས་ མི་ གཡོ་ བཞིན་ དུ་ མཚན་ བརྒྱ་ སྟོང་ གིས་ ལེགས་པ་ -ར་ བརྒྱན་པ་ ། འཇིག་རྟེན་ ན་ གཟུགས་བརྙན་ བཞིན་ དུ་ ཀུན་ ཏུ་ སྣང་ངོ་ །

source: “Yet, Mañjuśrī, from the body of the Tathāgata, adorned with hundreds of thousands of marks, during all the empty postures of a tathāgata,
bo: འཇམ་དཔལ་ འོན་ཀྱང་ དེ་བཞིན་ གཤེགས་པ་ ནི་ སྤྱོད་ལམ་ ཐམས་ཅད་ དུ་ དེ་བཞིན་ གཤེགས་པ་ -འི་ སྐུ་ མཚན་ བརྒྱ་ སྟོང་ གིས་ ལེགས་པ་ -ར་ བརྒྱན་པ་ ལས་

source: a great Dharma teaching emanates for the sake of varied sentient beings with diverse beliefs.
bo: སེམས་ཅན་ མོས་པ་ རྣམ་པ་ སྣ་ཚོགས་ ཐ་དད་པ་ རྣམས་ ལ་ ཆོས་སྟོན་པ་ ཆེན་པོ་ ཡང་ འབྱུང་བ་ -ར་ ཡང་ བྱེད་ དོ་ ། །

source: “That Dharma teaching occurs to pacify all the troubles, harms, and afflictions of all sentient beings.
bo: ཆོས་ བསྟན་པ་ དེ་ཡང་ སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ གནོད་པ་ དང་ ། འཁྲུག་པ་ དང་ ཉེ་བ་ -འི་ ཉོན་མོངས་པ་ ཐམས་ཅད་ ཉེ་བར་ ཞི་བ་ -ར་ བྱེད་པ་ འགྱུར་ ཏེ་ །

source: In that regard, the Tathāgata is the same, neutral, without concepts, and does not make any distinctions.
bo: དེ་བཞིན་ གཤེགས་པ་ ནི་ དེ་ ལ་ ཡང་ ཐམས་ཅད་ དུ་ མཉམ་ ཞིང་ བཏང་སྙོམས་ ལ་ རྣམ་པ་ -ར་ མི་ རྟོག་ ཅིང་ བྱེ་བྲག་ མི་ འབྱེད་ དེ་ །

source: Thus, Mañjuśrī, through this explanation you should understand that ‘non-arising and non-cessation’ is an appellation of the Tathāgata.”
bo: འཇམ་དཔལ་ རྣམ་ གྲངས་ དེ་ -ས་ ཀྱང་ འདི་ལྟར་ སྐྱེ་བ་ མེད་པ་ དང་ ། འགག་པ་ མེད་པ་ ཞེས་ བྱ་བ་ དེ་ ནི་ དེ་བཞིན་ གཤེགས་པ་ -འི་ ཚིག་ བླ་དགས་ ཡིན་པ་ -ར་ རིག་པ་ -ར་ བྱ་ -འོ་ ། །

source: Then, at that time, the Bhagavat spoke the following two stanzas:
bo: དེ་ནས་ བཅོམ་ལྡན་འདས་ ཀྱིས་ དེ་ -འི་ ཚེ་ ཚིགས་ སུ་ བཅད་པ་ འདི་དག་ བཀའ་ སྩལ་ ཏོ་ ། །

source: “The Tathāgata always has the quality of non-arising,
bo: དེ་བཞིན་ གཤེགས་པ་ རྟག་ ཏུ་ སྐྱེ་ མེད་ ཆོས་ །

source: And all dharmas resemble the Sugata.
bo: ཆོས་ རྣམས་ ཀུན་ ཀྱང་ བདེ་བ་ -ར་ གཤེགས་ དང་ འདྲ་ ། །

source: Yet immature minds, by their grasping at signs,
bo: བྱིས་པ་ -འི་ བློ་ ཅན་ མཚན་མ་ -ར་ འཛིན་པ་ རྣམས་ ། །

source: Roam the world among non-existent dharmas.
bo: འཇིག་རྟེན་ དག་ ན་ མེད་པ་ -འི་ ཆོས་ ལ་ སྤྱོད་ ། །

source: “The Tathāgata is a reflected image
bo: དེ་བཞིན་ གཤེགས་པ་ ཟག་མེད་ དགེ་བ་ ཡི་ ། །

source: Of the wholesome Dharma without .
bo: ཆོས་ ཀྱི་ གཟུགས་བརྙན་ ཡིན་ ཏེ་ འདི་ ལ་ ནི་ ། །

source: Yet here there is no tathatā and no Tathāgata,
bo: དེ་བཞིན་ཉིད་ མེད་ དེ་བཞིན་ གཤེགས་པ་ -འང་ མེད་ ། །

source: While an image is seen in the entire world.
bo: འཇིག་རྟེན་ ཀུན་ ཏུ་ གཟུགས་བརྙན་ ཀུན་ ཏུ་ སྣང་ ། །

source: “It is as follows: Mañjuśrī,
bo: འཇམ་དཔལ་ འདི་ལྟ་སྟེ་ དཔེར་ན་ །

source: here in Jambūdvīpa the rays of the sun only shine at first on the great king of mighty mountains.
bo: ཉི་མ་ -འི་ དཀྱིལ་འཁོར་ གྱི་ འོད་ཟེར་ དག་ ནི་ འཛམ་བུ་ -འི་ གླིང་ དུ་ དང་པོ་ ཁོ་ན་ -ར་ རི་ -འི་ དབང་པོ་ -འི་ རྒྱལ་པོ་ ཆེན་པོ་ རྣམས་ སྣང་བ་ -ར་ བྱེད་ དོ་ ། །

source: After that, they shine on the Cakravāḍa and Mahācakravāḍa ranges.
bo: དེ་ -འི་ འོག་ ཏུ་ རི་ ཁོར་ཡུག་ དང་ ཁོར་ཡུག་ ཆེན་པོ་ རྣམས་ སྣང་བ་ -ར་ བྱེད་ དོ་ ། །

source: After that, they shine on the elevated regions of the earth.
bo: དེ་ -འི་ འོག་ ཏུ་ ས་ཕྱོགས་ མཐོན་པོ་ མཐོན་པོ་ དག་སྣང་ བར་ བྱེད་ དོ་ ། །

source: After that, they shine on the low-lying regions of the earth here in Jambūdvīpa.
bo: དེ་ -འི་ འོག་ ཏུ་ འཛམ་བུ་ -འི་ གླིང་ འདི་ -འི་ ས་ཕྱོགས་ དམའ་བ་ དམའ་བ་ དག་ ཀྱང་ སྣང་བ་ -ར་ བྱེད་ དོ་ ། །

source: “Yet those sun rays, Mañjuśrī, do not form mental constructs or concepts.
bo: འཇམ་དཔལ་ འོན་ཀྱང་ ཉི་མ་ -འི་ འོད་ཟེར་ དེ་དག་ ནི་ རྟོག་པ་ -ར་ མི་ བྱེད་ ། རྣམ་པ་ -ར་ རྟོག་པ་ -ར་ མི་ བྱེད་ །

source: They do not think or ponder.
bo: སེམས་པ་ -ར་ མི་ བྱེད་ ། རྣམ་པ་ -ར་ སེམས་པ་ -ར་ མི་ བྱེད་ དེ་ །

source: The rays of the sun, Mañjuśrī, are free from mentality, mind, and consciousness;
bo: འཇམ་དཔལ་ ཉི་མ་ -འི་ འོད་ཟེར་ རྣམས་ ནི་ སེམས་ དང་ ། ཡིད་ དང་ ། རྣམ་པ་ -ར་ ཤེས་པ་ དང་ བྲལ་བ་ །

source: they are unborn and unceasing, without characteristics, free from characteristics;
bo: མ་ སྐྱེས་པ་ ། མ་ འགག་པ་ ། མཚན་ཉིད་ མེད་པ་ ། མཚན་ཉིད་ དང་ བྲལ་བ་ །

source: without mental placement, free from mental placement,
bo: ཡིད་ ལ་ བྱེད་པ་ མེད་པ་ ། ཡིད་ ལ་ བྱེད་པ་ དང་ བྲལ་བ་ །

source: without elaboration, free from elaboration;
bo: སྤྲོས་པ་ མེད་པ་ སྤྲོས་པ་ དང་ བྲལ་བ་ །

source: without torment, free from torment;
bo: ཡོངས་སུ་ གདུང་བ་ མེད་པ་ ། ཡོངས་སུ་ གདུང་བ་ དང་ བྲལ་བ་ །

source: not abiding hither, not abiding thither;
bo: ཚུ་རོལ་ ན་ གནས་པ་ མ་ཡིན་པ་ ། ཕ་རོལ་ ན་ གནས་པ་ མ་ ཡིན་ །

source: not high, not low;
bo: མཐོ་བ་ མ་ ཡིན་ ། དམའ་བ་ མ་ ཡིན་ །

source: not bound, not liberated;
bo: བཅིངས་པ་ མ་ ཡིན་ ། གྲོལ་བ་ མ་ ཡིན་ །

source: not knowing, not ignorant;
bo: ཤེས་པ་ དང་ ལྡན་པ་ མ་ ཡིན་ ། ཤེས་པ་ དང་ མི་ ལྡན་པ་ མ་ ཡིན་ །

source: not afflictions, not free from afflictions;
bo: ཉོན་མོངས་པ་ དང་ བཅས་པ་ མ་ ཡིན་ ། ཉོན་མོངས་པ་ མེད་པ་ མ་ ཡིན་ །

source: not speaking the truth, not speaking falsely;
bo: བདེན་པ་ -ར་ སྨྲ་བ་ མ་ ཡིན་ ། བརྫུན་ དུ་ སྨྲ་བ་ མ་ ཡིན་ །

source: not over there, not here;
bo: ཕ་རོལ་ མ་ ཡིན་ ། ཚུ་རོལ་ མ་ ཡིན་ །

source: not on dry land, not in the stream;
bo: ཐང་ལ་ མ་ ཡིན་ ། ཆུ་བོ་ ན་མ་ ཡིན་ །

source: not the domain of reasoning, not the domain of non-reasoning;
bo: རྟོག་གེ་ -འི་ སྤྱོད་ཡུལ་ མ་ ཡིན་ ། རྟོག་གེ་ མ་ཡིན་པ་ -འི་ སྤྱོད་ཡུལ་ མ་ ཡིན་ །

source: neither with form, nor formless.
bo: གཟུགས་ཅན་ མ་ ཡིན་ ། གཟུགས་ མེད་པ་ མ་ ཡིན་མོད་ ཀྱི་ །

source: Yet, Mañjuśrī, due to the distinction of higher, middling, and lower places on the earth,
bo: འཇམ་དཔལ་ འོན་ཀྱང་ ས་གཞི་ མཐོ་བ་ དང་ དམའ་བ་ དང་བ་ -ར་ མ་ -འི་ བྱེ་བྲག་ གིས་

source: the light shines differently, at higher, middling, and lower degrees causing varied shades.
bo: སྣང་བ་ ཆེན་པོ་ དང་ ། ཆུང་ངུ་ དང་བ་ -ར་ མ་ -འི་ འོད་ཟེར་ སྣ་ཚོགས་ སྣང་བ་ -ར་ འགྱུར་ རོ་ ། །

source: “In the same way, Mañjuśrī, the Tathāgata, the Arhat, the Perfect and Complete Buddha does not form mental constructs or concepts.
bo: འཇམ་དཔལ་ དེ་བཞིན་ དུ་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་པ་ -ར་ རྫོགས་པ་ -འི་ སངས་རྒྱས་ ཀྱང་ རྟོག་པ་ -ར་ མི་ བྱེད་ ། རྣམ་པ་ -ར་ རྟོག་པ་ -ར་ མི་ བྱེད་ །

source: Mañjuśrī, the Tathāgata is free from mind, mentality, and consciousness.
bo: འཇམ་དཔལ་ དེ་བཞིན་ གཤེགས་པ་ ནི་ སེམས་ དང་ ། ཡིད་ དང་ ། རྣམ་པ་ -ར་ ཤེས་པ་ དང་ བྲལ་བ་ །

source: not speaking the truth, not speaking falsely;
bo: བདེན་པ་ -ར་ གསུང་པ་ མ་ ཡིན་ ། བརྫུན་པ་ -ར་ གསུང་བ་ མ་ ཡིན་ །

source: not on the shore, nor on the non-shore;
bo: འགྲམ་ ན་མ་ ཡིན་ ། གཤོང་ ནམ་ ཡིན་ །

source: “He is not omniscient, not non-omniscient;
bo: ཐམས་ཅད་ མཁྱེན་པ་ མ་ ཡིན་ ། ཐམས་ཅད་ མི་ མཁྱེན་པ་ མ་ ཡིན་

source: not reasoning, not non-reasoning;
bo: རྟོག་གེ་ མ་ ཡིན་ ། རྟོག་གེ་ མེད་པ་ མ་ ཡིན་ །

source: not acting, not non-acting;
bo: སྤྱོད་པ་ མ་ ཡིན་ ། སྤྱོད་པ་ མེད་པ་ མ་ ཡིན་ །

source: neither mindful nor unmindful,
bo: དྲན་པ་ དང་ ལྡན་པ་ མ་ ཡིན་ ། དྲན་པ་ དང་ མི་ ལྡན་པ་ མ་ ཡིན་ །

source: neither with intention nor free from intention;
bo: སེམས་པ་ མ་ ཡིན་ ། སེམས་པ་ མེད་པ་ མ་ ཡིན་ །

source: neither mind nor without mind;
bo: ཡིད་ མ་ ཡིན་ ། ཡིད་ མེད་པ་ མ་ ཡིན་ །

source: neither originated nor unoriginated;
bo: ཀུན་ ཏུ་ འབྱུང་བ་ མ་ ཡིན་ ། ཀུན་ ཏུ་ མི་ འབྱུང་བ་ མ་ ཡིན་ །

source: neither name nor no name;
bo: མིང་ མ་ ཡིན་ ། མིང་མེད་པ་ མ་ ཡིན་ །

source: neither form nor no form;
bo: གཟུགས་ མ་ ཡིན་ ། གཟུགས་ མེད་པ་ མ་ ཡིན་ །

source: neither verbal expression nor non-verbal expression;
bo: བརྗོད་པ་ མ་ ཡིན་ ། བརྗོད་ དུ་ མེད་པ་ མ་ ཡིན་ །

source: neither a possible object of imputation, nor not a possible object of imputation;
bo: གདགས་པ་ མ་ ཡིན་ ། གདགས་ སུ་ མེད་པ་ མ་ ཡིན་ །

source: neither visible nor invisible;
bo: བལྟ་ -ར་ སྣང་བ་ མ་ ཡིན་ ། བལྟ་ -ར་ མི་སྣང་བ་ མ་ ཡིན་ །

source: neither a conducive way nor not a conducive way;
bo: ཚུལ་ མ་ ཡིན་ ། ཚུལ་ མེད་པ་ མ་ ཡིན་ །

source: neither leading along the way, nor not leading along the way;
bo: ལམ་ སྟོན་པ་ མ་ ཡིན་ ། ལམ་ མི་ སྟོན་པ་ མ་ ཡིན་ །

source: neither having obtained the result, nor not having obtained the result;
bo: འབྲས་བུ་ ཐོབ་པ་ མ་ ཡིན་ ། འབྲས་བུ་ མ་ ཐོབ་པ་ མ་ ཡིན་ །

source: neither a concept, nor not a concept;
bo: རྟོག་པ་ མ་ ཡིན་ ། རྟོག་པ་ མེད་པ་ མ་ ཡིན་ །

source: neither free from concepts, nor not free from concepts.
bo: རྟོག་པ་ དང་ བྲལ་བ་ མ་ ཡིན་ ། རྟོག་པ་ དང་ མ་ བྲལ་བ་ མ་ ཡིན་མོད་ ཀྱི་ །

source: “Similarly, Mañjuśrī, the rays of awareness from the round sun of the Tathāgata shine brilliantly in the three realms, unimpeded throughout the dharmadhātu with neither edge nor center.
bo: འཇམ་དཔལ་ འོན་ཀྱང་ དེ་བཞིན་ གཤེགས་པ་ ཉི་མ་ -འི་ དཀྱིལ་འཁོར་ གྱིས་ ཡེ་ཤེས་ ཀྱི་ འོད་ཟེར་ དག་ ནི་ ཁམས་ གསུམ་པོ་ དེ་དག་ ཏུ་ ཆོས་ ཀྱི་ དབྱིངས་ མཐའ་ དང་ དབུས་ མེད་པ་ དག་ ལ་ ཐོགས་པ་ མེད་པ་ -འི་ འོད་ཟེར་ གྱི་ སྣང་བ་ དག་ གཏོང་བ་ -ར་ མཛད་ ཅིང་ །

source: Once they shine, they first descend upon the bodies of bodhisattvas, whose aspirations are like the great lord of mountains.
bo: ཡེ་ཤེས་ ཀྱི་ འོད་ཟེར་ བཏང་བ་ དག་ གིས་ ཀྱང་ དང་པོ་ ཁོ་ན་ -ར་ བྱང་ཆུབ་ སེམས་དཔའ་ ལྷག་པ་ -འི་ བསམ་པ་ -འི་ རི་ -འི་ དབང་པོ་ -འི་ རྒྱལ་པོ་ ཆེན་པོ་ ལྟ་བུ་ དང་ ལྡན་པ་ རྣམས་ ཀྱི་ ལུས་ ལ་ འབབ་པ་ -ར་ འགྱུར་ རོ་ ། །

source: After that, they descend upon the bodies of those who set forth on the Vehicle of Pratyekabuddhas.
bo: དེ་ -འི་ འོག་ ཏུ་ རང་ སངས་རྒྱས་ ཀྱི་ ཐེག་པ་ ལ་ ཡང་དག་པ་ -ར་ ཞུགས་པ་ རྣམས་ ཀྱི་ ལུས་ ལ་ འབབ་པ་ -ར་ འགྱུར་ རོ་ ། །

source: Then they descend upon the bodies of those who have set forth on the Hearers’ Vehicle.
bo: དེ་ -འི་ འོག་ ཏུ་ ཉན་ཐོས་ ཀྱི་ ཐེག་པ་ ལ་ ཡང་དག་པ་ -ར་ ཞུགས་པ་ རྣམས་ ཀྱི་ ལུས་ ལ་ འབབ་པ་ -ར་ འགྱུར་ རོ་ ། །

source: After that, they descend upon the body of sentient beings with wholesome aspirations, according to their specific inclinations.
bo: དེ་ -འི་ འོག་ ཏུ་ སེམས་ཅན་ ལྷག་པ་ -འི་ བསམ་པ་ དགེ་བ་ དང་ ། མོས་པ་ ཇི་ལྟ་བ་ དང་ ལྡན་པ་ རྣམས་ ཀྱི་ ལུས་ ལ་ འབབ་པ་ -ར་ འགྱུར་ རོ་ ། །

source: After that, the rays of awareness from the round sun of the Tathāgata even descend upon the body of those sentient beings with mental continua that are stuck in what is wrong.
bo: དེ་ -འི་ འོག་ ཏུ་ དེ་བཞིན་ གཤེགས་པ་ ཉི་མ་ -འི་ དཀྱིལ་འཁོར་ གྱི་ ཡེ་ཤེས་ ཀྱི་ འོད་ཟེར་ དག་ ཐ་ན་ སེམས་ཅན་ ལོག་པ་ ཉིད་ དུ་ ངེས་པ་ -འི་ སེམས་ ཀྱི་ རྒྱུད་ དང་ ལྡན་པ་ རྣམས་ ཀྱི་ ལུས་ ལ་ འབབ་པ་ -ར་ འགྱུར་ ཞིང་ །

source: The rays assist all these beings by producing causes for what will come later, and increase their wholesome dharmas.
bo: དེ་དག་ ལ་མ་ འོངས་པ་ -འི་ རྒྱུ་ ཡང་དག་པ་ -ར་ སྐྱེད་པ་ -ས་ ཕན་ འདོགས་པ་ དང་ ། དགེ་བ་ -འི་ ཆོས་ རྣམས་ ཀྱིས་ ཡང་དག་པ་ -ར་ འཕེལ་བ་ -ར་ ཡང་ བྱེད་ དོ་ ། །

source: “In that respect, Mañjuśrī, the Tathāgata is everywhere the same, neutral, without concepts, and does not make any distinctions.
bo: འཇམ་དཔལ་ དེ་བཞིན་ གཤེགས་པ་ ནི་ དེ་དག་ ལ་ ཡང་ ཐམས་ཅད་ དུ་ མཉམ་ ཞིང་ བཏང་སྙོམས་ ལ་ རྣམ་པ་ -ར་ མི་ རྟོག་ ཅིང་ བྱེ་བྲག་ མི་ འབྱེད་ དེ་ །

source: Moreover, Mañjuśrī, the round sun of the Tathāgata’s awareness does not think, ‘I will teach this person the vast Dharma,
bo: འཇམ་དཔལ་ དེ་བཞིན་ གཤེགས་པ་ ཉི་མ་ -འི་ དཀྱིལ་འཁོར་ གྱི་ ཡེ་ཤེས་ ཀྱི་ འོད་ཟེར་ ནི་ འདི་ སྙམ་ དུ་ བདག་ གིས་ སེམས་ཅན་ འདི་ ལ་ ནི་ ཆོས་ རྒྱ་ཆེན་པོ་ བསྟན་པ་ -ར་ བྱ་ -འོ་ ། །

source: but I will not teach that one.’ Neither do they have the concept
bo: འདི་ ལ་ ནི་ བསྟན་པ་ -ར་ མི་ བྱ་ -འོ་ སྙམ་ དུ་ ཡང་ མི་ སེམས་ ལ་ །

source: ‘This person has vast beliefs
bo: འདི་ སྙམ་ དུ་ སེམས་ཅན་ འདི་ ནི་ རྒྱ་ཆེན་པོ་ ལ་མོ་ -ས་པ་ ཡིན་ ནོ་ ། །

source: that one has middling beliefs
bo: འདི་ ནི་ བར་མ་ ལ་མོ་ -ས་པ་ ཡིན་ ནོ་ ། །

source: This one has belief in the Hearers’ Vehicle.
bo: འདི་ ནི་ ཉན་ཐོས་ ཀྱི་ ཐེག་པ་ ལ་མོ་ -ས་པ་ ཡིན་ ནོ་ ། །

source: This one has wholesome aspirations
bo: འདི་ ནི་ བསམ་པ་ དགེ་བ་ ཡིན་ ནོ་ ། །

source: while that one is low, with wrong aspirations.’ “Mañjuśrī, the round sun of the Tathāgata’s awareness does not think
bo: འདི་ ནི་ དམན་པ་ དང་ ལོག་པ་ ལ་མོ་ -ས་པ་ ཡིན་ ནོ་ སྙམ་ དུ་ རྣམ་པ་ -ར་ རྟོགས་པ་ -ར་ ཡང་ མི་ བྱེད་ དེ་ །

source: This sentient being has vast beliefs, so I will teach him the Great Vehicle.
bo: འཇམ་དཔལ་ དེ་བཞིན་ གཤེགས་པ་ ནི་ འདི་ སྙམ་ དུ་ ། སེམས་ཅན་ འདི་ ནི་ རྒྱ་ཆེན་པོ་ ལ་མོ་ -ས་པ་ ཡིན་ གྱིས་ འདི་ ལ་ ནི་ ཐེག་པ་ ཆེན་པོ་ བསྟན་པ་ -ར་ བྱ་ -འོ་ །

source: This one has middling beliefs
bo: འདི་ ནི་ ལྷག་པ་ -འི་ བསམ་པ་ བར་མ་ ལ་མོ་ -ས་པ་ ཡིན་ གྱིས

source: so I will teach him the Pratyekabuddha Vehicle
bo: འདི་ ལ་ ནི་ རང་ སངས་རྒྱས་ ཀྱི་ ཐེག་པ་ བསྟན་པ་ -ར་ བྱ་ -འོ་ །

source: This one has belief in the Hearers’ Vehicle,
bo: འདི་ ནི་ ཉན་ཐོས་ ཀྱི་ ཐེག་པ་ ལ་མོ་ -ས་པ་ ཡིན་ གྱིས་ །

source: so I will teach him the Hearers’ Vehicle.
bo: འདི་ ལ་ ནི་ ཉན་ཐོས་ ཀྱི་ ཐེག་པ་ བསྟན་པ་ -ར་ བྱ་ -འོ་ །

source: I shall come to understand the aspirations of sentient beings with either wholesome or unwholesome aspirations
bo: སེམས་ཅན་ བསམ་པ་ དགེ་བ་ རྣམས་ ཀྱི་ བསམ་པ་ རྟོགས་པ་ -ར་ བྱས་ ནས་ །

source: then purify them
bo: བསམ་པ་ རྣམ་པ་ -ར་ སྦྱང་བ་ -ར་ བྱ་ -འོ་ ། །

source: and straighten up their view. Even for sentient beings stuck in what is wrong
bo: སེམས་ཅན་ ལོག་པ་ ཉིད་ དུ་ མོས་པ་ -འི་ བར་ དག་ ནི་ ལྟ་བ་ དྲང་པོ་ བྱ་ ཞིང་ །

source: The light of the rays of awareness from the round sun of the Tathāgata does not have any such concepts.
bo: དེ་བཞིན་ གཤེགས་པ་ ཉི་མ་ -འི་ དཀྱིལ་འཁོར་ གྱི་ ཡེ་ཤེས་ ཀྱི་ འོད་ཟེར་ སྣང་བ་ ནི་ དེ་ལྟར་ རྣམ་པ་ -ར་ རྟོག་པ་ -ར་ མི་ བྱེད་ དོ་ ། །

source: And why?
bo: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན་ ། །

source: On the other hand, Mañjuśrī, because of variations in sentient beings’ inclinations to wholesome intent, the light of the rays of awareness from the round sun of the Tathāgata is varied too.
bo: འཇམ་དཔལ་ འོན་ཀྱང་ སེམས་ཅན་ རྣམས་ ཀྱི་ དགེ་བ་ -འི་ བསམ་པ་ -འི་ རྒྱུད་ སྣ་ཚོགས་ དག་ ལ་ དེ་བཞིན་ གཤེགས་པ་ ཉི་མ་ -འི་ དཀྱིལ་འཁོར་ གྱི་ ཡེ་ཤེས་ ཀྱི་ འོད་ཟེར་ གྱི་ སྣང་བ་ སྣ་ཚོགས་ དག་ འབྱུང་བ་ -ར་ ཡང་ འགྱུར་ རོ་ །།

source: Because the light of the rays of awareness from the round sun of the Tathāgata has cut off all constructs, concepts, and elaborations.
bo: དེ་བཞིན་ གཤེགས་པ་ ཉི་མ་ -འི་ དཀྱིལ་འཁོར་ གྱི་ ཡེ་ཤེས་ ཀྱི་ འོད་ཟེར་ སྣང་བ་ ནི་ རྟོག་པ་ དང་ ། རྣམ་པ་ -ར་ རྟོག་པ་ དང་ ། ཡོངས་སུ་ རྟོག་པ་ དང་ ། སྤྲོས་པ་ ཐམས་ཅད་ ཡང་དག་པ་ -ར་ རྒྱུན་ ཆད་པ་ ཡིན་པ་ -འི་ ཕྱིར་ རོ་ །
